[
    {
        "title": "As Election Day Nears, Yard Signs Disappear",
        "date": "2024-11-03",
        "content": "Modern technology including doorbell cameras and tiny tracking devices have turned the tables on sign stealers."
    },
    {
        "title": "The Daily Beast Tries to Claw Its Way Back to Relevance",
        "date": "2024-11-03",
        "content": "Can Joanna Coles and Ben Sherwood revive the once-buzzy news site and reclaim their perches atop the New York media world? Their own staff isn’t sure."
    },
    {
        "title": "Live From New York, It’s Kamala Harris on ‘SNL’",
        "date": "2024-11-03",
        "content": "The vice president made a brief appearance on “Saturday Night Live” this weekend."
    },
    {
        "title": "This Election Pits the Guardians Against the Counterrevolutionaries",
        "date": "2024-11-03",
        "content": "There’s something very different about Harris vs. Trump."
    },
    {
        "title": "A Second Trump Term? Three Conservative Columnists Unpack What Could Happen.",
        "date": "2024-11-03",
        "content": "What will happen after Tuesday to Trumpism and the G.O.P. if Donald Trump wins — or loses?"
    },
    {
        "title": "Our 61 Focus Groups Make Me Think Trump Has a Good Chance of Winning",
        "date": "2024-11-03",
        "content": "What we learned from interviewing nearly 700 Americans over nearly three years."
    },
    {
        "title": "Trump Laughs as Supporter Yells That Harris ‘Worked on the Corner’",
        "date": "2024-11-03",
        "content": "“This place is amazing,” Donald Trump said after a supporter shouted the crude comment at a rally. A quick clarification followed: “Just remember, it’s other people saying it. It’s not me.”"
    },
    {
        "title": "At Women’s March in Washington, Hope That They Will Hold Off Trump",
        "date": "2024-11-03",
        "content": "Thousands of women rallied in the capital and across the country for a Kamala Harris presidency — and to proclaim their resistance to Republican aims to restrict women’s reproductive rights."
    },
    {
        "title": "Robert F. Kennedy Jr. Says Trump Will Seek to Remove Fluoride From Drinking Water",
        "date": "2024-11-03",
        "content": "Donald J. Trump has said he would give Mr. Kennedy, a former rival who has long promoted unproven medical theories, a prominent health role if he wins."
    },
    {
        "title": "Kamala Harris Joins ‘S.N.L.’ for a Pep Talk With Maya Rudolph",
        "date": "2024-11-03",
        "content": "Appearing in a mirror opposite her longtime impersonator, the vice president gave a little positive encouragement to her comedic reflection."
    },
    {
        "title": "Biden Returns to His Home Turf to Make Final Pitches for Harris",
        "date": "2024-11-02",
        "content": "Though President Biden has made verbal gaffes on the campaign trail, the Harris campaign still considers him an asset in blue-collar communities like Scranton, Pa."
    },
    {
        "title": "Can I Have a Raise?",
        "date": "2024-11-02",
        "content": "Share Sid Sivakumar’s Sunday puzzle with management."
    },
    {
        "title": "What to Know About the Electoral College",
        "date": "2024-11-02",
        "content": "“This is a very unique and bespoke system that I think nobody would create again today,” one expert said."
    },
    {
        "title": "Trump and Harris Offer Night-and-Day Views of the Economy",
        "date": "2024-11-02",
        "content": "The candidates outlined vastly different messages in Georgia, North Carolina and Virginia, with Donald J. Trump exaggerating how bad the recent jobs report was and Kamala Harris promising to bring down costs."
    },
    {
        "title": "Biden Left the Presidential Race, but His Legacy Depends on It",
        "date": "2024-11-02",
        "content": "The Trump campaign has taken aim at many of President Biden’s signature legislative achievements."
    },
    {
        "title": "Trump’s Microphone Trouble in Milwaukee Leaves Him ‘Seething’",
        "date": "2024-11-02",
        "content": "After rally goers complained that they could not hear him, the former president asked, “Do you want to see me knock the hell out of people backstage?”"
    },
    {
        "title": "Will Democracy Ever Not Be on the Ballot?",
        "date": "2024-11-02",
        "content": "It is on Tuesday. It was four years ago — and eight years ago, too."
    },
    {
        "title": "Split on Economic Policy Puts Germany’s Government at Risk of Collapse",
        "date": "2024-11-02",
        "content": "A breakup of the divided and unpopular coalition well before elections set for next September could leave the country directionless at a critical time for Europe."
    },
    {
        "title": "Photographing Every President Since Reagan",
        "date": "2024-11-02",
        "content": "Doug Mills reflects on nearly 40 years of taking photos of presidents."
    },
    {
        "title": "In Politics, Pro Athletes (and Owners) Are Just Like the Rest of Us: Divided",
        "date": "2024-11-02",
        "content": "A pro-Harris video from LeBron James. A pro-Trump hat on Nick Bosa. With Election Day near, more have been showing their preference."
    },
    {
        "title": "Fears of Civil Unrest Stalk the Markets",
        "date": "2024-11-02",
        "content": "Wall Street advisers say investors are increasingly anxious about the possibility of election-related violence."
    },
    {
        "title": "Bruce Springsteen Has Done the Impossible",
        "date": "2024-11-02",
        "content": "His music offers a model of how we all might just get through this."
    },
    {
        "title": "Humorless Feminists Against Trump",
        "date": "2024-11-02",
        "content": "The former president does not value or respect women — and it shows in his words and his policies"
    },
    {
        "title": "Thank Goodness for the New York City Marathon",
        "date": "2024-11-02",
        "content": "The marathon is glorious in part because it represents an ideal of civic life: people striving to accomplish their goals while seeking connection with others."
    },
    {
        "title": "If the Choice in 2024 Were So Obvious, the Election Wouldn’t Be So Close",
        "date": "2024-11-02",
        "content": "Why opposing Trump is not so completely obvious, obligatory or a matter of simple common sense."
    },
    {
        "title": "I’ve Covered Authoritarians Abroad. Now I Fear One at Home.",
        "date": "2024-11-02",
        "content": "But if Trump thinks his threats to cancel TV licenses or his crass warnings of jailing and prison rape will intimidate journalists, he’s wrong."
    },
    {
        "title": "All the Demons Are Here",
        "date": "2024-11-02",
        "content": "Trump goes out on a low note — not surprisingly."
    },
    {
        "title": "Whatever Happens Next, Trump Has Already Won a Tragic Victory",
        "date": "2024-11-02",
        "content": "This election has shown that Arab American and Muslim American lives are considered to be expendable."
    },
    {
        "title": "Tailgating in Wisconsin With the Bros Trump Needs",
        "date": "2024-11-02",
        "content": "Gender is a main dividing line in 2024. And young swing-state voters know it."
    },
    {
        "title": "Why Are Democrats Having Such a Hard Time Beating Trump?",
        "date": "2024-11-02",
        "content": "The national political environment just isn’t as conducive to a Harris victory as many might imagine."
    },
    {
        "title": "A Way Out of Mexico’s Constitutional Crisis? One Idea for Compromise Emerges.",
        "date": "2024-11-02",
        "content": "A lone voice on Mexico’s Supreme Court has proposed a way to ease the political tensions that have arisen over a judicial overhaul. But big obstacles could prevent any deal."
    },
    {
        "title": "‘Cesspools,’ ‘Hellholes’ and ‘Beautiful Places’: How Trump Describes the U.S.",
        "date": "2024-11-02",
        "content": "See how Donald J. Trump’s penchant for criticism extends to a topic that’s usually sacrosanct for candidates — the cities and states in the nation he aims to lead."
    },
    {
        "title": "Trump Is Betting Big on Musk’s Swing-State Moonshot",
        "date": "2024-11-02",
        "content": "The candidate is leaning on an unusual canvassing effort funded by Elon Musk. If successful, it could usher in a new era when billionaires dominate ground campaigns."
    },
    {
        "title": "A Daughter of Immigrants Adopts a Tough Border Message in a Close House Race",
        "date": "2024-11-02",
        "content": "Representative Yadira Caraveo of Colorado, whose parents entered the country illegally from Mexico, has become one of several Democrats to pivot to a pro-enforcement message."
    },
    {
        "title": "How a Trump Win Would Upend Major Climate Court Fights",
        "date": "2024-11-02",
        "content": "A second Trump administration could stop defending the E.P.A. against lawsuits attacking its climate policies. Other effects might be more far-reaching."
    },
    {
        "title": "Trump, Preparing to Challenge the Results, Puts His 2020 Playbook Into Action",
        "date": "2024-11-02",
        "content": "Step by step, Donald J. Trump and his allies are following the strategies that caused chaos four years ago. Election officials say they are ready this time."
    },
    {
        "title": "Just How Online Was This Election?",
        "date": "2024-11-02",
        "content": "In the 2024 presidential race, both nominees exploited a porous boundary between the internet and real life. Some viral moments, however, were out of their control."
    },
    {
        "title": "Harris’s Hope: Getting Right-Leaning Voters to Shift to the Left",
        "date": "2024-11-02",
        "content": "Democrats see a narrow opening to peel away center-right voters bothered by abortion bans and by the Jan. 6 attack on the Capitol."
    },
    {
        "title": "A Tight Senate Battle Comes Down to a Few Key Races",
        "date": "2024-11-02",
        "content": "Republicans are in good position to win the Senate majority, but Democrats still hold hope of retaining control."
    },
    {
        "title": "How Will White Women Vote? It’s a Question With a Fraught History.",
        "date": "2024-11-02",
        "content": "White and Black women have joined together to power progressive causes — from abolition to civil rights — but it’s a tenuous alliance."
    },
    {
        "title": "Our Photographers’ Favorite Campaign Trail Photos",
        "date": "2024-11-02",
        "content": "How did they get those photos? Doug Mills, who has been photographing former President Donald J. Trump for The New York Times, and Erin Schaff, who has been photographing Vice President Kamala Harris, tell the stories behind their favorite photos ..."
    },
    {
        "title": "Squirrels, Soda and Tractors: 12 Emergencies You Never Thought About but Election Officials Are Prepared For",
        "date": "2024-11-02",
        "content": "Local election workers share how they would respond to a range of scenarios, using a 52-deck card game."
    },
    {
        "title": "The Biggest Question in North Carolina: Can Democrats Win?",
        "date": "2024-11-02",
        "content": "Republicans have been quick to temper Democratic optimism in a state where rural areas, and maybe just enough suburbs and exurbs, remain reliably red."
    },
    {
        "title": "How Donald Trump Replaced ‘the Protestant Pope’",
        "date": "2024-11-02",
        "content": "Billy Graham towered over American evangelicalism for 50 years. Now the fight is on to own his legacy."
    },
    {
        "title": "How to Survive Swing State Stress: Prayer, Canvassing and Knowing When to Let Go",
        "date": "2024-11-02",
        "content": "Georgia’s status as a battleground state is a source of pride, but also of high anxiety at the end of a grinding election."
    },
    {
        "title": "Kamala Harris’s 2024 in Pictures",
        "date": "2024-11-02",
        "content": "As the year began, few expected Kamala Harris to make a historic march toward the presidency. After a head-spinning summer, her campaign’s remarkable story awaits its conclusion."
    },
    {
        "title": "In Shift From 2020, Identity Politics Loses Its Grip on the Country",
        "date": "2024-11-02",
        "content": "There are signs that society is moving away from the progressive left’s often strict expectations about how to discuss culture and politics."
    },
    {
        "title": "Donald Trump’s 2024 in Pictures",
        "date": "2024-11-02",
        "content": "A historic conviction. A sudden new opponent. Gunfire in Butler. Donald Trump’s year was unlike that of any presidential candidate in political history."
    },
    {
        "title": "Trump Bashes Arab Americans. Here’s Why Some Like Him Anyway.",
        "date": "2024-11-02",
        "content": "In a diverse enclave on Staten Island, some business owners say former President Donald J. Trump’s racist rhetoric and anti-Muslim policies are troubling but not disqualifying."
    },
    {
        "title": "The G.O.P. Gained Ground in New York in 2022. Can Democrats Recover?",
        "date": "2024-11-02",
        "content": "Democrats still hold supermajorities in both chambers of the State Legislature, but Republicans are hoping to keep the momentum from the 2022 midterms."
    },
    {
        "title": "Judge Finds Pennsylvania County Short of Ballots and Extends Early-Voting Hours",
        "date": "2024-11-02",
        "content": "A state judge in Erie County, Pa., found that thousands of voters may not have received their ballots in time for the election on Tuesday, ordering the county to remedy the issue."
    },
    {
        "title": "Judge Allows Unusual G.O.P. Strategy to Pump Money Into Senate Races",
        "date": "2024-11-02",
        "content": "Democrats had claimed that the advertising strategy may have violated federal election laws establishing strict limits on spending by national party committees to aid individual candidates."
    },
    {
        "title": "Uncertainty Reigns in Nevada With Rise of Nonpartisan Voters",
        "date": "2024-11-02",
        "content": "With early voting coming to a close, Donald Trump and Kamala Harris must now ensure their respective bases show up on Election Day, while chasing down those whose choice is less clear."
    },
    {
        "title": "As Election Nears, Republicans Blame Child’s Rape on Immigration Crisis",
        "date": "2024-11-02",
        "content": "Wilson Castillo Diaz was arrested in New York in connection with the rape of a 5-year-old girl. On Friday, local Republicans blamed Democratic immigration policies."
    },
    {
        "title": "Nicolle Wallace Calls on Her Former Boss, George W. Bush, to Denounce Trump",
        "date": "2024-11-02",
        "content": "Ms. Wallace, who served as the communications director in the Bush White House, made the appeal on her MSNBC program."
    },
    {
        "title": "Supreme Court Rejects Bid to Block Count of Some Pennsylvania Provisional Ballots",
        "date": "2024-11-01",
        "content": "Republicans had sought to block the counting of provisional ballots by voters whose mail-in ballots were deemed invalid. Democrats celebrated the ruling as a win in a crucial state."
    },
    {
        "title": "Trump Still Can’t Stop Talking About Women",
        "date": "2024-11-01",
        "content": "The countdown to the election feels like an Advent calendar with a dubious remark behind each door."
    },
    {
        "title": "Harris and Trump Rally in Milwaukee as They Make Final Wisconsin Push",
        "date": "2024-11-01",
        "content": "The presidential rivals campaigned in the battleground state’s largest city after Donald Trump tried to slightly soften his violent remarks about Liz Cheney, which Kamala Harris called “disqualifying.”"
    },
    {
        "title": "With Days to Go, Trump Courts Apolitical Young Men",
        "date": "2024-11-01",
        "content": "Also, the U.S. fears Ukraine has entered a grim phase. Here’s the latest at the end of Friday."
    },
    {
        "title": "Latino Civil Rights Group Pushes Back on the Myth of Noncitizen Voters",
        "date": "2024-11-01",
        "content": "The League of United Latin American Citizens, which was targeted in Texas’ election fraud case, is teaming up with a pro-democracy group to counter Republican-led election challenges."
    },
    {
        "title": "Maryland Republican Fighting Uphill Battle Pitches Voters on Splitting Their Tickets",
        "date": "2024-11-01",
        "content": "A spot for former Gov. Larry Hogan aims to give Democrats permission to back him over Angela Alsobrooks and still vote for Kamala Harris — or against Donald J. Trump."
    },
    {
        "title": "Hugh Hewitt, Conservative Columnist, Quits The Washington Post",
        "date": "2024-11-01",
        "content": "His decision came hours after he abruptly stormed off a broadcast of a live online Post talk show."
    },
    {
        "title": "Biden Won’t Attend This Year’s Climate Summit, White House Officials Say",
        "date": "2024-11-01",
        "content": "The president’s senior climate adviser is expected to lead the American delegation at the U.N. talks in Azerbaijan."
    },
    {
        "title": "This Sorority Is Going All in to Get Out the Vote",
        "date": "2024-11-01",
        "content": "Alpha Kappa Alpha’s forceful push to increase voter turnout could help boost critical support for Democrats from Black voters."
    },
    {
        "title": "McDonald’s Ice Cream Machines May Get Quicker Fix After Copyright Ruling",
        "date": "2024-11-01",
        "content": "An exemption to a longstanding copyright act allows industrial equipment to be fixed by people not affiliated with the manufacturer."
    },
    {
        "title": "White House Altered Official Transcript of Biden’s Remarks on Trump and ‘Garbage’",
        "date": "2024-11-01",
        "content": "The debate over the meaning of President Biden’s words comes down to an apostrophe, which the White House press office inserted into the transcript without the approval of official stenographers."
    },
    {
        "title": "Who Abandoned Liberalism First, the Populists or the Establishment?",
        "date": "2024-11-01",
        "content": "The uncertain future of ‘whole of society’ politics."
    },
    {
        "title": "U.S. Spy Agencies Issue New Warning on Russia’s Election Misinformation Campaign",
        "date": "2024-11-01",
        "content": "Three recent videos have sought to undermine confidence in the security of the vote."
    },
    {
        "title": "Israel Strikes Near Beirut as Diplomatic Push Shows No Sign of Success",
        "date": "2024-11-01",
        "content": "The Biden administration sent envoys including the C.I.A. director to the Middle East this week, but Israel, Hezbollah and Hamas all appeared far from a deal to end the fighting."
    },
    {
        "title": "Veto Power in the Balance, Nevada’s G.O.P. Governor Keeps Trump at Arm’s Length",
        "date": "2024-11-01",
        "content": "Republicans believe a strong Donald Trump victory would ensure that Gov. Joe Lombardo could keep overriding Democratic priorities. But Mr. Lombardo is operating outside the state party, and largely away from Mr. Trump."
    },
    {
        "title": "The Fight for the House Is on a Knife’s Edge",
        "date": "2024-11-01",
        "content": "Public and private polling this cycle, as well as strategists in both parties, point to one of the tightest contests yet for the House majority, in races that stretch from California to Nebraska to Virginia."
    },
    {
        "title": "The Path to Control of Congress May Swerve Through Alabama",
        "date": "2024-11-01",
        "content": "A House district in Alabama was redrawn to empower Black voters, changing what had been a safe Republican seat into a highly competitive and potentially consequential battleground."
    },
    {
        "title": "How Election Deniers Sank a Security Conference in Georgia",
        "date": "2024-11-01",
        "content": "The gathering had nothing to do with the election. That didn’t stop conspiracy theorists from spreading falsehoods."
    },
    {
        "title": "Disinformation Watchdogs Are Under Pressure. This Group Refuses to Stop.",
        "date": "2024-11-01",
        "content": "Though a larger coalition of fact checkers has disbanded, a team of students and researchers at the University of Washington in Seattle is still working to document how lies online threaten to undermine this year’s presidential race."
    },
    {
        "title": "How Trump Is Trying to Win Gen Z Men",
        "date": "2024-11-01",
        "content": "Young men in recent years have become more politically conservative. But will they vote? Kellen Browning, a New York Times reporter covering the 2024 election with a focus on Nevada and Arizona, discusses the Trump campaign’s efforts to court the ..."
    },
    {
        "title": "Trump Is Courting Apolitical Young Men. Will It Pay Off?",
        "date": "2024-11-01",
        "content": "Gen Z men are increasingly turning away from the Democratic Party, swayed by the former president’s bravado and irreverence. But they also do not usually vote in high numbers."
    },
    {
        "title": "As Russia Advances, U.S. Fears Ukraine Has Entered a Grim Phase",
        "date": "2024-11-01",
        "content": "Weapons supplies are no longer Ukraine’s main disadvantage, American military officials say."
    },
    {
        "title": "What the Weak Jobs Report Tells Us",
        "date": "2024-11-01",
        "content": "It doesn’t mean we’re on the edge of a recession."
    },
    {
        "title": "A Brief History of Messy Elections",
        "date": "2024-11-01",
        "content": "Three times the results were disputed after the votes were in."
    },
    {
        "title": "So … How Does the Electoral College Work, Again?",
        "date": "2024-11-01",
        "content": "It’s weird. It’s confusing. It’s how we elect the president."
    },
    {
        "title": "Play: Election-Night Bingo",
        "date": "2024-11-01",
        "content": "Listen up for these terms as the votes roll in. Find them on the board to be the night’s big winner."
    },
    {
        "title": "They Barter and Trade to Survive. How Will They Vote?",
        "date": "2024-11-01",
        "content": "Many rural Americans engage in cashless barter systems to get food and firewood for heating and cooking. They value self-sufficiency, making them wary of government intervention."
    },
    {
        "title": "Hit Play About U.S. Constitution Debuts in Canada. Amended, of Course.",
        "date": "2024-11-01",
        "content": "How do you retool “What the Constitution Means to Me” for those unfamiliar with the U.S. Constitution? Consult Canada’s Charter of Rights and Freedoms."
    },
    {
        "title": "Weak Jobs Report Provides Political Fodder Ahead of Election Day",
        "date": "2024-11-01",
        "content": "Republicans and Democrats used the latest jobs numbers to bolster their arguments about who would be better at managing the economy."
    },
    {
        "title": "The First Big-City Mayor to Face a Recall in Years Is Fighting for Her Job",
        "date": "2024-11-01",
        "content": "Frustrated voters will decide on Tuesday whether to oust Sheng Thao, the mayor of Oakland, Calif., because of high crime and other problems."
    },
    {
        "title": "The Market Is Fairly Upbeat. Is It the Calm Before a Storm?",
        "date": "2024-11-01",
        "content": "Stocks have risen this year despite uncertainties and outright hostilities in U.S. politics and around the world. But bonds and other markets show signs of concern, our columnist says."
    },
    {
        "title": "The Races for Congress",
        "date": "2024-11-01",
        "content": "We preview next week’s elections and what a divided or united government might mean for each party."
    },
    {
        "title": "Billionaire Game Theory + We Are Not Ready for A.G.I. + Election Betting Markets Get Weird",
        "date": "2024-11-01",
        "content": "“If I had $1 billion, how would I try to influence the results of this election?”"
    },
    {
        "title": "The Army of Election Officials Ready to Reject the Vote",
        "date": "2024-11-01",
        "content": "An investigation in four battleground states found that Republicans have taken control of election boards with the aim of challenging and overturning results that don’t go their way."
    },
    {
        "title": "JD Vance Goes on Joe Rogan, and Young Thug Pleads Guilty",
        "date": "2024-11-01",
        "content": "Plus, the jobs report, with a twist."
    },
    {
        "title": "Election Uncertainty Looms Over Hiring",
        "date": "2024-11-01",
        "content": "Some employers say they have been wary to expand until the outcome of the presidential election is known."
    },
    {
        "title": "Storms and Strikes Take a Toll on Pre-election Jobs Report",
        "date": "2024-11-01",
        "content": "U.S. payrolls grew by only 12,000 in October, a figure that left markets placid but fueled political contention. Unemployment remained 4.1 percent."
    },
    {
        "title": "When to Expect Results in Each State on Election Night, and Beyond",
        "date": "2024-11-01",
        "content": "The Times surveyed election officials in all 50 states to learn how they will count the votes, and when we might know the outcome in the battleground states."
    },
    {
        "title": "Let’s Not Blow It Again",
        "date": "2024-11-01",
        "content": "Don’t let the monarch of Mar-a-Lago take back his throne."
    },
    {
        "title": "In Other News, Who Will Control Congress?",
        "date": "2024-11-01",
        "content": "It could come down to the fate of Democrats in Trump-leaning territory."
    },
    {
        "title": "You Might Consider Praying",
        "date": "2024-11-01",
        "content": "It’s what can we do when we don’t know what to do."
    },
    {
        "title": "Did Trump Just Lose His Crucial Latino Support?",
        "date": "2024-11-01",
        "content": "Latino voters could determine who will be the next president. Donald Trump might have jeopardized his chances with them."
    },
    {
        "title": "Oil Interests Gave More Than $75 Million to Trump PACs, New Analysis Shows",
        "date": "2024-11-01",
        "content": "Oil moguls are big donors to Donald Trump. But so are engineering firms, hedge fund managers, shipbuilders and others that profit from fossil fuels."
    },
    {
        "title": "Can You Identify These Regional Election Stickers?",
        "date": "2024-11-01",
        "content": "From student-drawn designs to state emblems, the stickers handed out at election polling sites are getting more creative. Election officials hope it will boost voter turnout."
    },
    {
        "title": "Why Trump Has a More Plausible Path to the Presidency, in 19 Maps",
        "date": "2024-11-01",
        "content": "A Democratic strategist explains how a deadlocked presidential race may play out in the Electoral College."
    },
    {
        "title": "What I Truly Expect if an Unconstrained Trump Retakes Power",
        "date": "2024-11-01",
        "content": "The transition from democracy to autocracy is a process, not an on-off switch."
    },
    {
        "title": "Donald Trump Is Done With Checks and Balances",
        "date": "2024-11-01",
        "content": "You aren’t just choosing a candidate. You’re choosing a theory of power."
    },
    {
        "title": "This Election Is the Tiebreaker Over Trumpism",
        "date": "2024-11-01",
        "content": "The hosts dig into what they got right, and what they got so wrong, about this campaign season."
    },
    {
        "title": "Are We on the Cusp of a New Political Order?",
        "date": "2024-11-01",
        "content": "The historian Gary Gerstle discusses how America’s political consensus has shifted over the decades."
    },
    {
        "title": "What Trump’s Environmental Record Says About a Second Term",
        "date": "2024-11-01",
        "content": "Mr. Trump and his allies envision a second term that would try to permanently eliminate protections for air, water and climate."
    },
    {
        "title": "On Marathon Sunday, Go to Carnegie Hall. Or See a Dog Movie.",
        "date": "2024-11-01",
        "content": "Nov. 3 is the date for the big race, but there are other things going on. It’ll just be a little harder to get to them."
    },
    {
        "title": "There Is a Silver Lining in This Tense Election Year",
        "date": "2024-11-01",
        "content": "Widespread dissatisfaction with American politics can lead to major political reform."
    },
    {
        "title": "Why There’s Hope for U.S. Factory Towns Laid Low by the ‘China Shock’",
        "date": "2024-11-01",
        "content": "Communities that suffered the worst of plant closings in recent decades are now gaining an outsize share of fresh investment and new jobs."
    },
    {
        "title": "How Teens Are Handling a Flood of Election Misinformation",
        "date": "2024-11-01",
        "content": "Teens share their best advice for spotting misinformation and staying sharp during a turbulent election season."
    },
    {
        "title": "Working-Class Voters Are Pivotal. Both Candidates Are Vying for Their Support.",
        "date": "2024-11-01",
        "content": "Kamala Harris’s plans offer a bigger boost for the working class, but Donald Trump seems to be convincing voters."
    },
    {
        "title": "The Deep Roots of 4 of Donald Trump’s Nativist Remarks",
        "date": "2024-11-01",
        "content": "In the former president’s pitch to voters, historians hear echoes of the nation’s inescapable xenophobic history."
    },
    {
        "title": "What to Know About ‘The Apprentice,’ the Controversial Donald Trump Biopic",
        "date": "2024-11-01",
        "content": "The film, now available on demand, followed a thorny path to distribution — including the threat of a lawsuit by its subject."
    },
    {
        "title": "Xenophobia and Hate Speech Are Spiking Heading Into the Election",
        "date": "2024-11-01",
        "content": "Leading Republican politicians and lax social media controls have contributed to a proliferation of hate rhetoric and anti-immigrant sentiment."
    },
    {
        "title": "Sprinting to Election Day, in Spanish",
        "date": "2024-11-01",
        "content": "A team of editors and translators help communicate election coverage to Spanish-speaking readers, which comes with its own set of unique challenges."
    },
    {
        "title": "Trump Assails Liz Cheney and Imagines Guns ‘Shooting at Her’",
        "date": "2024-11-01",
        "content": "Vice President Kamala Harris said that anyone who uses “that kind of violent rhetoric is clearly disqualified, and unqualified, to be president.”"
    },
    {
        "title": "Botswana Voters Hand Governing Party a Stunning Rebuke",
        "date": "2024-11-01",
        "content": "After 58 years, the Botswana Democratic Party lost its majority in Parliament, becoming the latest long-dominant party in southern Africa to fall from power."
    },
    {
        "title": "Vance Tells Rogan: Teens Become Trans to Get Into Ivy League",
        "date": "2024-11-01",
        "content": "Appearing on Joe Rogan’s podcast, Senator JD Vance also said that liberal women celebrate their abortions and that Donald Trump would win the “normal gay guy vote.”"
    },
    {
        "title": "As Women Drift From Trump, His Campaign Is Reaching Out to Young Men",
        "date": "2024-10-31",
        "content": "How Donald Trump’s allies are honing their message to young men in the campaign’s final days."
    },
    {
        "title": "Harris Campaign’s New Ad in Spanish Highlights Puerto Rico Insult at Trump Rally",
        "date": "2024-10-31",
        "content": "It is aimed at Latinos in the battleground state of Pennsylvania, which has a sizable Puerto Rican population."
    },
    {
        "title": "Leopards Are Telling You That They Will Eat YOUR Face",
        "date": "2024-10-31",
        "content": "Many of Donald Trump’s supporters are unprepared for what’s coming if he wins."
    },
    {
        "title": "Why Is Trump Campaigning in New Mexico and Virginia?",
        "date": "2024-10-31",
        "content": "Even if carrying these states is unlikely, they offer the possibility that fresh audiences could supply more Republican votes in the popular tally."
    },
    {
        "title": "As Election Nears, Foreign Leaders Fear ‘a Vacuum’ in American Leadership",
        "date": "2024-10-31",
        "content": "President Biden hosted his final pre-election international visitor in the Oval Office, where the talk focused on the Middle East and Europe. But uncertainty in the United States hung over the meeting."
    },
    {
        "title": "Cuomo Told a House Panel His Memory Was Hazy. Is That a Perjury Defense?",
        "date": "2024-10-31",
        "content": "House Republicans referred the former New York governor for prosecution. His insistence on a faulty memory makes that outcome unlikely."
    },
    {
        "title": "Trump and Vance Escalate Efforts to Sow Doubts on Pennsylvania Voting",
        "date": "2024-10-31",
        "content": "The former president and his running mate made false attacks about the security of the election in Pennsylvania, the battleground state with the most electoral college votes."
    },
    {
        "title": "What Teens Said They Hope for and Fear in the 2024 Election",
        "date": "2024-10-31",
        "content": "Responses to the Headway Election Challenge paint a picture of teenagers navigating a highly charged political moment."
    },
    {
        "title": "Trump Had an ‘America First’ Foreign Policy. But It Was a Breakdown in American Policymaking.",
        "date": "2024-10-31",
        "content": "A second Donald J. Trump presidency would almost certainly mark a return to an era of foreign policy decrees, untethered to any policy process, at a moment of maximum international peril."
    },
    {
        "title": "White Women Could Decide the Election",
        "date": "2024-10-31",
        "content": "Also, Russia is making swift advances in Ukraine. Here’s the latest at the end of Thursday."
    },
    {
        "title": "‘I’m Not Supposed to Say This,’ Trump Says. But Then He Does.",
        "date": "2024-10-31",
        "content": "Former President Donald J. Trump’s rehearsed defiance makes his supporters feel as though there’s nothing he won’t share."
    },
    {
        "title": "Has Your Stance on Immigration Changed? Tell Us.",
        "date": "2024-10-31",
        "content": "The New York Times is writing about voters’ attitudes on immigration and how they changed since the last election cycle."
    },
    {
        "title": "Pennsylvania Voters Worry About the Toxicity of Politics",
        "date": "2024-10-31",
        "content": "In Berks County, complex feelings about race and immigration threaten the social fabric of a place where people are used to finding common ground."
    },
    {
        "title": "A Big New Celebrity Endorser for Kamala Harris: LeBron James",
        "date": "2024-10-31",
        "content": "Mr. James, the N.B.A.’s all-time leading scorer, campaigned for Barack Obama and Hillary Clinton in previous election cycles. He has made no secret of his low opinion of Donald J. Trump."
    },
    {
        "title": "Friday Briefing: The Global Stakes of the U.S. Election",
        "date": "2024-10-31",
        "content": "Plus, Japan's passion for the World Series."
    },
    {
        "title": "The Issues That Matter Most to Teenagers in This Election",
        "date": "2024-10-31",
        "content": "Students on climate change, abortion, gun violence and more."
    },
    {
        "title": "What Backlash To Racist Rally Remarks Means for Trump",
        "date": "2024-10-31",
        "content": "Maggie Haberman, a senior political correspondent for The New York Times, surveys former President Donald J. Trump’s campaign in its tumultuous final week before Election Day."
    },
    {
        "title": "A Spooky Halloween Ad Tries to Tie Harris to Migrant Crime",
        "date": "2024-10-31",
        "content": "A pro-Trump super PAC ad in the style of a mini-horror film uses misleading claims as it tries to frighten voters about the prospect of a Harris presidency."
    },
    {
        "title": "What’s That in Your Mouth, Bro?",
        "date": "2024-10-31",
        "content": "Zyn nicotine pouches have become a new symbol of American masculinity — and a surprising political lightning rod."
    },
    {
        "title": "Surprise Hit of the Campaign TV Ad Season: Giving Voters Permission to Go Rogue",
        "date": "2024-10-31",
        "content": "Both parties are running ads that tell voters it’s OK to break from their party. “You can vote any way you want. And no one will ever know,” one says."
    },
    {
        "title": "New York Court Suspends Lawyer Who Pushed Trump’s Fake Electors Scheme",
        "date": "2024-10-31",
        "content": "The lawyer, Kenneth Chesebro, had previously pleaded guilty to a felony charge of conspiracy in a Georgia court."
    },
    {
        "title": "Donald Trump Is Bored",
        "date": "2024-10-31",
        "content": "There’s plenty going on there, but it’s not senility. It’s “extravagance.”"
    },
    {
        "title": "Campaign Ad for Nebraska Senator Uses Images From the Northeast",
        "date": "2024-10-31",
        "content": "Her opponent, Dan Osborn, an independent, seized on the gaffe. A spokesman for the Fischer campaign blamed a “screw-up by a vendor.”"
    },
    {
        "title": "The ‘Garbage’ Insult Stung. But Puerto Ricans Are Focused on Their Own Election.",
        "date": "2024-10-31",
        "content": "For Puerto Ricans living on the island, the most consequential race this year is for governor. Frequent power blackouts have become a top political issue."
    },
    {
        "title": "What Teenagers Are Learning About the 2024 Election",
        "date": "2024-10-31",
        "content": "We’ve heard from teachers around the country about how they’re teaching the 2024 election. Here’s what students in three New York City classrooms are learning."
    },
    {
        "title": "The Jobs Report on Friday May Be a Fluke and a Political Football",
        "date": "2024-10-31",
        "content": "Economists expect the October data to show unusually weak job creation. But hurricanes and strikes may account for much of the shortfall."
    },
    {
        "title": "Protecting Nature, With the U.S. on the Sidelines",
        "date": "2024-10-31",
        "content": "As the world gathers this week for U.N. biodiversity negotiations, the U.S. hasn’t ratified a decades-old treaty to protect nature."
    },
    {
        "title": "Ricky Martin, Lin-Manuel Miranda and Rita Moreno: Puerto Ricans Are Not Throwing Away Their Shot",
        "date": "2024-10-31",
        "content": "Our vote won’t be a reaction to racist jokes."
    },
    {
        "title": "This ‘Friendly’ Wisconsin Town Might Be the Most Divided Place in America",
        "date": "2024-10-31",
        "content": "Most Americans live in political bubbles, but not residents of this swing-state community, where President Biden won in 2020 by six votes."
    },
    {
        "title": "They Want to Ensure That, This Time, White Women Vote for a Woman",
        "date": "2024-10-31",
        "content": "Donald Trump has won white women, the country’s largest voting bloc, for two elections running. White female Democrats are trying to stop that from happening again, but it may be an uphill fight."
    },
    {
        "title": "How Elon Musk Changed Course to Go All Out for Trump",
        "date": "2024-10-31",
        "content": "The billionaire has poured nearly $120 million into a pro-Trump voting effort and used his social media platform, X, to spread misinformation, despite public statements he made in the past about political neutrality."
    },
    {
        "title": "Harris and Trump Trade Gender Attacks as He Floats Kennedy for ‘Women’s Health’",
        "date": "2024-10-31",
        "content": "Kamala Harris and her team seized on Donald Trump’s latest comments about women, including a statement that under him, Robert F. Kennedy Jr. would work on “women’s health.” The Trump team lashed out over remarks by a top Harris supporter."
    },
    {
        "title": "Why a Governor Is Stepping Down, and Running for Mayor",
        "date": "2024-10-31",
        "content": "John Carney of Delaware is set to become the first sitting governor to be elected a mayor. In some ways, he says, “it’s a step up.”"
    },
    {
        "title": "Trump’s Transition Team Head Says R.F.K. Jr. Converted Him to Vaccine Skeptic",
        "date": "2024-10-31",
        "content": "Howard Lutnick told CNN that he believed Robert F. Kennedy Jr., who could have a position in a possible Trump administration, was right about debunked vaccine claims."
    },
    {
        "title": "Can Stories About Abortion Break Through the Noise?",
        "date": "2024-10-31",
        "content": "The reproductive rights activist Cecile Richards started a media project that merges activism and journalism on Instagram and TikTok, just days ahead of the presidential election."
    },
    {
        "title": "Those Voters Who Are Still Undecided",
        "date": "2024-10-31",
        "content": "Readers express surprise that some voters are still uncertain and urge them to vote. Also: Michelle Obama’s plea; marijuana reform; family policies."
    },
    {
        "title": "How a Tiny Panel, Up for Election, Could Steer Arizona Away From Clean Power",
        "date": "2024-10-31",
        "content": "The vote, in a sunny state with huge solar potential, reflects a growing nationwide fight over America’s energy transition."
    },
    {
        "title": "Election 2024 Polls: Senate Races",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for ."
    },
    {
        "title": "Election 2024 Polls: Wisconsin U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Wisconsin."
    },
    {
        "title": "Election 2024 Polls: Pennsylvania U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Pennsylvania."
    },
    {
        "title": "Election 2024 Polls: Texas U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Texas."
    },
    {
        "title": "Election 2024 Polls: Virginia U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Virginia."
    },
    {
        "title": "Election 2024 Polls: Tennessee U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Tennessee."
    },
    {
        "title": "Election 2024 Polls: Ohio U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Ohio."
    },
    {
        "title": "Election 2024 Polls: Maryland U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Maryland."
    },
    {
        "title": "Election 2024 Polls: Montana U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Montana."
    },
    {
        "title": "Election 2024 Polls: Nebraska U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Nebraska."
    },
    {
        "title": "Election 2024 Polls: Nevada U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Nevada."
    },
    {
        "title": "Election 2024 Polls: Missouri U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Missouri."
    },
    {
        "title": "Election 2024 Polls: New Mexico U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for New Mexico."
    },
    {
        "title": "Election 2024 Polls: Michigan U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Michigan."
    },
    {
        "title": "Election 2024 Polls: Minnesota U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Minnesota."
    },
    {
        "title": "Election 2024 Polls: Arizona U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Arizona."
    },
    {
        "title": "Election 2024 Polls: California U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for California."
    },
    {
        "title": "Election 2024 Polls: Florida U.S. Senate",
        "date": "2024-10-31",
        "content": "See the latest election polls and polling averages for Florida."
    },
    {
        "title": "In Orange County, a Key House Race Could Come Down to Little Saigon Voters",
        "date": "2024-10-31",
        "content": "Representative Michelle Steel, a Republican incumbent, and Derek Tran, her Democratic challenger, are trying to identify with a crucial voting bloc of Vietnamese Americans."
    },
    {
        "title": "The Fed’s Preferred Inflation Gauge Cooled Overall in September",
        "date": "2024-10-31",
        "content": "Overall inflation slowed in September from a year earlier, though some signs of stubbornness lingered under the surface."
    },
    {
        "title": "Musk Seeks Switch to Federal Court for Suit Against His Online Petition",
        "date": "2024-10-31",
        "content": "The Philadelphia district attorney sued in state court to block Elon Musk’s petition drive, saying it amounted to illegally paying people to register as voters. A hearing was scheduled for Thursday."
    },
    {
        "title": "The Other Trump Trade That Is Worrying Markets",
        "date": "2024-10-31",
        "content": "Robert Lighthizer, who was a huge influence on Donald Trump’s protectionist trade policy, is again a candidate for a top role if the Republican wins next week."
    },
    {
        "title": "Michigan Election Denial Activists Seize on Voter Report Glitch",
        "date": "2024-10-31",
        "content": "Participants in the Election Integrity Network spread false claims in right-wing media that were debunked by the Michigan secretary of state."
    },
    {
        "title": "The 2024 Stakes for Judges",
        "date": "2024-10-31",
        "content": "How the election could change the courts."
    },
    {
        "title": "‘Insider Threats’ to the Election, and Starbucks’ 4-Minute Goal",
        "date": "2024-10-31",
        "content": "Plus, the Harris campaign sidelines Biden."
    },
    {
        "title": "Watch: ‘You’re Being Lied To About Voter Fraud. Here’s the Truth.’",
        "date": "2024-10-31",
        "content": "Should we be worried about cheating at the polls? Or is it just a dangerous myth?"
    },
    {
        "title": "Biden’s Stake in This Election Is Like Nobody Else’s",
        "date": "2024-10-31",
        "content": "Will he be remembered as American democracy’s savior — or as a midwife to its ruin?"
    },
    {
        "title": "The Harris-Cheney Partnership Is Not Just a Marriage of Convenience",
        "date": "2024-10-31",
        "content": "Unlikely friendships can make America a better place."
    },
    {
        "title": "In Georgia, Harris Supporters Pull Together and Fight the Odds",
        "date": "2024-10-31",
        "content": "It’s not easy being a dot of blue in Trump country."
    },
    {
        "title": "Why the Right Thinks Trump Is Running Away With the Race",
        "date": "2024-10-31",
        "content": "Skewed polls and anonymous betting markets are building up Republicans’ expectations. Donald Trump could use that to challenge the result."
    },
    {
        "title": "Donald and Melania Trump Were Made for Each Other",
        "date": "2024-10-31",
        "content": "The former first lady’s new book shows that she still doesn’t care."
    },
    {
        "title": "All Eyes on Pennsylvania",
        "date": "2024-10-31",
        "content": "A look inside the battle for votes — and to get people to trust how votes are counted — in the biggest battleground."
    },
    {
        "title": "Inflation Is Basically Back to Normal. Why Do Voters Still Feel Blah?",
        "date": "2024-10-31",
        "content": "Consumers still give the economy poor marks, though the job market is strong and price increases have faded for months."
    },
    {
        "title": "In Puerto Rico, a New Generation Votes for Change",
        "date": "2024-10-31",
        "content": "A new generation of Puerto Ricans, shaped by disaster and debt, is determined to reclaim the island’s future."
    },
    {
        "title": "Republicans Shift Message on Abortion, Sounding More Like Democrats",
        "date": "2024-10-31",
        "content": "We surveyed candidates in 28 competitive House races to compare their policy positions on the issue. See what they said."
    },
    {
        "title": "‘Disgraceful’: A Fiery Bernie Sanders Courts Blue-Collar Voters",
        "date": "2024-10-31",
        "content": "The Vermont senator’s appearances on the trail to support Vice President Kamala Harris stand in stark contrast to her optimistic message."
    },
    {
        "title": "With Election Day Near, Here’s a Reminder That a Second Trump Term Could Mean Mayhem",
        "date": "2024-10-31",
        "content": "Our tense democracy could lurch from being an illiberal republic to a dictatorship by any other name."
    },
    {
        "title": "Late Abortions Rarely Happen, but They Still Dominate Politics",
        "date": "2024-10-31",
        "content": "Both sides are trying to make their opponents sound extreme. Here is what studies and data show about when and why abortions happen later in pregnancy."
    },
    {
        "title": "How Public Health Could Be Recast in a Second Trump Term",
        "date": "2024-10-31",
        "content": "Breaking up the C.D.C., moving funds from the N.I.H. — conservatives have floated changes should Mr. Trump regain office."
    },
    {
        "title": "Top U.S. Officials Are in the Middle East to Try to Jumpstart Cease-Fire Talks",
        "date": "2024-10-31",
        "content": "William Burns, the C.I.A. director, made a last-ditch attempt to move Gaza talks along before U.S. elections next week."
    },
    {
        "title": "Mayor Breed’s Pitch to Voters: I’ve Lived San Francisco’s Struggles",
        "date": "2024-10-31",
        "content": "London Breed is pointing to her difficult childhood as a reason she should win another term. Her opponents say her track record tells a different story."
    },
    {
        "title": "Election Falsehoods Take Off on YouTube as It Looks the Other Way",
        "date": "2024-10-31",
        "content": "The video site removed 2020 misinformation, fearing real-world harm. Now it’s amplifying and profiting from 2024 falsehoods, researchers said."
    },
    {
        "title": "How the Home Page Comes Together on Election Night",
        "date": "2024-10-31",
        "content": "“It’s about being prepared, but also being able to pivot,” said Justin O’Neill, one of the editors who programs the home page at night."
    },
    {
        "title": "Inside the Winter Wonderland Where Walmart Hatches Its Holiday Plans",
        "date": "2024-10-31",
        "content": "To prepare for ever-longer shopping season, thousands of employees were assembled for a retail jamboree in Florida’s August heat."
    },
    {
        "title": "Thursday Briefing",
        "date": "2024-10-31",
        "content": "How the next U.S. administration may shape the world."
    },
    {
        "title": "Trump Says He’ll Protect Women, ‘Like It or Not,’ Evoking His History of Misogyny",
        "date": "2024-10-31",
        "content": "Polls show Donald Trump is already facing a significant deficit with female voters in his race against Vice President Kamala Harris."
    },
    {
        "title": "How the U.S. Election Matters for the Rest of the World",
        "date": "2024-10-31",
        "content": "Times foreign correspondents describe what’s at stake for the world, including China, Israel, Ukraine, global trade and climate."
    },
    {
        "title": "Climate Change Is Making Disasters Deadlier. Here’s How Much.",
        "date": "2024-10-31",
        "content": "More than half a million people were killed in 10 disasters that climate change worsened, according to a new report."
    },
    {
        "title": "Millions of Movers Reveal American Polarization in Action",
        "date": "2024-10-31",
        "content": "A detailed look at how — and why — voters who move are widening the gap between blue neighborhoods and red ones."
    },
    {
        "title": "North Korea, in the Spotlight Over Ukraine, Launches a Long-Range Missile",
        "date": "2024-10-31",
        "content": "The launch, into waters west of Japan, came shortly after the United States and South Korea criticized the North for sending troops to join Russia’s war."
    },
    {
        "title": "Mexico Passes Bill Barring Legal Challenges to Constitutional Changes",
        "date": "2024-10-31",
        "content": "The bill has drawn criticism from legal scholars who say it would bulldoze any judicial oversight of constitutional matters."
    },
    {
        "title": "House Covid Panel Refers Andrew Cuomo for Potential Prosecution",
        "date": "2024-10-31",
        "content": "The Republican-led House subcommittee asked the Justice Department to investigate Mr. Cuomo for possible prosecution for “false statements” in his testimony."
    },
    {
        "title": "8 Supreme Court Justices in Mexico to Resign Ahead of Contentious Election",
        "date": "2024-10-31",
        "content": "All but three of the country’s Supreme Court justices announced they would quit rather than partake in the controversial elections mandated by a judicial overhaul."
    },
    {
        "title": "Nicky Jam, a Reggaeton Star, Withdraws Support for Trump",
        "date": "2024-10-30",
        "content": "The disavowal of the former president reflects the damage inflicted by racist remarks against Puerto Rico and Latinos at a recent rally at Madison Square Garden."
    },
    {
        "title": "When the Weight of Democracy Is on Your Shoulders",
        "date": "2024-10-30",
        "content": "Election workers are trying to pull off an election and restore faith in a system under attack."
    },
    {
        "title": "Don’t Let Liberal Purity Elect Trump",
        "date": "2024-10-30",
        "content": "Even if you think Harris is flawed on the Middle East, don’t try to punish the Democratic Party and risk a Trump election."
    },
    {
        "title": "This Election Season, Most Races Aren’t Races at All",
        "date": "2024-10-30",
        "content": "A new report finds that seven in 10 elective offices in this year’s general election are being sought by only one candidate."
    },
    {
        "title": "Biden’s Gaffes Complicate Harris’s Final Stretch, Worrying Democratic Insiders",
        "date": "2024-10-30",
        "content": "President Biden did not attend Vice President Kamala Harris’s speech on Tuesday night, but his ill-timed flub in a video interview caused headaches for her campaign."
    },
    {
        "title": "With $2 Million for G.O.P. Judges, Elon Musk Wades Further Into Texas Politics",
        "date": "2024-10-30",
        "content": "The world’s richest person has waded into local election contests in Texas where his sizable contributions can make a big difference."
    },
    {
        "title": "Pennsylvania Democrats File Suit Over Ballot Delays in Erie County",
        "date": "2024-10-30",
        "content": "A lawsuit said that many voters had not received their mail-in ballots, and that return rates in the county lagged far behind the state average."
    },
    {
        "title": "Trump Successfully Sues to Extend Mail-In Voting in Bucks County, Pa.",
        "date": "2024-10-30",
        "content": "A judge from the county’s Court of Common Pleas granted the Trump campaign’s request. The American Civil Liberties Union, which often opposes Republican groups on legal challenges to voting procedures, applauded the Trump effort."
    },
    {
        "title": "Top New Jersey Newspapers Will End Print Editions, and One Will Close",
        "date": "2024-10-30",
        "content": "The Star-Ledger, the state’s largest newspaper, will stop publishing its print edition. The Jersey Journal will shut down entirely after 157 years."
    },
    {
        "title": "The Economy Looks Strong as Election Day Nears",
        "date": "2024-10-30",
        "content": "Also, flash floods killed more than 95 people in Spain. Here’s the latest at the end of Wednesday."
    },
    {
        "title": "Father and Son From New Jersey Are Charged With Roles in Jan. 6 Riot",
        "date": "2024-10-30",
        "content": "Richard and Keith Andrews were part of a mob of Donald J. Trump’s supporters that sought to halt the certification of the 2020 election results, prosecutors said."
    },
    {
        "title": "Thursday Briefing: U.S. Voters Focus on the Economy",
        "date": "2024-10-30",
        "content": "Plus, what too much sugar does to your body."
    },
    {
        "title": "Monitors, Once Meant to Prevent Election Fraud, Now Seek to Prove It",
        "date": "2024-10-30",
        "content": "Polling place monitors have long provided oversight to elections. But this year, many are there to provide documentation for Donald J. Trump’s claims of fraud."
    },
    {
        "title": "What Muslim Ban? Trump Tries to Sidestep Years of Islamophobia.",
        "date": "2024-10-30",
        "content": "Former President Donald J. Trump is trying to persuade a potentially decisive group of Arab and Muslim voters that they should vote for him, even though he has spent years insulting and demonizing them."
    },
    {
        "title": "Trump Supporter Arrested After Brandishing Machete at Early-Voting Site",
        "date": "2024-10-30",
        "content": "The police charged an 18-year-old man with aggravated assault after he confronted two older Harris supporters outside a library in Neptune Beach, Fla."
    },
    {
        "title": "Tiny Love Stories: ‘The Day of the Dead Had Never Felt More Alive’",
        "date": "2024-10-30",
        "content": "Modern Love in miniature, featuring reader-submitted stories of no more than 100 words."
    },
    {
        "title": "Vance-Founded Donor Network to Gather Right After Election",
        "date": "2024-10-30",
        "content": "The conservative event could be a celebration — or perhaps the opposite."
    },
    {
        "title": "Raffensperger Allies Create Group to Fight Election Interference",
        "date": "2024-10-30",
        "content": "The Georgia secretary of state and his allies have created a fund to assist officials facing baseless lawsuits or other threats. They will also support actions against officials who attempt to subvert the election."
    },
    {
        "title": "With Just Days to Go, Fiercely Divided Arizona Remains a ‘Jump Ball’",
        "date": "2024-10-30",
        "content": "Both sides have credible cases to win: Republicans are banking on immigration, while Democrats have put faith in abortion rights and a disdain for Donald J. Trump."
    },
    {
        "title": "The Election Looks Like an Intramural Squabble Between Billionaires",
        "date": "2024-10-30",
        "content": "Rich people are becoming polarized, just like everyone else."
    },
    {
        "title": "A Unified Republican Congress Would Give Trump Broad Power for His Agenda",
        "date": "2024-10-30",
        "content": "A G.O.P. House and Senate could advance Trump-backed legislation and nominees, but thin margins and the filibuster could pose roadblocks and cause Republicans political trouble."
    },
    {
        "title": "Polls Show Trump’s Edge Shrinking on Voters’ Top Issue: The Economy",
        "date": "2024-10-30",
        "content": "It remains priority No. 1 for many voters, particularly those who are still undecided, according to Times/Siena polling. But can Kamala Harris translate her gains into votes?"
    },
    {
        "title": "Does Kamala Harris Back Free Health Care for Illegal Immigrants?",
        "date": "2024-10-30",
        "content": "Donald Trump and other Republicans have said repeatedly that she does. Her history on the issue is complicated."
    },
    {
        "title": "Harris Distances Herself From Biden’s ‘Garbage’ Remark",
        "date": "2024-10-30",
        "content": "Vice President Kamala Harris said that she will represent all Americans following a comment made by President Biden where he appeared to call supporters of former President Donald J. Trump “garbage.”"
    },
    {
        "title": "Harris’s Coattails in New Hampshire May Be Helping Democrat in Governor’s Race",
        "date": "2024-10-30",
        "content": "Distrust of Kelly Ayotte, the Republican candidate, on abortion and strong support for Kamala Harris in the state may be helping keep the race close despite Ms. Ayotte’s advantages."
    },
    {
        "title": "The ‘Monumental’ Choice Facing Voters",
        "date": "2024-10-30",
        "content": "Readers compare the presidential candidates, and one reacts to Kamala Harris’s speech. Also: Donald Trump’s scandals; a campaign volunteer’s story."
    },
    {
        "title": "A Farm-Raised Steelworker Speaks Up for Harris and Against Trump (and Elon Musk)",
        "date": "2024-10-30",
        "content": "Carhartt, a western Pennsylvania accent and a backdrop of tools provide blue-collar credibility in a new ad from Future Forward, the main super PAC aiding Kamala Harris."
    },
    {
        "title": "These Georgia Republicans Are Over Trump. Will They Vote for Him Anyway?",
        "date": "2024-10-30",
        "content": "Donald Trump has a particularly fraught history with his party in Georgia. Some Republicans described their calculus in deciding whether to back him."
    },
    {
        "title": "Arnold Schwarzenegger Endorses Harris, Rips Trump’s Effort to Overturn the 2020 Election",
        "date": "2024-10-30",
        "content": "The former actor, who served as governor of California as a Republican, said he didn’t like either party but found Trump’s actions disqualifying."
    },
    {
        "title": "R.F.K. Jr. Said Trump Promised Him Control of Public Health Agencies. The Campaign Called That Premature.",
        "date": "2024-10-30",
        "content": "The onetime independent presidential candidate, who dropped out and is backing Donald J. Trump, has in recent years promoted unproven theories about the dangers of pharmaceutical treatments."
    },
    {
        "title": "Fact-Checking Harris’s Closing Argument",
        "date": "2024-10-30",
        "content": "The vice president has stuck largely to the facts when highlighting the words of her rival, former President Donald J. Trump, but has on occasion omitted context or erred when describing policies and statistics."
    },
    {
        "title": "Jeff Bezos, Elon Musk and the Billions of Ways to Influence an Election",
        "date": "2024-10-30",
        "content": "The world’s richest men have their own rocket fleets, their own media and their own schemes to succeed with Donald J. Trump."
    },
    {
        "title": "Policing, Abortion, Trump: Inside a Tightening Race for a Key House Seat",
        "date": "2024-10-30",
        "content": "Sue Altman, a Democrat, has focused on reproductive rights as she seeks to unseat a Republican incumbent, Representative Thomas Kean Jr., in a New Jersey swing district."
    },
    {
        "title": "Can Democrats Win Back Voters From Trump on Trade Policy?",
        "date": "2024-10-30",
        "content": "The Biden administration has pursued a big shift in trade policy, but it’s not clear whether that will be enough to win votes."
    },
    {
        "title": "Supreme Court Allows Virginia to Purge Possibly Ineligible Voters for Now",
        "date": "2024-10-30",
        "content": "A divided court sided with Republicans, allowing the state to cull about 1,600 voters less than a week before Election Day."
    },
    {
        "title": "Robert Lighthizer: Trump’s China Trade Warrior and ‘Food Fight’ Referee",
        "date": "2024-10-30",
        "content": "If Donald J. Trump regains the presidency, his former U.S. trade representative could lead his quest to slap punishing tariffs on foreign trading partners."
    },
    {
        "title": "Johnson’s ‘No Obamacare’ Remark Draws Attention to Unpopular Stance",
        "date": "2024-10-30",
        "content": "Speaker Mike Johnson said a Trump victory would allow Republicans to embark on a “massive overhaul” of the Affordable Care Act. He said the party wants to “take a blowtorch to the regulatory state.”"
    },
    {
        "title": "At Dueling Rallies, Harris Stresses Unity as Trump Attacks Biden’s ‘Garbage’ Remark",
        "date": "2024-10-30",
        "content": "In three battleground states, Kamala Harris geared her message toward moderate Republicans and independents, while Donald J. Trump accused Democrats of demonizing him and his supporters."
    },
    {
        "title": "How Donald Trump Is Making Big Promises to Big Business",
        "date": "2024-10-30",
        "content": "Crypto. Big Oil. Tobacco. Vaping. Former President Donald J. Trump has been making overt promises to industry leaders. Shane Goldmacher, a national political correspondent for The New York Times, explains."
    },
    {
        "title": "In Election’s Final Days, Dark Money and ‘Gray Money’ Fund Hidden Agendas",
        "date": "2024-10-30",
        "content": "Big-money operatives are taking advantage of lax rules at the end of the campaign to hide the true source of their money until after the election is called — or for forever."
    },
    {
        "title": "Instead of Going Boldly on Space, Harris Has Taken a Steady Approach",
        "date": "2024-10-30",
        "content": "As chair of the White House’s National Space Council, the vice president largely emphasized continuity with policies set by the Trump administration."
    },
    {
        "title": "Consumers Keep U.S. Economy Growing at Healthy Pace",
        "date": "2024-10-30",
        "content": "In a key economic report released just days before the presidential election, gross economic product rose at a 2.8 percent rate in the third quarter."
    },
    {
        "title": "The Musk Campaign Steps Up",
        "date": "2024-10-30",
        "content": "The tech mogul is pushing even harder in the final days of the presidential race to get Donald Trump re-elected, with plenty at stake for his businesses."
    },
    {
        "title": "Trump’s Hostility to Democracy",
        "date": "2024-10-30",
        "content": "We explore the ways that Trump could undermine democratic traditions."
    },
    {
        "title": "Six Days Left: Closing Arguments, Racist Jokes and Burning Ballots",
        "date": "2024-10-30",
        "content": "Our final round table before Election Day features three of The New York Times’s top campaign reporters — Astead Herndon, Shane Goldmacher and Lisa Lerer — discussing the big events of the past several days."
    },
    {
        "title": "Let Me Ask a Question We Never Had to Ask Before",
        "date": "2024-10-30",
        "content": "Election Day is only the beginning."
    },
    {
        "title": "Harris’s Mission: Disqualify Trump, but Extend a Hand to His Voters",
        "date": "2024-10-30",
        "content": "Kamala Harris, in her closing argument to voters, acknowledged an inescapable political reality: Donald Trump is not a fringe figure within his own party or the nation."
    },
    {
        "title": "Once Top Advisers to Trump, They Now Call Him ‘Liar,’ ‘Fascist’ and ‘Unfit’",
        "date": "2024-10-30",
        "content": "Some of the strongest criticisms of former President Donald J. Trump have come from those who knew him as commander in chief."
    },
    {
        "title": "Michigan Clerk Removed From Election Duty Over Plans for a Hand Count",
        "date": "2024-10-30",
        "content": "The clerk had said he wanted to count votes by hand, as Trump-aligned activists push misinformation about problems with voting machines."
    },
    {
        "title": "The D.N.C. Targets Regional Newspapers in New Ad Campaign",
        "date": "2024-10-30",
        "content": "The ads seeking to define Donald Trump as “unhinged, unstable, unchecked” are running in smaller suburban newspapers."
    },
    {
        "title": "This Time, It May Actually Come Down to Turnout",
        "date": "2024-10-30",
        "content": "Democrats have gained among high-turnout voters, while Donald Trump has made gains among groups that tend to show up only for presidential races, or not at all."
    },
    {
        "title": "Let’s Set the Record Straight on Biden, Harris and the Border",
        "date": "2024-10-30",
        "content": "Behind the scenes, the president and vice president conducted a campaign to get the crisis under control."
    },
    {
        "title": "A Democratic and a Republican Pollster Agree: This Is the Fault Line That Decides the Election",
        "date": "2024-10-30",
        "content": "How college-educated women and non-college-educated men are defining the contours of the 2024 presidential election."
    },
    {
        "title": "What if Democrats Win the White House and Congress on Tuesday?",
        "date": "2024-10-30",
        "content": "If Democrats win the White House and Congress, they might finally make lasting changes to voting rights and abortion access."
    },
    {
        "title": "Clean Energy Is Booming in the U.S. The Election Could Change That.",
        "date": "2024-10-30",
        "content": "Trump has suggested he would dismantle the Inflation Reduction Act, which has reshaped America’s energy landscape. It won’t be easy."
    },
    {
        "title": "These Progressive Ideas Flopped. They’re Still Dangerous.",
        "date": "2024-10-30",
        "content": "Just because an idea never became law doesn’t mean we should shrug it off."
    },
    {
        "title": "How FTX’s Young Executives Shattered Their Parents",
        "date": "2024-10-30",
        "content": "As their children are sentenced for fraud, the parents of FTX’s top leaders have described their disbelief at how the crypto exchange upended their lives."
    },
    {
        "title": "Democratic Lawyer Stymied Trump in 2020. Other Efforts Played Into G.O.P. Hands.",
        "date": "2024-10-30",
        "content": "Marc Elias, hired to help Kamala Harris in election-related fights, helped to pave the way for big money in politics."
    },
    {
        "title": "If You Think Biden and Harris Were Weak on the Border, Think Again",
        "date": "2024-10-30",
        "content": "Behind the scenes, Biden and Harris conducted a campaign to secure the border."
    },
    {
        "title": "In New York, Democrats See Glimmer of Hope After Stinging Midterm Losses",
        "date": "2024-10-30",
        "content": "Their congressional candidates have fixed key political missteps. But are voters upset about inflation and the migrant influx ready to take the party back?"
    },
    {
        "title": "Six Days Left: Closing Arguments, Racist Jokes and Burning Ballots",
        "date": "2024-10-30",
        "content": "Michael Barbaro sits down with the Times reporters Lisa Lerer, Astead Herndon and Shane Goldmacher to discuss the final week of the presidential race"
    },
    {
        "title": "Wednesday Briefing",
        "date": "2024-10-30",
        "content": "A closing address by Vice President Kamala Harris."
    },
    {
        "title": "Trump and His Allies Link Biden’s ‘Garbage’ Comment to 2016 ‘Deplorables’ Remark",
        "date": "2024-10-30",
        "content": "Within minutes of the clip of President Biden’s remarks going viral, the Trump campaign and others were using it to attack Kamala Harris and Democrats."
    },
    {
        "title": "Biden Appears to Insult Trump Supporters as ‘Garbage,’ but Quickly Tries to Clarify",
        "date": "2024-10-30",
        "content": "In a posting on social media, President Biden said he was talking about racist language, not Trump supporters."
    },
    {
        "title": "'Stop Pointing Fingers and Start Locking Arms,' Harris Says",
        "date": "2024-10-30",
        "content": "Vice President Kamala Harris delivered a speech from Washington’s Ellipse, where former President Trump exhorted his followers on Jan. 6, 2021, highlighting their differences in front of about 75,000 people."
    },
    {
        "title": "Michelle Obama, Rallying Young Voters Near Atlanta, Warns of ‘Apathy’",
        "date": "2024-10-30",
        "content": "With just a few days left to vote early in Georgia, the former first lady offered a bracing tutorial in the realities of political power, beseeching young people to reach out to the undecided voters in their lives."
    },
    {
        "title": "Partial Breach of Election Machine Passwords in Colorado Poses No Risk, State Says",
        "date": "2024-10-30",
        "content": "The secretary of state said that the machines are not online, require a second set of passwords and are under constant surveillance in locked rooms."
    },
    {
        "title": "As Trump Sows Doubt on Pennsylvania Voting, Officials Say the System Is Working",
        "date": "2024-10-30",
        "content": "Donald Trump is using reports about suspicious voter registrations to cast the election as already flawed. County officials say the episodes are being distorted."
    },
    {
        "title": "Nikki Haley Says She Is ‘on Standby’ to Campaign for Donald Trump",
        "date": "2024-10-30",
        "content": "Ms. Haley, a former rival of Mr. Trump, has repeatedly offered advice and criticism to Mr. Trump and other Republican candidates from the sidelines."
    },
    {
        "title": "When Will the Presidential Race Be Called? Here’s What to Know.",
        "date": "2024-10-30",
        "content": "It could take days to know the winner, as it did in 2020, because counting mail ballots takes time. But returns on election night could also offer clarity."
    },
    {
        "title": "Elon Musk Sees Trump’s Economic Plans Causing ‘Temporary Hardship’",
        "date": "2024-10-29",
        "content": "Mr. Musk agreed with an X post saying there would be an “initial severe overreaction in the economy” before returning to sustainable growth if Mr. Trump is elected and follows through on his plans."
    },
    {
        "title": "A Harris Presidency Is the Only Way to Stay Ahead of A.I.",
        "date": "2024-10-29",
        "content": "We must make sure that superintelligent machines remain aligned with human values and interests as they use their powers to go off in their own directions."
    },
    {
        "title": "A Conservative Case Against Trump",
        "date": "2024-10-29",
        "content": "In a choice between misfortunes, one is clearly worse."
    },
    {
        "title": "Fani Willis Takes the Stand as a Victim of Racist Threats",
        "date": "2024-10-29",
        "content": "Ms. Willis spoke of the fear she felt after a man made “vile” calls targeting her and another Black official in Georgia. The man was sentenced to almost two years in prison."
    },
    {
        "title": "Amid Backlash, Trump Claims No President Has Done More for Puerto Rico Than He Has",
        "date": "2024-10-29",
        "content": "The former president made the claim at a round-table discussion in Pennsylvania on Tuesday, days after a comic disparaged Puerto Rico during Sunday’s Trump rally in New York."
    },
    {
        "title": "Democrats Highlight Puerto Rico Insult on Billboards Near Trump Rally",
        "date": "2024-10-29",
        "content": "The party invested in two digital highway billboards in Allentown, Pa., which has a significant Puerto Rican population."
    },
    {
        "title": "Supreme Court Declines to Remove R.F.K. Jr. From Ballot in Two Key States",
        "date": "2024-10-29",
        "content": "Since throwing his support behind former President Donald J. Trump, Mr. Kennedy has sought both to be removed from and to remain on various state ballots."
    },
    {
        "title": "What Can a Celebrity Endorsement Do? Ask Shonda Rhimes.",
        "date": "2024-10-29",
        "content": "Vice President Kamala Harris has plenty of big-name backers, but one of the eternal questions is how much star power ultimately matters to voters."
    },
    {
        "title": "A Closing Argument for an Abnormal Election",
        "date": "2024-10-29",
        "content": "A divided and deadlocked country faces big questions about what presidential power is actually for."
    },
    {
        "title": "Judge Tosses Republican Suit Over Military and Overseas Ballots in Pennsylvania",
        "date": "2024-10-29",
        "content": "A judge said six Republican members of the state’s congressional delegation could not rely on “phantom fears of foreign malfeasance” to justify initiating a legal action so close to Election Day."
    },
    {
        "title": "Harris Is Trying to Win Voters by Laying Out the Alternative",
        "date": "2024-10-29",
        "content": "Also, Teri Garr found the soul in memorable ditsy blondes. Here’s the latest at the end of Tuesday."
    },
    {
        "title": "What Are the Implications of Israel Banning UNRWA?",
        "date": "2024-10-29",
        "content": "Humanitarian agencies fear the new Israeli laws could have catastrophic effects for Gazans. They are already drawing sharp criticism from Israel’s allies."
    },
    {
        "title": "Trump Ad Claims Harris Will ‘Doom Medicare’",
        "date": "2024-10-29",
        "content": "With older Americans making up a major share of voters in battleground states, the Trump campaign casts Kamala Harris as a threat to programs that benefit them."
    },
    {
        "title": "Wednesday Briefing: Trump’s Worrisome Business Deals",
        "date": "2024-10-29",
        "content": "Plus, what happened to repatriated art in Benin."
    },
    {
        "title": "Man Who Attacked Paul Pelosi Is Sentenced to Life in Prison",
        "date": "2024-10-29",
        "content": "David DePape broke into the San Francisco home of Nancy Pelosi, the former speaker of the House, in 2022 and beat her husband with a hammer."
    },
    {
        "title": "44 Million Voters Have Already Cast a Ballot. Most Voted Early in 2020, Too.",
        "date": "2024-10-29",
        "content": "The fixed nature of the early vote makes it difficult to predict whether overall turnout will be as high as in 2020 and 2022, or whether either party is truly building an edge."
    },
    {
        "title": "Devices With ‘Free Gaza’ Messages Found at Ballot Box Fires",
        "date": "2024-10-29",
        "content": "The police said they had not determined a motive for the arson fires in Portland, Ore., and Vancouver, Wash. But the messages have heightened the sensitivity of the investigation."
    },
    {
        "title": "The Runza, a Favorite Nebraska Sandwich, Has a Cameo in the Campaign",
        "date": "2024-10-29",
        "content": "Tim Walz, the Democratic vice-presidential nominee, is a fan of the ground-beef treat. On a recent stop at a Runza restaurant in Omaha, he managed to spend $600."
    },
    {
        "title": "What a ‘Tennessee Three’ Member Thinks She Can Achieve by Running for Senate",
        "date": "2024-10-29",
        "content": "Gloria Johnson’s bid to unseat Senator Marsha Blackburn appears destined to fail, but she still sees an opening to start chipping away at Republican dominance in the state."
    },
    {
        "title": "Barbara Bush, Scion of Republican Royalty, Knocks on Doors for Kamala Harris",
        "date": "2024-10-29",
        "content": "Ms. Bush, whose father and grandfather were the last two Republican presidents before Donald J. Trump, is backing his Democratic opponent."
    },
    {
        "title": "Trump Family Members and Biden Aides Among China Hack Targets",
        "date": "2024-10-29",
        "content": "Phones used by Jared Kushner and Eric Trump were among those that hackers sought access to as part of a counterintelligence effort carried out by a hacking group associated with China."
    },
    {
        "title": "San Jose State Women’s Volleyball Team Finds Itself at Center of Transgender Debate",
        "date": "2024-10-29",
        "content": "After reports that the team includes a transgender player, several schools have forfeited matches against the university out of protest."
    },
    {
        "title": "Ahead of Harris’s Speech in Washington, Trump Tries to Focus on Immigration",
        "date": "2024-10-29",
        "content": "The former president believes his focus on illegal immigration is the reason he won in 2016, and this year, he has pushed his advisers to add content related to it."
    },
    {
        "title": "How Trump Exploits Divisions Among Black and Latino Voters",
        "date": "2024-10-29",
        "content": "Donald J. Trump’s anti-immigrant message is exposing longstanding tensions and challenging Democrats’ hopes for solidarity."
    },
    {
        "title": "Bad Bunny Responds to Racist Remarks at Trump Rally With a Message of Puerto Rican Pride",
        "date": "2024-10-29",
        "content": "The pop superstar posted a video lauding the island’s “kings and queens,” two days after he shared a clip of Vice President Kamala Harris addressing Puerto Rican voters."
    },
    {
        "title": "Despite Covid ‘Amnesia,’ the Pandemic Simmers Beneath the 2024 Race",
        "date": "2024-10-29",
        "content": "Dueling Trump and Harris rallies outside Atlanta offer a case study in how anger and anxiety over Covid-19, a proxy for the larger debate over trust in government, have shaped the 2024 race."
    },
    {
        "title": "Why Is Harris So Passionate About Abortion Rights? Her Past Work Holds Clues.",
        "date": "2024-10-29",
        "content": "For a politician who has been criticized for shifting positions on some issues, this is an area where she has shown unwavering conviction."
    },
    {
        "title": "Is There a Moral Choice for Catholic Voters?",
        "date": "2024-10-29",
        "content": "Why are we being asked to choose between the lesser of two evils?"
    },
    {
        "title": "What Happened When Chicago’s Mayor Followed a Teachers’ Union Playbook",
        "date": "2024-10-29",
        "content": "In Chicago, the mayor and the teachers’ union are tightly connected. The relationship has ushered in generous spending and led to political turmoil."
    },
    {
        "title": "Your questions about The Times’s election coverage: Endorsing presidential candidates",
        "date": "2024-10-29",
        "content": "Our journalists answer questions from readers."
    },
    {
        "title": "How Elon Musk Might Use His Pull With Trump to Help Tesla",
        "date": "2024-10-29",
        "content": "Although Donald Trump has opposed policies that favor electric cars, if he becomes president he could ease regulatory scrutiny of Tesla or protect lucrative credits and subsidies."
    },
    {
        "title": "‘Hatred and Vitriol’ at the Trump Rally in New York",
        "date": "2024-10-29",
        "content": "Readers react to the Trump rally at Madison Square Garden and a tragedy in Springfield, Ohio. Also: Gut feelings about the election; benefits of electric cars."
    },
    {
        "title": "Could the Vote Be Contested Again? 5 Threats to a Smooth Election.",
        "date": "2024-10-29",
        "content": "Litigation, disinformation and battles over certifying the vote all have the potential to complicate the process."
    },
    {
        "title": "The Threats to The Presidential Election, Explained",
        "date": "2024-10-29",
        "content": "Nick Corasaniti, a New York Times reporter covering voting, describes how the 2024 election could be complicated by litigation, disinformation and battles over certifying the vote."
    },
    {
        "title": "A New Insult Reminds Puerto Ricans of How Trump Treated Them",
        "date": "2024-10-29",
        "content": "As president, Donald Trump fought bitterly with Puerto Rican officials, ridiculed them and resisted sending aid to the territory after devastating hurricanes."
    },
    {
        "title": "In Closing, Harris Casts Herself as the Unifier and Trump as a ‘Petty Tyrant’",
        "date": "2024-10-29",
        "content": "In a plain-spoken but forceful speech at the Ellipse in Washington, Kamala Harris presented herself as a protector of the public good and used the arc of history to attack her Republican rival."
    },
    {
        "title": "Trump’s Environmental Claims Ignore Decades of Climate Science",
        "date": "2024-10-29",
        "content": "The former president says he wants “clean air and clean water,” but he has rolled back environmental rules and dismissed the scientific consensus on climate change."
    },
    {
        "title": "Where’s Ivanka?",
        "date": "2024-10-29",
        "content": "Donald J. Trump’s oldest daughter and former top aide was once one of his most prominent campaign surrogates. Lately, she’s noticeably absent."
    },
    {
        "title": "Who Won the Oscars of American Fashion",
        "date": "2024-10-29",
        "content": "A new generation of designers is on the rise."
    },
    {
        "title": "Jeff Bezos, Jerome Powell, Serena Williams and More at the DealBook Summit",
        "date": "2024-10-29",
        "content": "The conference on Dec. 4 will bring together the biggest names in business, politics and culture."
    },
    {
        "title": "A Book that Explains the 2024 Campaign",
        "date": "2024-10-29",
        "content": "We’re covering America’s working-class majority."
    },
    {
        "title": "On the Ballot: An Immigration System Most Americans Never Wanted",
        "date": "2024-10-29",
        "content": "The complicated history of trade-offs and compromises behind U.S. border control."
    },
    {
        "title": "Foreign Election Interference, and Volkswagen May Close Factories",
        "date": "2024-10-29",
        "content": "Plus, why you should never cross a crow."
    },
    {
        "title": "With Limited Options, Zelensky Seeks a Path Forward for Ukraine",
        "date": "2024-10-29",
        "content": "A muted response to Ukraine’s “victory plan” and steep challenges on the battlefield leave Kyiv searching for a Plan B."
    },
    {
        "title": "Stephen Bannon, Released From Prison, Says He Is ‘Empowered’",
        "date": "2024-10-29",
        "content": "Mr. Bannon, the combative right-wing strategist, said if Trump’s vote totals on Election Day look like 2020, he should once again declare himself the winner."
    },
    {
        "title": "We’ve Just Had a Glimpse of the World to Come",
        "date": "2024-10-29",
        "content": "Last week’s BRICS summit showed how the balance of global power increasingly eludes the West’s grasp."
    },
    {
        "title": "An Ethical Minefield Awaits a Possible Second Trump Presidency",
        "date": "2024-10-29",
        "content": "With business ties to foreign governments and holdings in industries overseen by federal regulators, Donald Trump would likely be the most conflicted president in U.S. history."
    },
    {
        "title": "Trump Is Less Confident Than He Says. His Rally at Madison Square Garden Proves It.",
        "date": "2024-10-29",
        "content": "Reminder: Trump is not the world spirit incarnate."
    },
    {
        "title": "Trump Uses Thumbs-Up Video From Sept. 11 Event for a Snapchat Ad",
        "date": "2024-10-29",
        "content": "After months of ignoring Snapchat, Donald Trump’s campaign has begun using the platform, urging people to vote by promoting a viral clip of him flashing a thumbs-up at a somber memorial service."
    },
    {
        "title": "Vivek Ramaswamy Has a Different Vision for Trumpism From JD Vance",
        "date": "2024-10-29",
        "content": "The former Trump primary challenger discusses the ideological divides he sees within Trumpism."
    },
    {
        "title": "Inside Trump’s Truth Social Conspiracy Theory Machine",
        "date": "2024-10-29",
        "content": "An analysis of thousands of Donald Trump’s Truth Social posts reveals that the former president directly promoted false conspiracy theories in at least 330 instances and amplified at least 145 conspiracists."
    },
    {
        "title": "Who Do You Hope Will Win the 2024 Presidential Election?",
        "date": "2024-10-29",
        "content": "Who do you think will make a better president? What is at stake for you and for the nation?"
    },
    {
        "title": "My Fellow Republicans, It’s Time to Say ‘Enough’ With Trump",
        "date": "2024-10-29",
        "content": "G.O.P. members need to put country above party."
    },
    {
        "title": "Why This Senate Candidate Is a Potential ‘Shock to the System’",
        "date": "2024-10-29",
        "content": "Michelle Goldberg went to Nebraska and found political hope in an independent."
    },
    {
        "title": "Migrants in New York Have Become a Campaign Trope",
        "date": "2024-10-29",
        "content": "The migrant crisis has emerged as a dominant theme in House races across New York State and even in the presidential race."
    },
    {
        "title": "In a Decisive Election, a Jewish Group Focuses on Climate Voters",
        "date": "2024-10-29",
        "content": "Dayenu, a nonprofit group, is mobilizing Jews around a threat that organizers warn every walk of life on earth must confront: climate change."
    },
    {
        "title": "How Protest Pins Taught Me About My Family History",
        "date": "2024-10-29",
        "content": "A consideration of the big ideas on small political buttons."
    },
    {
        "title": "What We Learned From Democrats’ Ads for Senate",
        "date": "2024-10-29",
        "content": "What’s the strategy of Democrats in U.S. Senate races in red and purple states? David Leonhardt, a senior writer at The New York Times who runs The Morning daily newsletter, looks at their ads."
    },
    {
        "title": "I’ve Been Through a Lot of Election Nights. Here’s How Nov. 5 May Go.",
        "date": "2024-10-29",
        "content": "Declaring a winner may take some time."
    },
    {
        "title": "Trump Says the Country Is ‘Dying.’ The Data Says Otherwise.",
        "date": "2024-10-29",
        "content": "Look at trends, not anecdotes."
    },
    {
        "title": "Florida Stopped Being a Swing State Slowly, Then All at Once",
        "date": "2024-10-29",
        "content": "Once a top presidential battleground, the state is lost to Democrats. The party’s missteps, along with demographic change, led to every one of Florida’s 67 counties becoming more red."
    },
    {
        "title": "E.P.A., Just Rebounding From Trump Years, Faces an Uncertain Future",
        "date": "2024-10-29",
        "content": "Perhaps more than any other federal agency, the one responsible for protecting air, water and public health is a target for Donald Trump and his allies."
    },
    {
        "title": "How Will Harris Make a Last Plea to Voters? Here Are Clues From the Courtroom.",
        "date": "2024-10-29",
        "content": "The New York Times unearthed transcripts from Kamala Harris’s years as a prosecutor. Her approach during trials offers hints about how she will make her final case to voters."
    },
    {
        "title": "A House Divided",
        "date": "2024-10-29",
        "content": "How is the election affecting the relationships in your family, school or community?"
    },
    {
        "title": "Why Trump Has an Edge With These 11 Michigan Voters — Even Though They Don’t Like Him",
        "date": "2024-10-29",
        "content": "The group participants discuss the state of the race and what may drive them toward a given candidate."
    },
    {
        "title": "Puerto Rico’s G.O.P. Chairman Demands Apology From Trump for Comic’s Remarks",
        "date": "2024-10-29",
        "content": "The island’s Catholic archbishop also wrote a letter to Donald Trump condemning a racist comedy routine during his Madison Square Garden rally."
    },
    {
        "title": "How Russia, China and Iran Are Interfering in the Presidential Election",
        "date": "2024-10-29",
        "content": "Eight years after Russia interfered in the 2016 presidential election, foreign influence with American voters has grown more sophisticated. That could have outsize consequences in the 2024 race."
    },
    {
        "title": "Vivek Ramaswamy Has a Different Vision for Trumpism From JD Vance",
        "date": "2024-10-29",
        "content": "Vivek Ramaswamy Has a Different Vision for Trumpism From JD Vance"
    },
    {
        "title": "Trump Attacks Michelle Obama, Days After She Criticized Him",
        "date": "2024-10-29",
        "content": "At a rally in Atlanta, Donald Trump called the former first lady a “hater,” in response to her comments saying he had displayed “erratic behavior” and “obvious mental decline.”"
    },
    {
        "title": "Trump Long Ago Crossed the Line From Propriety to Profanity. Then Came the Garden.",
        "date": "2024-10-29",
        "content": "In former President Donald J. Trump’s third campaign for the White House, his speeches have grown coarser and coarser."
    },
    {
        "title": "Harris Dives Into a Frenetic Final Week With a Swing Through Michigan",
        "date": "2024-10-29",
        "content": "The vice president finished her day in the battleground state at a rally near the University of Michigan’s campus in Ann Arbor, where she sprinkled her speech with outreach to progressive Democrats."
    },
    {
        "title": "Secret Files in Election Case Show How Judges Limited Trump’s Privilege",
        "date": "2024-10-29",
        "content": "The partly unsealed rulings, orders and transcripts open a window on a momentous battle over grand jury testimony that played out in secret, creating important precedents about executive privilege."
    },
    {
        "title": "Puerto Ricans in Philadelphia Are Angered by Bigoted Remarks at Trump Rally",
        "date": "2024-10-29",
        "content": "Many Puerto Ricans in the crucial battleground state said the remarks, such as one deriding Puerto Rico as “a floating island of garbage,” fit a common disrespectful attitude toward the island territory."
    },
    {
        "title": "Doug Emhoff Condemns Antisemitism as Democrats Court Jewish Voters",
        "date": "2024-10-29",
        "content": "In a speech in Pittsburgh a day after the sixth anniversary of the Tree of Life shooting, he vouched for Kamala Harris’s commitment to Jewish security and issued a warning about Donald Trump."
    },
    {
        "title": "Why Trump Uses Comics Like Tony Hinchcliffe to Spread His Message",
        "date": "2024-10-28",
        "content": "Like the former president, these stand-ups loathe the news media, delight in transgression and harbor a deep-seated love of cruel insult jokes."
    },
    {
        "title": "Obama Is the Same. His Coalition Isn’t.",
        "date": "2024-10-28",
        "content": "Democrats failed to preserve his coalition, and Harris is now trying to assemble a different one."
    },
    {
        "title": "Trump Repeatedly Refers to CNN’s Anderson Cooper as ‘Allison’",
        "date": "2024-10-28",
        "content": "The former president, who often uses disparaging nicknames for people he dislikes, has referred to the host by a woman’s name on at least three occasions since Friday."
    },
    {
        "title": "Latinos Blast Disparaging Remarks Made at Trump’s N.Y.C. Rally",
        "date": "2024-10-28",
        "content": "Latinos warned that the racist and vulgar insults made by some speakers at Donald J. Trump’s rally in New York City — particularly those by a stand-up comic — could cost the former president votes this election."
    },
    {
        "title": "Michelle Obama Decries a ‘Double Standard’ in Treatment of Trump and Harris",
        "date": "2024-10-28",
        "content": "As Donald Trump’s rhetoric grows more extreme, liberals say Kamala Harris is being held, unfairly, to a higher bar by voters and the media. One is “allowed to be lawless while the other one has to be flawless,” a congresswoman said."
    },
    {
        "title": "Biden Casts Early Ballot for Harris",
        "date": "2024-10-28",
        "content": "President Joe Biden joined early voters in New Castle, Del., a deeply Democratic district near his hometown of Wilmington."
    },
    {
        "title": "Rally Backlash Puts Trump on the Defensive",
        "date": "2024-10-28",
        "content": "Also, North Korean troops were deployed to help Russian forces. Here’s the latest at the end of Monday."
    },
    {
        "title": "Musk Repeatedly Raises the Idea That Harris, or He, Could Be Assassinated",
        "date": "2024-10-28",
        "content": "The billionaire and his PAC have used foreboding language about the vice president in their support of former President Donald Trump."
    },
    {
        "title": "N.Y.P.D. Chief Stirs Criticism With Newsmax Appearance at Trump Rally",
        "date": "2024-10-28",
        "content": "John Chell also went on other networks, but struck a nerve by appearing on a channel that has boosted conspiracy theories and misinformation."
    },
    {
        "title": "Gaza Cease-Fire Talks Resume, but Are Overshadowed by U.S. Election",
        "date": "2024-10-28",
        "content": "Envoys from Israel, Egypt, the United States and Qatar took part in the negotiations, but no agreements are expected until American voters choose their next president."
    },
    {
        "title": "Tuesday Briefing: The U.S. Campaign’s Final Stretch",
        "date": "2024-10-28",
        "content": "Plus, the “Ketamine Queen.”"
    },
    {
        "title": "Trump Team Fears Damage From Racist Rally Remarks",
        "date": "2024-10-28",
        "content": "The Trump campaign issued a rare statement distancing itself from a comedian’s offensive joke about Puerto Rico at his rally on Sunday, a sign that it was concerned about losing crucial votes."
    },
    {
        "title": "Trump Hints at ‘Little Secret’ With House Republicans, Setting Off a Panic",
        "date": "2024-10-28",
        "content": "The former president seemed to delight in fueling speculation about what he is cooking up with House Republicans, prompting Democrats to worry about election fraud. Speaker Mike Johnson refused to explain."
    },
    {
        "title": "Hundreds of Ballots Destroyed After Drop Boxes Set on Fire",
        "date": "2024-10-28",
        "content": "Federal authorities were investigating two fires that were lit in ballot drop boxes in the Pacific Northwest early Monday."
    },
    {
        "title": "Republicans Distance Themselves From Puerto Rico Insult at Trump’s Rally",
        "date": "2024-10-28",
        "content": "A comedian who spoke at Donald Trump’s campaign rally at Madison Square Garden referred to the U.S. territory as a “floating island of garbage,” prompting immediate backlash."
    },
    {
        "title": "Philadelphia District Attorney Sues Musk Over $1 Million Voter Giveaways",
        "date": "2024-10-28",
        "content": "Larry Krasner, the top prosecutor in Philadelphia, sued Elon Musk and his Trump-supporting super PAC, saying the giveaways amounted to an “unlawful lottery.”"
    },
    {
        "title": "Harris Ties Trump to the Fatal Fallout of Abortion Bans",
        "date": "2024-10-28",
        "content": "An ad from the Harris campaign highlights the death of Amber Nicole Thurman, a Georgia woman whose delay in medical care was reportedly tied to the state’s post-Roe abortion restrictions."
    },
    {
        "title": "In Montana, Republican Tim Sheehy Tries to Outrun Jon Tester, and Scrutiny",
        "date": "2024-10-28",
        "content": "The novice Republican candidate’s honesty has come into question in a race that could decide Senate control."
    },
    {
        "title": "Biden Waits in Line and Casts His Vote for Harris",
        "date": "2024-10-28",
        "content": "The president and onetime nominee stood with more than a hundred early voters on Monday in Delaware. He said the moment was “just sweet,” not bittersweet."
    },
    {
        "title": "Bannon’s Release From Prison Will Unleash an Agitator Into a Heated Campaign",
        "date": "2024-10-28",
        "content": "Allies say Stephen K. Bannon, one of the right’s most influential voices, has been tracking the race from prison and is ready to push Trump supporters to the polls."
    },
    {
        "title": "Who Is Tony Hinchcliffe, the Trump Rally Comedian?",
        "date": "2024-10-28",
        "content": "Known for insult-style comedy, he took aim at Latinos, African Americans, Palestinians and Jews at Madison Square Garden on Sunday, and called Puerto Rico a “floating island of garbage.”"
    },
    {
        "title": "Harris Aides Quietly Grow More Bullish on Defeating Trump",
        "date": "2024-10-28",
        "content": "While still cautious, advisers and allies believe that casting Donald Trump as a fascist is working, and that their expansive ground game and appeals on abortion rights may carry the day."
    },
    {
        "title": "Harris Campaign Distances Itself From Biden in the Crucial Final Days",
        "date": "2024-10-28",
        "content": "Joint events with an unpopular incumbent would “only hurt” the vice president at this stage of the campaign, as one of her advisers put it. But the president does not want to be sidelined."
    },
    {
        "title": "He Was 5 When Border Agents Took Him From His Father. He Hasn’t Forgotten.",
        "date": "2024-10-28",
        "content": "Seven years after a Trump policy ruptured his family and landed him in foster care, José is a star student. But he is still scarred. “I don’t trust anyone.”"
    },
    {
        "title": "Adam Schiff, Not Yet a Senator, Deploys to Bolster Potential Future Colleagues",
        "date": "2024-10-28",
        "content": "With his election in California all but assured, the prominent Donald Trump antagonist is spending the final days of the race trying to help Democrats in the battlegrounds over the finish line."
    },
    {
        "title": "Whether Harris or Trump Wins, Seeking Asylum in the U.S. May Never Be the Same",
        "date": "2024-10-28",
        "content": "As administrations of both parties have failed to overhaul the nation’s immigration laws, a reckoning for the asylum system, which some say is overdue, seems inevitable."
    },
    {
        "title": "The Misogynistic, Bigoted and Crude Rally Remarks Trump Hasn’t Disavowed",
        "date": "2024-10-28",
        "content": "A range of speakers at Madison Square Garden on Sunday disparaged Latinos, Black people, Palestinians and Jews, and made vulgar references to Kamala Harris. The Trump campaign has distanced itself from only one of these statements."
    },
    {
        "title": "Investigators Identify ‘Suspect Vehicle’ in Ballot Drop Box Fires in the Pacific Northwest",
        "date": "2024-10-28",
        "content": "Hundreds of ballots may have been destroyed in Washington, while a fire suppressant protected most of the ballots in Portland."
    },
    {
        "title": "‘Lady Blogs’ Would Have Had a Field Day With This Election",
        "date": "2024-10-28",
        "content": "The robust feminist blogosphere of 2016 is all but gone. Some of the creators are missing its perspective."
    },
    {
        "title": "MAGA Unchained in Madison Square Garden",
        "date": "2024-10-28",
        "content": "Trump’s big rally featured unadulterated racism and more talk of “enemies from within.”"
    },
    {
        "title": "The Presidential Endorsements That Weren’t",
        "date": "2024-10-28",
        "content": "Readers both decry and praise the decision by The Washington Post and The Los Angeles Times not to endorse. Also: An early voter; the New York Historical."
    },
    {
        "title": "Why a Key Biden Effort to Boost Affordable Housing Has Faced Hurdles",
        "date": "2024-10-28",
        "content": "The Biden administration rolled out a plan last year to create more housing by unlocking more than $35 billion in lending capacity. It has yet to close on any loans that would support housing-related projects."
    },
    {
        "title": "Bloomberg, After Months of Pressure, Donates $50 Million to Help Harris",
        "date": "2024-10-28",
        "content": "The former mayor of New York City is known for making political donations late in the campaign season. Democrats had been lobbying him to spend more."
    },
    {
        "title": "Trump’s Vast Tariffs Would Rock Global Businesses and Shake Alliances",
        "date": "2024-10-28",
        "content": "Economists said Donald Trump’s plan to return trade barriers to levels not seen in generations would be “a grenade thrown in the heart” of the international system."
    },
    {
        "title": "Wages Have Outpaced Inflation. But Not for Everyone.",
        "date": "2024-10-28",
        "content": "On average, pay has risen faster than prices in recent years. But the overall picture is complicated — and it’s not just facts versus “vibes.”"
    },
    {
        "title": "The Rebellious Scientist Who Made Kamala Harris",
        "date": "2024-10-28",
        "content": "The presidential candidate’s mother, Shyamala Gopalan Harris, was a breast cancer researcher whose egalitarian politics often bucked a patriarchal lab culture."
    },
    {
        "title": "Democrats Use Gas Station Kiosks to Say Trump Will Make Life More Expensive",
        "date": "2024-10-28",
        "content": "The Democratic National Committee will run the 15-second ads in Michigan, Wisconsin, Minnesota, Iowa and Nebraska."
    },
    {
        "title": "The 2024 Stakes on Health Care",
        "date": "2024-10-28",
        "content": "We explore the presidential candidates’ health policy proposals."
    },
    {
        "title": "The Trump Campaign’s Big Gamble",
        "date": "2024-10-28",
        "content": "A look inside the operation’s field office in Maricopa County, Ariz."
    },
    {
        "title": "A Final Week of Campaigning, and Measured Words After Airstrikes on Iran",
        "date": "2024-10-28",
        "content": "Plus, hear a long-lost Chopin waltz."
    },
    {
        "title": "Your questions about The Times’s election coverage: Choosing the top story",
        "date": "2024-10-28",
        "content": "Our journalists answer questions from readers."
    },
    {
        "title": "Your questions about The Times’s election coverage: ‘Sane-washing’",
        "date": "2024-10-28",
        "content": "Our journalists answer questions from readers"
    },
    {
        "title": "Republicans Cling to Slim Leads in Nebraska and Texas Senate Races",
        "date": "2024-10-28",
        "content": "In Nebraska, Dan Osborn, an independent, is in a tight race with Senator Deb Fischer, and in Texas, Representative Colin Allred is four percentage points behind Senator Ted Cruz."
    },
    {
        "title": "‘Crazy’ Is Beginning to Sound Like an Understatement",
        "date": "2024-10-28",
        "content": "Election Day can’t come soon enough."
    },
    {
        "title": "Michelle Obama: ‘I Am Asking You, From the Core of My Being, to Take Our Lives Seriously’",
        "date": "2024-10-28",
        "content": "The former first lady shares an emotional appeal about how reproductive rights are on the line in this election."
    },
    {
        "title": "Democrats Won the Ad War. Will It Be Enough?",
        "date": "2024-10-28",
        "content": "Here’s what we learned after analyzing 3.7 million election ads."
    },
    {
        "title": "Happy 120th Birthday, New York City Subway!",
        "date": "2024-10-28",
        "content": "The first subway train left from City Hall on Oct. 27, 1904. Riders on the C train say the subway is essential to their lives as New Yorkers."
    },
    {
        "title": "Inside a Pro-Trump Network Ready to Challenge the Election",
        "date": "2024-10-28",
        "content": "For years, right-wing activists have huddled in video meetings to talk about how to remake democracy. They’ve spread conspiracy theories about illegal voting and planned meticulously for next week’s election. The New York Times has obtained the re..."
    },
    {
        "title": "Inside the Movement Behind Trump’s Election Lies",
        "date": "2024-10-28",
        "content": "For years, Republican activists have huddled in video meetings to talk about remaking democracy and plan for the election. The New York Times has obtained the recordings."
    },
    {
        "title": "The Real Reasons the G.O.P. Is Spending Millions on Anti-Trans Ads",
        "date": "2024-10-28",
        "content": "Republicans are banking on an issue that isn’t a priority for voters: trans rights."
    },
    {
        "title": "Anita Hill: The Smearing of Kamala Harris",
        "date": "2024-10-28",
        "content": "The insults hurled at Ms. Harris are a reminder of how Republican senators tried to shame me when I challenged Clarence Thomas’s fitness."
    },
    {
        "title": "Trump’s Changing Messages on Abortion, in 660 Quotes",
        "date": "2024-10-28",
        "content": "Donald Trump has softened his rhetoric, contradicted himself and nearly dropped “pro-life” from his vocabulary. Yet there is no evidence that his views on abortion have changed."
    },
    {
        "title": "What Threats Does My Vote Really Face?",
        "date": "2024-10-28",
        "content": "Follow your vote from the ballot box to the Electoral College to understand our election system and what obstacles might stand in its way."
    },
    {
        "title": "A Pivotal Choice: Trump vs. Harris on Climate Change",
        "date": "2024-10-28",
        "content": "Kamala Harris calls global warming an “existential threat.” Donald Trump dismisses it as a “scam.”"
    },
    {
        "title": "For a Stalwart Voice of Liberal Catholicism, a Complicated Centennial",
        "date": "2024-10-28",
        "content": "Commonweal magazine, founded in 1924, wrestles with its mission at a moment of a continuing loss of faith in both the church and liberalism."
    },
    {
        "title": "Ella Emhoff, Second Daughter of New York’s Downtown",
        "date": "2024-10-28",
        "content": "The stepdaughter of Vice President Kamala Harris, Ms. Emhoff has largely made a name for herself in New York’s creative scenes, far from Beltway politics."
    },
    {
        "title": "Why I’m Voting",
        "date": "2024-10-28",
        "content": "Editorial members reflect on their personal stakes in the 2024 election"
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters in Texas",
        "date": "2024-10-28",
        "content": "Results of a New York Times/Siena College poll conducted among 1,180 voters in Texas from Oct. 23 to 26, 2024."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Polls of Registered Voters in Nebraska and Nebraska’s 2nd C.D.",
        "date": "2024-10-28",
        "content": "Results of a New York Times/Siena College poll conducted among 1,194 voters in Nebraska, including 500 voters in Nebraska’s Second Congressional District, from Oct. 23 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Polls of the Likely Electorate in Nebraska and Nebraska’s 2nd C.D.",
        "date": "2024-10-28",
        "content": "Results of a New York Times/Siena College poll conducted among 1,194 voters in Nebraska, including 500 voters in Nebraska’s Second Congressional District, from Oct. 23 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Likely Electorate in Texas",
        "date": "2024-10-28",
        "content": "Results of a New York Times/Siena College poll conducted among 1,180 voters in Texas from Oct. 23 to 26, 2024."
    },
    {
        "title": "How New York City’s Migrant Crisis Became a Potent Campaign Issue",
        "date": "2024-10-28",
        "content": "Across New York State, Republican and Democratic candidates are using the city’s migrant crisis to attract voters fearful of its effects on their districts."
    },
    {
        "title": "In the Race for Congress, a Reporter Starts ‘With a Blank Notebook’",
        "date": "2024-10-28",
        "content": "Catie Edmondson, who has been covering Capitol Hill for The New York Times since 2018, tries to glean patterns that will determine control of the House."
    },
    {
        "title": "Uruguay’s Presidential Election Is Headed to a November Runoff",
        "date": "2024-10-28",
        "content": "Yamandú Orsi, a center-left former mayor, finished first on Sunday but fell short of the 50 percent threshold needed to avoid another round of voting."
    },
    {
        "title": "Israel Calls the Shots in the Mideast as U.S. Plays a Lesser Role",
        "date": "2024-10-28",
        "content": "A once pivotal player has seen its influence become limited."
    },
    {
        "title": "Trump at the Garden: A Closing Carnival of Grievances, Misogyny and Racism",
        "date": "2024-10-28",
        "content": "The inflammatory rally was a capstone for an increasingly aggrieved campaign for Donald Trump, whose rhetoric has grown darker and more menacing."
    },
    {
        "title": "A Trump Rally Speaker Trashed Puerto Ricans. Harris Reached Out to Them.",
        "date": "2024-10-27",
        "content": "Her campaign moved swiftly to highlight that even as a speaker at Donald Trump’s rally in New York made offensive remarks about Puerto Rico and Latinos, she was visiting Puerto Rican voters in Philadelphia."
    },
    {
        "title": "Trump Rally Opens With Insults Aimed at Latino, Black, Jewish and Arab American Voters",
        "date": "2024-10-27",
        "content": "Donald J. Trump’s rally at Madison Square Garden began with warm-up speakers who made a litany of racist remarks, vulgar insults and profanity-laden comments."
    },
    {
        "title": "Tim Walz and Alexandria Ocasio-Cortez Play Video Games and Talk Politics",
        "date": "2024-10-27",
        "content": "Playing Madden football and Crazy Taxi, Mr. Walz discussed building coalitions and opposing the Senate’s filibuster with Ms. Ocasio-Cortez on Twitch."
    },
    {
        "title": "Monday Briefing: A Majority of U.S. Voters Say Democracy is Under Threat",
        "date": "2024-10-27",
        "content": "Plus, a long-lost Chopin waltz."
    },
    {
        "title": "Far-Right Figures Escalate Talk of Retribution and Election Subversion",
        "date": "2024-10-27",
        "content": "Michael Flynn has said “hell” will be unleashed if Donald J. Trump wins. Mr. Flynn’s close associate has discussed plans to overturn the election if Mr. Trump loses."
    },
    {
        "title": "Pro-Harris Super PAC Raises Concerns About Focusing on Trump and Fascism",
        "date": "2024-10-27",
        "content": "The group, Future Forward, warned that attacking Donald J. Trump as a fascist or questioning his character or stamina are less effective than highlighting Kamala Harris’s proposals."
    },
    {
        "title": "Trump Supporters Line Up Early to Fill Madison Square Garden",
        "date": "2024-10-27",
        "content": "Many of the sights of a Trump rally were familiar, if the setting was not: the heart of Manhattan, where registered Democrats outnumber Republicans by about 10 to 1."
    },
    {
        "title": "Supporting Trump, JD Vance Calls Some Democrats More Dangerous Than Foreign Adversaries",
        "date": "2024-10-27",
        "content": "Mr. Vance made the remark as he sought to defend Donald J. Trump from former members of his administration who said he posed a threat to democracy."
    },
    {
        "title": "Advisers Propose That Trump Give Security Clearances Without F.B.I. Vetting",
        "date": "2024-10-27",
        "content": "A memo circulating in Donald Trump’s orbit says that if elected he should use private firms to check appointees’ backgrounds and give them immediate access to classified secrets after taking office."
    },
    {
        "title": "Beyoncé? Springsteen? Trump Fans Feel Both Anger and A-List Envy",
        "date": "2024-10-27",
        "content": "Kamala Harris has many celebrities campaigning for her. It has uncorked complicated feelings for Donald Trump and his supporters."
    },
    {
        "title": "‘Trump 2024’ Was Projected on a Town’s Water Tower. A Standoff Ensued.",
        "date": "2024-10-27",
        "content": "After a resident of Hanson, Mass., projected the logo on town property, local officials fined him $100 per day for violating its bylaws."
    },
    {
        "title": "Jill Stein’s Third-Party Candidacy",
        "date": "2024-10-27",
        "content": "Readers discuss Democrats’ concerns that her bid will throw the election to Donald Trump. Also: Harris ads; drug-free treatments; regretting email."
    },
    {
        "title": "Joseph J. Ellis: The Ideals of the Founders Are on the Ballot",
        "date": "2024-10-27",
        "content": "If Trump is president on July 4, 2026, the celebration will become a eulogy, for we will be honoring the corpse of the American republic."
    },
    {
        "title": "A Classical Music Discovery",
        "date": "2024-10-27",
        "content": "An unknown waltz by Chopin has been found."
    },
    {
        "title": "Two Billionaires, Two Newspapers, Two Acts of Self-Sabotage",
        "date": "2024-10-27",
        "content": "The Washington Post and The Los Angeles Times have made a terrible decision on presidential endorsements."
    },
    {
        "title": "Four Lessons From Nine Years of Being ‘Never Trump’",
        "date": "2024-10-27",
        "content": "What do I wish my 2024 self could travel back and say to 2015 me?"
    },
    {
        "title": "What Football Can Teach Politics",
        "date": "2024-10-27",
        "content": "Dwight Eisenhower learned leadership in an early job as a football coach. His success as president offers a few important lessons."
    },
    {
        "title": "Donald Trump Will Never Be Done With New York",
        "date": "2024-10-27",
        "content": "Sunday’s rally at Madison Square Garden, the self-styled “world’s most famous arena,” is a remarkable gambit, even by the former president’s standards — and a show of force."
    },
    {
        "title": "Voters Are Deeply Skeptical About the Health of American Democracy",
        "date": "2024-10-27",
        "content": "Nearly half say it does not do a good job representing the people, and three-quarters say it is under threat, according to a Times/Siena poll."
    },
    {
        "title": "Amid Talk of Fascism, Trump’s Threats and Language Evoke a Grim Past",
        "date": "2024-10-27",
        "content": "Plenty of presidents have been called dictators by their political opponents, but none until now has been publicly accused of being a “fascist” by his own handpicked advisers."
    },
    {
        "title": "Trump and Harris Scrap for Georgia as Supporters Brace for a Photo Finish",
        "date": "2024-10-27",
        "content": "Georgia has seen a flurry of activity underlining both parties’ recognition that, once again, the state is anyone’s to win."
    },
    {
        "title": "Where Kamala Harris and Donald Trump Stand on Crime",
        "date": "2024-10-27",
        "content": "Former President Donald J. Trump, who has 34 felony convictions and is facing three other indictments, wants to stretch the limits of executive power in the name of fighting crime if he is re-elected president. Vice President Kamala Harris, a form..."
    },
    {
        "title": "With Criminal Cases Looming, Trump Has a Personal Stake in the Election",
        "date": "2024-10-27",
        "content": "If he wins the White House, Donald J. Trump, who has a sentencing hearing three weeks after Election Day, could disrupt or even dispose of the various cases he is facing."
    },
    {
        "title": "Their Son’s Death Was Devastating. Then Politics Made It Worse.",
        "date": "2024-10-27",
        "content": "After Aiden Clark was killed in a school bus accident in Springfield, Ohio, his death inspired conspiracy theories, campaign lies and  anti-immigrant hate. Now his family is the latest target."
    },
    {
        "title": "Massachusetts, Famed for Tough School Standards, Rethinks Its Big Test",
        "date": "2024-10-27",
        "content": "A ballot measure would do away with the requirement that high schoolers pass a test to graduate. Opponents say it could water down academics for struggling students."
    },
    {
        "title": "This Town Has More Faith in Football Than Politics. Can Walz Make a Difference?",
        "date": "2024-10-27",
        "content": "In Aliquippa, Pa., residents have long believed more in their high school football team than in many politicians. Can combining the two make a difference?"
    },
    {
        "title": "Book Bans Live On in School District Now Run by Democrats",
        "date": "2024-10-27",
        "content": "Democrats swept a school board election in Bucks County after Republicans instituted book bans and other changes. But the right-wing “parental rights” movement has left an indelible mark."
    },
    {
        "title": "Susan B. Anthony Was Arrested for Voting. Now Her Home Is a Poll Site.",
        "date": "2024-10-27",
        "content": "The home in Rochester, N.Y., now a museum celebrating the women’s suffrage movement, is serving as a polling place for early voters."
    },
    {
        "title": "For Investors, What if This Time Is Different?",
        "date": "2024-10-27",
        "content": "Disregarding politics has worked brilliantly in the United States for a century. But market history offers comfort only up to a point, our columnist says."
    },
    {
        "title": "‘This Is Real’: Excerpts From Michelle Obama’s Speech on the Election",
        "date": "2024-10-27",
        "content": "Michelle Obama made a striking speech about the consequences that the election will have for women’s bodies and reproductive health."
    },
    {
        "title": "Michelle Obama Makes a Searing Appeal to Men: ‘Take Our Lives Seriously’",
        "date": "2024-10-27",
        "content": "The former first lady portrayed a second Trump administration as dire for American women. And she accused the media and many voters of holding Kamala Harris to a higher standard than Donald Trump."
    },
    {
        "title": "Michelle Obama Makes Abortion Rights Plea to Male Voters",
        "date": "2024-10-26",
        "content": "Michelle Obama, the former first lady, made the case during a rally for Vice President Kamala Harris that a vote for former President Donald J. Trump would be a vote against women’s reproductive rights and health."
    },
    {
        "title": "Trump, Who Once Proposed a Muslim Registry, Now Courts Their Votes",
        "date": "2024-10-26",
        "content": "The former president is reaching out to Muslim and Arab American voters in Michigan, a key battleground state."
    },
    {
        "title": "New York Mayor Says Trump Should Not Be Called ‘Fascist,’ Breaking With Harris and Party",
        "date": "2024-10-26",
        "content": "Mayor Eric Adams of New York, an embattled Democrat who has been indicted on federal corruption charges, has been careful in what he says about the former president."
    },
    {
        "title": "Trump Attacks Bipartisan Semiconductor Law, a Key Policy Achievement for Biden",
        "date": "2024-10-26",
        "content": "Former President Donald J. Trump’s comments came during a nearly three-hour episode of “The Joe Rogan Experience.”"
    },
    {
        "title": "Trump Escalates Threats as Campaign Enters Dark Final Stretch",
        "date": "2024-10-26",
        "content": "Top military leaders and high-ranking former officials from his administration have issued warning after warning that Donald J. Trump would rule as a dictator if given the chance."
    },
    {
        "title": "What to Know About the Chinese Hackers Who Targeted the 2024 Campaigns",
        "date": "2024-10-26",
        "content": "A group that experts call Salt Typhoon is believed to be behind a sophisticated breach of major telecommunication companies that has taken aim at American leaders."
    },
    {
        "title": "Daughter of L.A. Times Owner Says Endorsement Decision Stemmed From Harris Stance on Gaza War",
        "date": "2024-10-26",
        "content": "After the paper canceled its planned endorsement of Kamala Harris, the owner, Patrick Soon-Shiong, said his daughter didn’t speak for the organization. But many staff members questioned his motives."
    },
    {
        "title": "The World According to Kamala Harris",
        "date": "2024-10-26",
        "content": "The rise of Kamala Harris, the tenacious child of high-achieving immigrants, is atypical. But her story is also distinctly American."
    },
    {
        "title": "We’re Looking at the Wrong Gender Gap in Voting",
        "date": "2024-10-26",
        "content": "Young women support Harris more than young men support Trump. That might make the difference."
    },
    {
        "title": "Barricades and Bulletproof Glass: A County Prepares for Election Day",
        "date": "2024-10-26",
        "content": "With the specter of political violence looming, the Department of Homeland Security has advised hundreds of communities on election safety. Luzerne County, Pa., is at the center of the unrest."
    },
    {
        "title": "In Maine Battleground, Democrat Golden Grasps to Win Over Trump Voters",
        "date": "2024-10-26",
        "content": "To win his toughest re-election bid yet, Representative Jared Golden needs Trump voters to back him over a young Republican prospect, a former NASCAR driver."
    },
    {
        "title": "Why Is Trump Holding a Rally at Madison Square Garden?",
        "date": "2024-10-26",
        "content": "New York is not exactly a battleground state. Here are five reasons Donald J. Trump is holding a rally there in the final days of the presidential campaign."
    },
    {
        "title": "A New Business on Wall Street: Defending Against D.E.I. Backlash",
        "date": "2024-10-26",
        "content": "Companies are conducting vulnerability assessments, compiling research reports and writing plans for what to do if their diversity efforts come under attack."
    },
    {
        "title": "In Deciding Whether to Retaliate, Iran Faces a Dilemma",
        "date": "2024-10-26",
        "content": "If Iran strikes back at Israel, it risks further escalation at a time when its economy is struggling and its military is vulnerable. If it doesn’t, it risks looking weak."
    },
    {
        "title": "How Bad Do You Want It, Ladies?",
        "date": "2024-10-26",
        "content": "Donald, your insecurity is showing."
    },
    {
        "title": "Could Eminem Snap Gen X Voters Back to Reality?",
        "date": "2024-10-26",
        "content": "50-something white men and the idea of freedom"
    },
    {
        "title": "Trump Acts Erratically. Is This Age-Related Decline?",
        "date": "2024-10-26",
        "content": "If he were my dad, I’d want to take away the car keys — and nuclear codes."
    },
    {
        "title": "Democrats Finally Did What Sherrod Brown Asked For. It Might Be Too Late.",
        "date": "2024-10-26",
        "content": "Why Democrats in the Midwest are losing ground."
    },
    {
        "title": "In a Tight Election, Can the Weather Cast a Deciding Vote?",
        "date": "2024-10-26",
        "content": "It tends to play a minor role in voter turnout, affecting only close elections — like the one coming up on Nov. 5."
    },
    {
        "title": "Israel’s Strike Marks New Phase of Conflict, but Stops Short of All-Out War",
        "date": "2024-10-26",
        "content": "Iran’s initial reaction suggested that the sides had once again averted an uncontrolled war, even if the prospect looms larger than ever."
    },
    {
        "title": "John Fetterman Fears Trump Is Stronger Than Ever",
        "date": "2024-10-26",
        "content": "The senator discusses the “astonishing” support for the former president in Pennsylvania, his rift with progressives over Israel and his own position in the Democratic Party."
    },
    {
        "title": "Trump’s Gains in New York City Offer Clues to a Shifting Electoral Map",
        "date": "2024-10-26",
        "content": "A new poll adds to evidence of post-pandemic divergences and a smaller Trump edge in the Electoral College."
    },
    {
        "title": "Medicaid Is Not a Top Campaign Issue. But for These Voters, It’s Crucial.",
        "date": "2024-10-26",
        "content": "Medicaid has not been a big topic on the campaign trail, though it provides insurance for 73 million people. Still, some wonder how the program could change."
    },
    {
        "title": "They Used to Be Ahead in the American Economy. Now They’ve Fallen Behind.",
        "date": "2024-10-26",
        "content": "One economic question that really matters in an election year: Are others doing better than you?"
    },
    {
        "title": "Michelle Obama, a Reluctant Campaigner, Hits the Trail With Harris",
        "date": "2024-10-26",
        "content": "The former first lady, who is viewed warmly among some of the voters whom the Harris campaign is trying to reach, will appear alongside the vice president on Saturday in Michigan."
    },
    {
        "title": "Global Economic Leaders Confront a New Era of Industrial Policy",
        "date": "2024-10-26",
        "content": "Policymakers brace for more protectionism and the demise of “neoliberalism” if Donald J. Trump is re-elected in the U.S."
    },
    {
        "title": "Majority Want Eric Adams to Resign, Times/Siena Poll Finds",
        "date": "2024-10-26",
        "content": "Few approved of Mr. Adams’s job performance, and he trailed Andrew Cuomo and Letitia James in an early survey of potential mayoral candidates."
    },
    {
        "title": "How Donald Trump Is Making Big Promises to Big Business",
        "date": "2024-10-26",
        "content": "Crypto. Big Oil. Tobacco. Vaping. The former president has been making overt promises to industry leaders, a level of explicitness rarely seen in modern presidential politics."
    },
    {
        "title": "Jessica Tarlov Is the Liberal That Fox News Viewers Love to Hate",
        "date": "2024-10-26",
        "content": "A die-hard Democrat, she is a resident dissenter on “The Five,” the most-watched show in cable news. Does she have the hardest job on television?"
    },
    {
        "title": "A Muslim Mayor Endorses Trump, and a City of Immigrants Finds Itself Undone",
        "date": "2024-10-26",
        "content": "The endorsement has roiled Hamtramck, Mich., angering many in the Muslim community, as well as longtime residents who welcomed the newcomers."
    },
    {
        "title": "Is Harris’s Race or Gender Affecting Her Support? ‘It’s Very Complicated.’",
        "date": "2024-10-26",
        "content": "There are historical clues that pollsters and academics have been able to uncover, but it’s not a simple question to answer."
    },
    {
        "title": "Museums Around the Country Explore Democracy",
        "date": "2024-10-26",
        "content": "Inspired by the presidential election, there are exhibitions, forums and voter registrations."
    },
    {
        "title": "Inmate Labor Tests the Limits on ‘Involuntary Servitude’",
        "date": "2024-10-26",
        "content": "A work-release program for Alabama prisoners provides labor for corporations and income for the state. Lawsuits are challenging its constitutionality."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of Registered Voters in New York City",
        "date": "2024-10-26",
        "content": "Results of a New York Times/Siena College poll conducted among 853 registered voters in New York City from Oct. 20 to 23, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Likely Electorate in New York City",
        "date": "2024-10-26",
        "content": "Results of a New York Times/Siena College poll conducted among 853 likely voters in New York City from Oct. 20 to 23, 2024."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters in New York City",
        "date": "2024-10-26",
        "content": "Results of a New York Times/Siena College poll conducted among 853 registered voters in New York City from Oct. 20 to 23, 2024."
    },
    {
        "title": "Governing Party in Georgia Wins Election, as Opposition Calls for Protests",
        "date": "2024-10-26",
        "content": "The Georgian Dream party won 54 percent of the vote, the electoral commission said Sunday, a result that critics of the government fear could derail the country’s pro-Western course."
    },
    {
        "title": "Presidents, Conventions and Nazis: A Political History of ‘The Garden’",
        "date": "2024-10-26",
        "content": "Madison Square Garden, where former President Donald J. Trump will hold a rally on Sunday, has hosted many political events, some of them notorious."
    },
    {
        "title": "As U.S. Election Looms, Biden Aides Struggle With Middle East Wars",
        "date": "2024-10-26",
        "content": "Secretary of State Antony J. Blinken tried to get Prime Minister Benjamin Netanyahu of Israel to envision a U.S.-backed plan for ending the war in Gaza, but there was no sign of progress."
    },
    {
        "title": "How Tom Llamas, an NBC Anchor, Spends His Sundays",
        "date": "2024-10-26",
        "content": "Mr. Llamas, who has been racing between hurricanes and election coverage, makes time for baseball with his children and not-so-scary movies with his wife."
    },
    {
        "title": "6 Takeaways From Donald Trump’s 3-Hour Podcast With Joe Rogan",
        "date": "2024-10-26",
        "content": "The former president repeated his debunked claims of election fraud and speculated that there could be life on Mars in an interview aimed at young male voters."
    },
    {
        "title": "Beyoncé Rallies for Harris in Houston With a Message for the Battlegrounds",
        "date": "2024-10-26",
        "content": "Kamala Harris used Texas’ strict abortion ban as a cautionary tale as she sought to lay out the stakes of a deadlocked election."
    },
    {
        "title": "Beyoncé Campaigns With Harris in Texas",
        "date": "2024-10-26",
        "content": "Beyoncé and Kelly Rowland expressed support for Vice President Kamala Harris at a campaign event focused on abortion rights in Houston on Friday night."
    },
    {
        "title": "Video of Ballots Being Destroyed Was Faked by Russia, Federal Officials Say",
        "date": "2024-10-26",
        "content": "The video, which purported to show mailed-in ballots in Pennsylvania being ripped up, was part of Moscow’s efforts to influence the U.S. presidential election, the officials said."
    },
    {
        "title": "G.O.P. Lawmaker Voices Support for Giving North Carolina’s Electors to Trump",
        "date": "2024-10-26",
        "content": "Representative Andy Harris walked back his remarks, later saying his rationale that Hurricane Helene disenfranchised some voters was “theoretical.”"
    },
    {
        "title": "Your Guide to the Drama-Filled Race for Senate Control",
        "date": "2024-10-26",
        "content": "The chamber had seemed like Republicans’ to lose, but a few surprises are playing out."
    },
    {
        "title": "Trump Fumes Over Magazine Report at Rally With Slain Soldier’s Family",
        "date": "2024-10-26",
        "content": "Relatives of Specialist Vanessa Guillén, who was murdered in 2020, joined Donald J. Trump at a rally days after The Atlantic reported he had made a racist remark about her."
    },
    {
        "title": "Republican Legal Challenges to Voting Rules Hit a Rough Patch",
        "date": "2024-10-26",
        "content": "With voters already casting ballots, the two parties are still battling over the requirements for who gets to vote and which votes count."
    },
    {
        "title": "Mega-Donors Pour $8 Million Into Late Push Against N.Y. Abortion Measure",
        "date": "2024-10-25",
        "content": "Opponents of the so-called Equal Rights Amendment have cast it as a broad attempt by Democrats to grant rights to transgender athletes and migrants."
    },
    {
        "title": "How the Country’s Understanding of Abortion Could Change if Trump Wins",
        "date": "2024-10-25",
        "content": "Activists on both sides say Trump could effectively ban abortion nationwide and establish fetal personhood, the longtime goal of the anti-abortion movement."
    },
    {
        "title": "Gang Gunfire in Haiti Hits U.S. Embassy Vehicles and U.N. Aid Helicopter",
        "date": "2024-10-25",
        "content": "The attacks this week point to an escalation of violence as the situation worsens and gangs overwhelm security forces, including a multinational force."
    },
    {
        "title": "Obama Tears Into Trump in North Carolina, Which Has Eluded Democrats",
        "date": "2024-10-25",
        "content": "Barack Obama’s presence looms large in the state, which his party hasn’t won since his first presidential bid. He painted Donald Trump as a danger to the country, families and pocketbooks."
    },
    {
        "title": "Harris and Trump Hold Splashy Events Away From Swing States",
        "date": "2024-10-25",
        "content": "Also, the C.D.C. lowered the age for the pneumonia vaccine. Here’s the latest at the end of Friday."
    },
    {
        "title": "Mississippi’s Absentee Ballot Measure Violates Federal Law, Appeals Court Rules",
        "date": "2024-10-25",
        "content": "The law requires officials to count absentee ballots received by mail up to five days after Election Day. It appears unlikely that the ruling will affect the current election."
    },
    {
        "title": "What’s at Stake in the 2024 Election",
        "date": "2024-10-25",
        "content": "A 14-day series highlighting our best coverage of the most important issues in this election."
    },
    {
        "title": "Election Officials Face Torrent of Threats as Nov. 5 Looms",
        "date": "2024-10-25",
        "content": "Law enforcement’s task for Election Day this year goes far beyond providing physical security, to the essential mission of safeguarding democracy."
    },
    {
        "title": "‘The Economy, Stupid’? Not So Much Anymore.",
        "date": "2024-10-25",
        "content": "Economic factors can tell us only so much about how presidential elections will turn out."
    },
    {
        "title": "13 Ex-Trump Aides Back Kelly’s ‘Dictator’ Warning, Saying Trump Seeks ‘Absolute, Unchecked Power’",
        "date": "2024-10-25",
        "content": "In a letter, the former aides wrote, “For the good of our country, our democracy, and our Constitution, we are asking you to listen closely and carefully to General Kelly’s warning.”"
    },
    {
        "title": "In Wisconsin’s Senate Race, the Republican Highlights Baldwin’s Sexuality",
        "date": "2024-10-25",
        "content": "Eric Hovde is closing out his challenge to Senator Tammy Baldwin, a low-key Midwesterner, with a new attack ad that appears to want to make sure voters know she’s gay."
    },
    {
        "title": "Los Angeles D.A.’s Move in Menendez Case Comes Amid Tough Re-election Bid",
        "date": "2024-10-25",
        "content": "The review of the high-profile murder case by George Gascón’s office began more than a year ago. But critics say the timing of the decision was political."
    },
    {
        "title": "Middle East War Hits Home in Michigan, Threatening Slotkin in Tight Senate Race",
        "date": "2024-10-25",
        "content": "Anger among the battleground state’s sizable contingent of Arab American voters about violence in Gaza and Lebanon could hurt the Democratic congresswoman in a close contest."
    },
    {
        "title": "It’s Springsteen Season Again. Can Celebrities Give Harris a Meaningful Boost?",
        "date": "2024-10-25",
        "content": "Bruce Springsteen performed at a rally for Vice President Kamala Harris. Beyoncé will appear at an event on Friday. It is hard to say if such events actually motivate people to go to the polls."
    },
    {
        "title": "Chinese Hackers Are Said to Have Targeted Phones Used by Trump and Vance",
        "date": "2024-10-25",
        "content": "The targeting of the Republican presidential ticket’s phones is part of what appears to be a wide-ranging effort to gather information about American leaders."
    },
    {
        "title": "The Policy Record Harris Isn’t Talking About",
        "date": "2024-10-25",
        "content": "As vice president, Kamala Harris has targeted racial and gender gaps in health care, lending and other areas. She isn’t running on that part of her record."
    },
    {
        "title": "Without Another Debate, the Campaign Became a Duel of TV Scenes",
        "date": "2024-10-25",
        "content": "As the candidates raced to claim different corners of the national screen this week, it was “Undercover Boss” vs. “Roll the clip.”"
    },
    {
        "title": "New ‘RBG PAC’ Spending $19 Million From Secret Donors to Aid Trump on Abortion",
        "date": "2024-10-25",
        "content": "A Republican super PAC is running ads invoking the name of Ruth Bader Ginsburg to help Donald Trump win voters who favor abortion rights. Her family denounced the effort as “nothing short of appalling.”"
    },
    {
        "title": "Washington Post Says It Will Stop Endorsing Presidential Candidates",
        "date": "2024-10-25",
        "content": "The decision was made by Jeff Bezos, the paper’s owner, according to a person with knowledge of the talks. Will Lewis, the chief executive, said the paper was “returning to our roots” of not making endorsements for the office."
    },
    {
        "title": "The One Benefit of Harris Winning While Losing the Popular Vote",
        "date": "2024-10-25",
        "content": "It might be a first step toward ending a hugely undemocratic institution."
    },
    {
        "title": "Kelly’s Comments About Trump, Fascism and Hitler",
        "date": "2024-10-25",
        "content": "Responses to the former Trump chief of staff’s comments. Also: Election disinformation; a voter paradox; Harris donations; biodiversity; pandas."
    },
    {
        "title": "Late Lawsuit Could Shape Political Ad Wars in Final Days of Campaign",
        "date": "2024-10-25",
        "content": "House Democrats are suing to stop Republicans from using a legal loophole to bolster their Senate candidates."
    },
    {
        "title": "Election 2024 Polls: New Hampshire",
        "date": "2024-10-25",
        "content": "See the latest election polls and polling averages for New Hampshire."
    },
    {
        "title": "Election 2024 Polls: New York",
        "date": "2024-10-25",
        "content": "See the latest election polls and polling averages for New York."
    },
    {
        "title": "Election 2024 Polls: Nebraska C.D. 2",
        "date": "2024-10-25",
        "content": "See the latest election polls and polling averages for Nebraska C.D. 2."
    },
    {
        "title": "Election 2024 Polls: Maine C.D. 2",
        "date": "2024-10-25",
        "content": "See the latest election polls and polling averages for Maine C.D. 2."
    },
    {
        "title": "DeSantis Is Going All Out to Defeat Florida’s Abortion Ballot Question",
        "date": "2024-10-25",
        "content": "Gov. Ron DeSantis, who signed a strict abortion ban, has become the face of a campaign against the referendum, which would allow abortions “before viability.”"
    },
    {
        "title": "The Elon-ction + Can A.I. Be Blamed for a Teen’s Suicide?",
        "date": "2024-10-25",
        "content": "The 2024 election has a new main character."
    },
    {
        "title": "Poll Shows Dead Heat, and Biden to Apologize for Native American School Abuses",
        "date": "2024-10-25",
        "content": "Plus, a World Series with baseball’s biggest stars."
    },
    {
        "title": "The United States of Pennsylvania",
        "date": "2024-10-25",
        "content": "Kamala Harris and Donald Trump are pouring more money, time and energy into the state than anywhere else."
    },
    {
        "title": "Could Trump Win the Popular Vote but Lose the Electoral College?",
        "date": "2024-10-25",
        "content": "It’s not likely, but it’s not something that can be dismissed either, recent polling suggests."
    },
    {
        "title": "Why Harris (With Beyoncé in Tow) Is Heading to Solidly Red Texas",
        "date": "2024-10-25",
        "content": "Appearing alongside a pop superstar and talking about abortion rights in a state with a strict ban, the vice president is hoping to deliver viral moments that will resound in faraway battlegrounds."
    },
    {
        "title": "The ‘Greenest Governor’ Fights to Save a Landmark Climate Law",
        "date": "2024-10-25",
        "content": "Environmentalists and one of the world’s biggest oil companies support Washington State’s cap on carbon. But voters are deciding whether to repeal the law amid concerns about energy costs."
    },
    {
        "title": "Republicans Assumed a Nebraska Senate Seat Was Safe. Then This Candidate Came Along.",
        "date": "2024-10-25",
        "content": "Nebraska’s Senate race is far closer than anyone predicted."
    },
    {
        "title": "Harris and Trump Deadlocked to the End, Final Times/Siena National Poll Finds",
        "date": "2024-10-25",
        "content": "The electorate has rarely seemed so evenly divided. The latest New York Times/Siena College poll found Harris and Trump tied 48 to 48."
    },
    {
        "title": "Don Jr. Is Making Plans",
        "date": "2024-10-25",
        "content": "Of all the figures who surround Donald Trump, his eldest son may offer the best window into the future of the MAGA movement."
    },
    {
        "title": "7 New Movies Our Critics Are Talking About This Week",
        "date": "2024-10-25",
        "content": "Whether you’re a casual moviegoer or an avid buff, our reviewers think these films are worth knowing about."
    },
    {
        "title": "Biden Has a Crucial Decision to Make on Ukraine",
        "date": "2024-10-25",
        "content": "If he gives Ukraine the capability of striking deep into Russian territory, that decision would be hard for a new president to undo."
    },
    {
        "title": "Beyond Trump vs. Harris: These Races Will Shape Our Future",
        "date": "2024-10-25",
        "content": "About those other Election Day matchups …"
    },
    {
        "title": "How the Storm Shook Up North Carolina’s Election",
        "date": "2024-10-25",
        "content": "Astead W. Herndon, a national reporter for The New York Times and the host of the politics podcast “The Run-Up,” traveled to North Carolina to see how Hurricane Helene and the misinformation in its wake have reshaped the election landscape in this..."
    },
    {
        "title": "Betting Markets Favor Trump. But Their Record of Accuracy Is Mixed.",
        "date": "2024-10-25",
        "content": "Proponents believe that having real money on the line, and a large crowd of investors, encourages a more accurate election forecast than polling data can provide."
    },
    {
        "title": "Maggie Haberman on What an Unleashed Trump Might Do",
        "date": "2024-10-25",
        "content": "The New York Times political correspondent discusses Donald Trump’s past, present and possible future."
    },
    {
        "title": "U.S. Bond Market Braces for the ‘Trump Trade’ of Large Tariffs and Deficits",
        "date": "2024-10-25",
        "content": "As investors have focused on the potential fiscal and economic impact of the Republican candidate’s proposals, yields on Treasury debt have risen."
    },
    {
        "title": "The Army of Election Officials Ready to Reject the Vote",
        "date": "2024-10-25",
        "content": "A movement driven by disinformation about Trump’s 2020 defeat has taken over many of the boards that certify elections. It could cause chaos in the weeks ahead."
    },
    {
        "title": "The Guardrails Failed. Now It’s Down to Us.",
        "date": "2024-10-25",
        "content": "Trump’s great accomplishment is to spread the dangerous lie that our problems can be blamed on the weakest and most vulnerable in our midst."
    },
    {
        "title": "As Georgia Decides Its Future, Artists Are Worried About Theirs",
        "date": "2024-10-25",
        "content": "Two new laws, and a looming election, in the former Soviet republic of Georgia have artists reconsidering their livelihoods and even whether they can stay in the country."
    },
    {
        "title": "Toplines: Late October 2024 Times/Siena Poll of Registered Voters Nationwide",
        "date": "2024-10-25",
        "content": "Results of a nationwide New York Times/Siena College poll of 2,516 registered voters conducted from Oct. 20 to 23, 2024."
    },
    {
        "title": "Cross-Tabs: Late October 2024 Times/Siena Poll of the Likely Electorate",
        "date": "2024-10-25",
        "content": "Results of a nationwide New York Times/Siena College poll of 2,516 likely voters conducted from Oct. 20 to 23, 2024."
    },
    {
        "title": "Trump Is Telling Us What He Would Do. Believe Him.",
        "date": "2024-10-25",
        "content": "The former president’s most disturbing statements are not bluster. They are a road map to what he will do if elected again."
    },
    {
        "title": "New York’s 6 Pivotal House Races: Here’s What to Know",
        "date": "2024-10-25",
        "content": "Six House seats, including five held by Republicans, may be the key in determining which party will control the chamber for the next two years."
    },
    {
        "title": "Kamala Harris Needs Young Voters. Her Envoy: Alexandria Ocasio-Cortez.",
        "date": "2024-10-25",
        "content": "The New York congresswoman’s foray onto the presidential campaign trail may be a turning point for her and her party."
    },
    {
        "title": "Twenty Election Cycles and Counting",
        "date": "2024-10-25",
        "content": "Carl Hulse has covered congressional campaigns for four decades. Much has changed, but one thing remains constant: Journalists must be ready for the unexpected."
    },
    {
        "title": "At Las Vegas Rally, Trump Grumbles About Obama’s Nobel Prize",
        "date": "2024-10-25",
        "content": "With 12 days until Election Day, former President Donald J. Trump campaigned in Nevada and Arizona and sharpened his attacks on Vice President Kamala Harris about immigration."
    },
    {
        "title": "Harris, Trump and Allies Spend Over a Half-Billion Dollars in 16 Days",
        "date": "2024-10-25",
        "content": "Donald Trump has now raised $1 billion since announcing his run for president. And he has Elon Musk’s $119 million. But Kamala Harris has a huge cash advantage."
    },
    {
        "title": "Tyler Perry Blasts Trump in Passionate Speech at Harris’s Atlanta Rally",
        "date": "2024-10-25",
        "content": "The actor and filmmaker, who built his career in the Georgia capital, said he had realized that in the former president’s America, “there is no dream that looks like me.”"
    },
    {
        "title": "Obama Rallies With Harris for First Time, to the Chords of Bruce Springsteen",
        "date": "2024-10-25",
        "content": "At a star-filled rally in Georgia that also featured Tyler Perry and Samuel L. Jackson, the former president tried to give a jolt of energy to the vice president often seen as a successor."
    },
    {
        "title": "At a Town Hall in Detroit, Trump Asks Vance: ‘How Brilliant Is Donald Trump?’",
        "date": "2024-10-25",
        "content": "Former President Donald J. Trump phoned in during a televised town hall with voters, surprising his running mate."
    },
    {
        "title": "Two Brothers Charged With Assaulting Officers in Jan. 6 Riot",
        "date": "2024-10-25",
        "content": "Roger and Reynold Voisine, from upstate New York, used weapons that included a pipe, a police shield and a table leg studded with nails, prosecutors said."
    },
    {
        "title": "Miriam Adelson Goes Searching for More Trump Donors",
        "date": "2024-10-25",
        "content": "After financing a super PAC with $100 million of her own money, she is asking other billionaires to help keep the group funded through Election Day."
    },
    {
        "title": "Harris Campaign Uses John Kelly’s Words in Stark New Ads",
        "date": "2024-10-25",
        "content": "The ads are the latest attempt by Kamala Harris’s campaign to turn the 2024 race into a referendum on Donald Trump."
    },
    {
        "title": "Will It All Come Down to Michigan?",
        "date": "2024-10-24",
        "content": "Operatives from both parties see the race as deadlocked, and both insist they have a clearer path."
    },
    {
        "title": "Biden to Apologize for Indian Boarding Schools Where Hundreds of Children Died",
        "date": "2024-10-24",
        "content": "President Biden’s trip to the battleground state of Arizona will be the first time an American president has apologized for the abuses that happened at the schools over a period of 150 years."
    },
    {
        "title": "The Election Is Happening Too Soon",
        "date": "2024-10-24",
        "content": "When we all think we’re right, we stay perennially stuck in place."
    },
    {
        "title": "How Trump Could Bankrupt Social Security",
        "date": "2024-10-24",
        "content": "Retirement benefits for millions of Americans are on the line."
    },
    {
        "title": "Trump Seeks to Challenge Jack Smith’s Appointment in Election Case",
        "date": "2024-10-24",
        "content": "The former president’s request to file a new motion contesting how the special counsel got his job came on the same day he vowed to fire him if re-elected."
    },
    {
        "title": "As Election Day Nears, Democrats Test Just How Powerful Abortion Really Is",
        "date": "2024-10-24",
        "content": "They hope the issue helps their candidates. But some voters may support Republican candidates as well as abortion-rights ballot measures."
    },
    {
        "title": "The Menendez Brothers May Soon Be Free: The True Crime Boom and Changing Attitudes",
        "date": "2024-10-24",
        "content": "A thriving genre built on podcasts and documentaries, coupled with younger generations’ more skeptical worldview, helped revitalize interest in this case and others like it."
    },
    {
        "title": "Friday Briefing: Stars Rally for Harris",
        "date": "2024-10-24",
        "content": "Plus, an interview with the Taliban’s most fearsome leader."
    },
    {
        "title": "Asheville Has Tap Water, but No One Knows When It Will Be Drinkable",
        "date": "2024-10-24",
        "content": "People in the storm-hit area can resume flushing toilets and taking showers, but the water is often yellow or brown. Officials are asking for patience with repair efforts."
    },
    {
        "title": "Mailbox Arson Damages Ballots in Phoenix",
        "date": "2024-10-24",
        "content": "Arizona’s secretary of state said affected voters would be contacted to make sure they could get a new ballot."
    },
    {
        "title": "A Hurricane During Election Week? Don’t Worry Just Yet.",
        "date": "2024-10-24",
        "content": "Maps spreading on social media show a storm hitting the United States the week of the election. But a lot more goes into a forecast than just one model run."
    },
    {
        "title": "Sam Brown, G.O.P. Senate Candidate in Nevada, Gets Late Support From His Party",
        "date": "2024-10-24",
        "content": "A Republican group supporting Senate races says it will spend $6.2 million on TV, radio and digital ads beginning this weekend."
    },
    {
        "title": "With the Clock Ticking, Should Harris Define Herself or Her Opponent?",
        "date": "2024-10-24",
        "content": "At a CNN town-hall meeting, Kamala Harris seemed more comfortable warning about the dangers of Donald J. Trump than describing her policies or continuing to introduce herself."
    },
    {
        "title": "In Georgia, Harris’s Muslim Backers Push Her as Better Than the Alternative",
        "date": "2024-10-24",
        "content": "The Mideast war is threatening Vice President Kamala Harris’s support among Muslim and Arab American voters, a traditionally Democratic constituency, in critical swing states."
    },
    {
        "title": "In High-Stakes Pennsylvania, Local Officials Have a Big Hand in Voting Rules",
        "date": "2024-10-24",
        "content": "Since 2019, every Pennsylvanian has had a vote-by-mail option. But policies on drop boxes and mail-in ballot errors can vary across the state’s 67 counties."
    },
    {
        "title": "The Group at the Center of Trump’s Planning for a Second Term Is One You Haven’t Heard of",
        "date": "2024-10-24",
        "content": "America First Policy Institute didn’t even exist four years ago. But it is poised to be more influential than Project 2025."
    },
    {
        "title": "Tucker Carlson Tells Crowd Trump Will Give Country a ‘Spanking’",
        "date": "2024-10-24",
        "content": "The former Fox News host used a bizarre extended metaphor at a rally in Georgia where Donald J. Trump spoke."
    },
    {
        "title": "As Election Looms, Justice Dept. Tries to Steer Clear of Politics",
        "date": "2024-10-24",
        "content": "A department memo seeks to formalize a pre-election “quiet period” in which senior officials should avoid unnecessary high-profile moves."
    },
    {
        "title": "Trump Says He’ll Fire Jack Smith, Special Counsel Who Indicted Him, if He Wins Again",
        "date": "2024-10-24",
        "content": "The former president’s remarks to a conservative radio host were his most pointed about the special counsel, Jack Smith, if he returns to the White House."
    },
    {
        "title": "District Attorney Will Ask Court to Resentence Menendez Brothers",
        "date": "2024-10-24",
        "content": "The request from George Gascón, the Los Angeles County district attorney, could lead to Lyle and Erik Menendez being released from prison, decades after they were convicted of murdering their parents."
    },
    {
        "title": "Putin Appears to Say That North Korean Troops Are in Russia",
        "date": "2024-10-24",
        "content": "“If there are images they are a reflection of something,” he said in a tongue-in-cheek answer to whether Pyongyang had sent troops to help with Russia’s war in Ukraine."
    },
    {
        "title": "Oy, This Ad: Jewish Stereotypes in Service of Trump as a Safer Option",
        "date": "2024-10-24",
        "content": "A new commercial from the Republican Jewish Coalition tries to give Jewish voters a rationale for voting for the former president, based on fear."
    },
    {
        "title": "In This Biography, Mitch McConnell Hates Trump but Loves Power More",
        "date": "2024-10-24",
        "content": "“The Price of Power,” by Michael Tackett, reveals a legislator for whom political survival has been a top priority — even when it means supporting a “sleazeball” for the presidency."
    },
    {
        "title": "As Harris Courts Republicans, the Left Grows Wary and Alienated",
        "date": "2024-10-24",
        "content": "The vice president’s tack to the right, support for Israel in the Gaza war and incremental policy proposals have alienated progressives and raised worries about waning liberal energy."
    },
    {
        "title": "Beyoncé Will Appear With Kamala Harris at Houston Rally",
        "date": "2024-10-24",
        "content": "The pop superstar, whose song “Freedom” is already used by the Democratic nominee at her rallies, will appear with Ms. Harris at a Friday event focused on abortion rights."
    },
    {
        "title": "Trump Flirts With the Ultimate Tax Cut: No Income Taxes at All",
        "date": "2024-10-24",
        "content": "The former president has repeatedly praised a period in American history when there was no income tax, and the country relied on tariffs to fund the government."
    },
    {
        "title": "Why Democracy Lives and Dies by Math",
        "date": "2024-10-24",
        "content": "A documentary filmmaker and a mathematician discuss our fear of numbers and its civic costs."
    },
    {
        "title": "Read the Letter from Nobel Laureates Endorsing Kamala Harris for President",
        "date": "2024-10-24",
        "content": "More than 80 American Nobel Prize winners in physics, chemistry, medicine and economics have signed an open letter endorsing Vice President Kamala Harris for president."
    },
    {
        "title": "The French Connection to Online Bets on Trump",
        "date": "2024-10-24",
        "content": "Polymarket said that it had linked a single trader to accounts that have wagered heavily on the Republican to win, pushing up his odds on the prediction market."
    },
    {
        "title": "Pope Francis, in New Letter, Urges Catholics to Reject Individualism",
        "date": "2024-10-24",
        "content": "In an encyclical titled “He Loved Us,” Francis draws on spiritual themes in the hopes of helping people find deeper meaning while living in today’s hectic societies."
    },
    {
        "title": "Fred Upton, Former G.O.P. Congressman Who Voted to Impeach Trump, Endorses Harris",
        "date": "2024-10-24",
        "content": "The veteran Michigan Republican called the former president “unfit to serve,” and said Vice President Kamala Harris would work to bring people together."
    },
    {
        "title": "12 Days to Go: French Fries and Fascism",
        "date": "2024-10-24",
        "content": "Michael Barbaro sits down with the Times reporters Michael Schmidt, Lisa Lerer, Reid Epstein and Nate Cohn to discuss the latest developments in the presidential race."
    },
    {
        "title": "12 Days to Go: French Fries and Fascism",
        "date": "2024-10-24",
        "content": "Watch or listen to our political round table."
    },
    {
        "title": "Harris Calls Trump a Fascist, and North Korea Has Sent Troops to Russia",
        "date": "2024-10-24",
        "content": "Plus, American Airlines cracks down on “gate lice.”"
    },
    {
        "title": "12 Days to Go: French Fries and Fascism",
        "date": "2024-10-24",
        "content": "We break down the latest developments in the presidential race, including the warning from John Kelly, Donald Trump’s longest-serving chief of staff, that the former president met the definition of a fascist, and Kamala Harris’s final plea that Tr..."
    },
    {
        "title": "Harris Drops the F-Bomb on CNN’s Town Hall",
        "date": "2024-10-24",
        "content": "But name-calling is less powerful than truth-telling."
    },
    {
        "title": "Trump’s Election Reversal Dreams Are Dead",
        "date": "2024-10-24",
        "content": "At least as far as the law goes."
    },
    {
        "title": "Elon Musk Plots His Final Moves for Trump",
        "date": "2024-10-24",
        "content": "With less than two weeks until Election Day, the richest person in the world is throwing himself into the effort to elect the former president."
    },
    {
        "title": "There Are Four Anti-Trump Pathways We Failed to Take. There Is a Fifth.",
        "date": "2024-10-24",
        "content": "Why have so many of our democracy’s defenses seemingly broken down, and which, if any, remain?"
    },
    {
        "title": "Short on Time, Harris’s Labor Allies Sprint to Reach Working-Class Voters",
        "date": "2024-10-24",
        "content": "Unions and their affiliates think they can still break through with the Democrats’ worst demographic, white working-class voters, by hustling on the ground. But it has been a slog."
    },
    {
        "title": "‘They Would Never Be Doing This Under Trump’: Two G.O.P. Foreign Policy Experts on What a Second Term Would Mean for the World",
        "date": "2024-10-24",
        "content": "Two veterans of Trump’s term look ahead to a potential second term and what it would mean for the world."
    },
    {
        "title": "Abortion Is at the Center of Ohio’s Senate Race as Brown Battles for Survival",
        "date": "2024-10-24",
        "content": "Senator Sherrod Brown has spent his decades in Congress establishing a track record as a populist champion on economic issues. But in the closing days of his re-election race, abortion has become a key emphasis."
    },
    {
        "title": "It Really Does Feel Close in North Carolina",
        "date": "2024-10-24",
        "content": "Democrats hope demographic changes bring them success. Republicans hope Hurricane Helene didn’t ruin all their plans."
    },
    {
        "title": "The White House Bet Big on Intel. Will It Backfire?",
        "date": "2024-10-24",
        "content": "A plan to revive U.S. chip manufacturing rests partly on a company that is firing workers and delaying factories, even as the government pushes for the opposite."
    },
    {
        "title": "The Sisters Behind ‘Nobody Wants This’ Are in High Demand",
        "date": "2024-10-24",
        "content": "Sara and Erin Foster took a short break to discuss the hit show loosely based on Erin’s life, everyone’s love of Adam Brody and their advocacy for reproductive rights."
    },
    {
        "title": "It’s His First Vote for President. He’s Torn. And It’s Crunch Time.",
        "date": "2024-10-24",
        "content": "Miguel Gomez, 21, leans Trump. His parents very much don’t. Their home is a miniature battleground, reflecting the fierce divides among Latino voters in Arizona."
    },
    {
        "title": "It’s the Inflation, Stupid: Why the Working Class Wants Trump Back",
        "date": "2024-10-24",
        "content": "Inflation is driving working-class voters of all ethnicities to Trump."
    },
    {
        "title": "5 Books to Read About Policing Before You Vote",
        "date": "2024-10-24",
        "content": "Memoirists and scholars explore the issue at every level, from the origins of the war on crime to what comes after “broken windows.”"
    },
    {
        "title": "Documenting the Stories of Migrants Detained at the Border",
        "date": "2024-10-24",
        "content": "While working as a janitor at a U.S. customs station in Arizona, the artist Tom Kiefer photographed confiscated items, from rosary beads to wallets to love letters."
    },
    {
        "title": "Late Night Condemns Trump for Stanning Hitler",
        "date": "2024-10-24",
        "content": "On Wednesday, Seth Meyers said he was “starting to think Trump doesn’t watch the ends of documentaries.”"
    },
    {
        "title": "What Happened When a Barber Told Trump About His $15,000 Electric Bill",
        "date": "2024-10-24",
        "content": "During the campaign stop, a barber made a complaint about his utility bill that was soon distorted online."
    },
    {
        "title": "Democrats’ Best Shot at Flipping a House Seat Is in Upstate New York",
        "date": "2024-10-24",
        "content": "After redistricting, Representative Brandon Williams of New York is the only House Republican whose race is considered “lean Democrat.”"
    },
    {
        "title": "Thursday Briefing: How Europe Sees the U.S. Election",
        "date": "2024-10-24",
        "content": "Plus, the dark side of A.I. companionship apps."
    },
    {
        "title": "Trump Calls Out Biden Remark on ‘Lock Him Up’",
        "date": "2024-10-24",
        "content": "While President Biden quickly said he was referring to his predecessor’s politics and not to jail time, Donald Trump said it was proof of his unfounded claim the president is behind his criminal cases."
    },
    {
        "title": "Harris Calls Trump a Fascist: 6 Takeaways From Her CNN Town Hall",
        "date": "2024-10-24",
        "content": "Entering new rhetorical territory, the vice president turned even unrelated questions into attacks on Donald Trump as she offered long, winding answers to questions from voters."
    },
    {
        "title": "A Wisconsin Mayor, a Former Republican, Endorses Harris",
        "date": "2024-10-24",
        "content": "Shawn Reilly, the mayor of Waukesha, Wis., said he had never thrown his support behind a Democrat before."
    },
    {
        "title": "Can Donald Trump or Kamala Harris Bring Back Manufacturing Jobs?",
        "date": "2024-10-24",
        "content": "Both candidates tout plans that promise to help the country make things again. Canton, Ohio, is an example of the steep challenge."
    },
    {
        "title": "Man Is Arrested After Shootings at Democratic Campaign Office in Arizona",
        "date": "2024-10-24",
        "content": "The authorities said they believed the suspect was “preparing to commit an act of mass casualty.”"
    },
    {
        "title": "Georgia Secretary of State Fends Off Cyberattack Targeting Absentee Ballot Website",
        "date": "2024-10-24",
        "content": "The attack may have come from a foreign country, said a Georgia official."
    },
    {
        "title": "Pennsylvania Supreme Court Allows Provisional Votes After Mail Ballot Rejections",
        "date": "2024-10-24",
        "content": "The decision is likely to affect thousands of mail-in ballots among the millions that will be cast in Pennsylvania, a pivotal 2024 swing state."
    },
    {
        "title": "L.A. Times Editorial Chief Quits After Owner Blocks Harris Endorsement",
        "date": "2024-10-23",
        "content": "Mariel Garza said the editorial board was prepared to endorse Kamala Harris, but the paper’s owner, Patrick Soon-Shiong, decided not to make an endorsement in the presidential race."
    },
    {
        "title": "How the 2024 Election Became a Battle Fought by Podcast",
        "date": "2024-10-23",
        "content": "Harris and Trump turn to digital venues with niche audiences to sway tiny slivers of the electorate."
    },
    {
        "title": "Harris Will Offer Closing Argument at Ellipse in Washington",
        "date": "2024-10-23",
        "content": "The vice president will give a speech on Tuesday at the Ellipse, the park near the White House where Donald Trump encouraged supporters to march on the Capitol on Jan. 6, 2021."
    },
    {
        "title": "Harris Sharpens her Message on Trump",
        "date": "2024-10-23",
        "content": "Also, the U.S. said North Korea sent troops to aid Russia. Here’s the latest at the end of Wednesday."
    },
    {
        "title": "A Pro-Harris Ad Aims to Woo Trump-Weary Republicans",
        "date": "2024-10-23",
        "content": "A new commercial from the biggest super PAC in American politics makes a pitch for Republicans in Arizona and North Carolina."
    },
    {
        "title": "Teens, What Do You Expect From the 2024 Election?",
        "date": "2024-10-23",
        "content": "The Headway Election Challenge looks to the future, asking teens about their expectations for voter turnout and election results."
    },
    {
        "title": "Does Social Media Mean Teens Are Getting Heard? Sort of.",
        "date": "2024-10-23",
        "content": "Teen respondents to the Headway Election Challenge said being represented in politics goes beyond identity — it’s rooted in the issues that affect their lives."
    },
    {
        "title": "Thursday Briefing: How the U.S. Election is Viewed Abroad",
        "date": "2024-10-23",
        "content": "Plus, the dark side of A.I. companionship apps."
    },
    {
        "title": "Man Charged in Attempted Trump Assassination Seeks Judge’s Recusal",
        "date": "2024-10-23",
        "content": "Lawyers for Ryan Routh want Judge Aileen Cannon to remove herself from the case after a report that her name was among those who could be appointed to a top legal position if Donald Trump is elected."
    },
    {
        "title": "This Election Is Also a Choice Between Two Visions of the Federal Courts",
        "date": "2024-10-23",
        "content": "Judges have vast influence over the biggest political questions. An analysis of President Biden and Donald J. Trump’s nominees found stark differences that could emerge again after November."
    },
    {
        "title": "Bots Linked to China Target Republican House and Senate Candidates, Microsoft Says",
        "date": "2024-10-23",
        "content": "Chinese influence operations have focused less on this year’s presidential race and more on down-ballot races."
    },
    {
        "title": "Justice Department Warns Musk That His $1 Million Giveaway Might Be Illegal",
        "date": "2024-10-23",
        "content": "Elon Musk’s super PAC, which supports Donald Trump’s presidential bid, is giving cash prizes to registered voters who sign a petition."
    },
    {
        "title": "Harris Says Trump Wants ‘Unchecked Power’",
        "date": "2024-10-23",
        "content": "Vice President Kamala Harris, citing a New York Times interview with John Kelly, a former White House chief of staff, called former President Donald J. Trump “increasingly unhinged” in his pursuit for a second term in office."
    },
    {
        "title": "Trump’s Allies Revive Debunked Voting Machine Theories",
        "date": "2024-10-23",
        "content": "The former president and his closest allies are returning to false claims about hacked machines as they prepare to contest the vote next month."
    },
    {
        "title": "Why Harris and Trump Are Pandering to Crypto Plutocrats",
        "date": "2024-10-23",
        "content": "Crypto corporations have increased their election spending tenfold from the last cycle."
    },
    {
        "title": "No, a Voting Machine Did Not ‘Flip’ a Vote in Georgia",
        "date": "2024-10-23",
        "content": "One voter’s mistake has been transformed into a voter fraud conspiracy theory, catapulted into the national spotlight by Representative Marjorie Taylor Greene."
    },
    {
        "title": "Nervous? Maybe This Pre-Election Quiz Will Calm You Down.",
        "date": "2024-10-23",
        "content": "Time for your pre-election quiz."
    },
    {
        "title": "Harris Calls Trump’s Reported Remarks on Hitler and Nazis ‘Deeply Troubling’",
        "date": "2024-10-23",
        "content": "The vice president seized on reports in which John Kelly, a former chief of staff to Donald J. Trump, recounted explosive comments by Mr. Trump and said he met the definition of a “fascist.”"
    },
    {
        "title": "Send in the Juggalos: Harris Gets a Little Help From Insane Clown Posse",
        "date": "2024-10-23",
        "content": "Endorsements, how do they work?"
    },
    {
        "title": "A Sleeper Senate Race Tightens in Nebraska as an Independent Gains",
        "date": "2024-10-23",
        "content": "Dan Osborn, a labor leader and mechanic who is running as an independent, is making Republicans sweat with his dark horse bid to oust Senator Deb Fischer. Can he turn the buzz into votes?"
    },
    {
        "title": "Why a Harris Victory Isn’t a Sure Thing",
        "date": "2024-10-23",
        "content": "Responses to two columns by David Brooks. Also: Donald Trump’s disjointed speeches; an inmate with autism; the Eric Adams mess; mistreatment of women."
    },
    {
        "title": "G7 Finalizes $50 Billion Ukraine Loan Backed by Russian Assets",
        "date": "2024-10-23",
        "content": "The economic lifeline is expected to be disbursed by the end of the year."
    },
    {
        "title": "In a Tight Presidential Race, Omaha Is Basking in Its Political Relevance",
        "date": "2024-10-23",
        "content": "Reliably conservative Nebraska is one of just two states that splits its Electoral College votes. That’s why its one small “blue dot” could make a difference to Vice President Kamala Harris’s campaign."
    },
    {
        "title": "These Places Have Democracy Watchdogs Bracing for Potential Election Discord",
        "date": "2024-10-23",
        "content": "Some counties have a history of refusing to certify election results. Others have tried to disqualify voters or prevent them from casting absentee ballots."
    },
    {
        "title": "What Have You Seen Online Lately That Could Use Some Fact-Checking?",
        "date": "2024-10-23",
        "content": "This Media Literacy Week, we challenge you to choose a news item that interests you — whether in politics, sports, entertainment or any other category — and find out how accurate it is."
    },
    {
        "title": "Teenagers Tell Us About Their Relationship With News",
        "date": "2024-10-23",
        "content": "Nearly 400 students wrote about where they get it, how they navigate it — and why they think adults are more likely to fall for misinformation than they are."
    },
    {
        "title": "Trump Accuses U.K. Party of Election Meddling, Despite Links to Its Rivals",
        "date": "2024-10-23",
        "content": "Donald Trump’s campaign said Britain’s governing Labour Party had engaged in “blatant foreign interference.” Other British politicians have previously acted in support of Mr. Trump."
    },
    {
        "title": "Blinken Renews Push for Middle East Truce, and U.S. Abortions Increase",
        "date": "2024-10-23",
        "content": "Plus, a radical approach to flooding in England."
    },
    {
        "title": "As Election Looms, Disinformation ‘Has Never Been Worse’",
        "date": "2024-10-23",
        "content": "A torrent of falsehoods, from home and abroad, have undermined what was once a shared faith in the honesty of America’s democracy."
    },
    {
        "title": "Why Gender May Be the Defining Issue of the Election",
        "date": "2024-10-23",
        "content": "The issue is rarely directly addressed by either Vice President Kamala Harris or Donald Trump. But the 2024 contest is, in ways overt and subtle, a referendum on the role of women in American life."
    },
    {
        "title": "Democrats Keep the Dream Alive in Texas",
        "date": "2024-10-23",
        "content": "A tightening in the polls for the Senate race, and millions from George Soros, has rekindled old hopes of turning Texas blue. But demographic changes alone may not be enough to flip the state, party organizers say."
    },
    {
        "title": "America Is Playing With Fire",
        "date": "2024-10-23",
        "content": "It’s both frightening and disturbing to think that American voters could once again make someone as unhinged and unbridled as Donald Trump the president."
    },
    {
        "title": "What Washing Machines Can Tell Us About America’s Economic Future",
        "date": "2024-10-23",
        "content": "One set of writers on the left and another on the right lay out competing visions for what the next president should do."
    },
    {
        "title": "Nate Silver: Here’s What My Gut Says About the Election, but Don’t Trust Anyone’s Gut, Even Mine",
        "date": "2024-10-23",
        "content": "A 50-50 forecast really does mean 50-50. And you should be open to the possibility that those forecasts are wrong."
    },
    {
        "title": "What an Encounter With a Flight Attendant Showed Me About the Life I Wanted",
        "date": "2024-10-23",
        "content": "Everything that challenges the status quo shakes our idea of normal."
    },
    {
        "title": "Is It Fascism? A Leading Historian Changes His Mind.",
        "date": "2024-10-23",
        "content": "Robert Paxton thought the label was overused. But now he’s alarmed by what he sees in global politics — including Trumpism."
    },
    {
        "title": "United by Love, Divided by Politics",
        "date": "2024-10-23",
        "content": "For some politically opposed couples, the election can’t end soon enough."
    },
    {
        "title": "5 Books to Help You Understand the Immigration Debate",
        "date": "2024-10-23",
        "content": "Journalists and scholars explore the issue at every level, from the legacy of Cold War coups to the vulnerable lives caught up in a tangled system."
    },
    {
        "title": "New Jersey House Race Narrows in Final Days",
        "date": "2024-10-23",
        "content": "The campaign of the Democratic challenger, Sue Altman, has received a $4 million infusion after polls showed her closing in on the Republican incumbent, Thomas Kean Jr."
    },
    {
        "title": "Michael Kosta Thinks He’s Found Elon Musk’s Next Failed Purchase",
        "date": "2024-10-23",
        "content": "The “Daily Show” host said Musk “bought Twitter just to drive it into the ground” and is now considering doing the same for America."
    },
    {
        "title": "This Country Turned Against the West, and It’s Not Coming Back",
        "date": "2024-10-23",
        "content": "The romance between Georgia and the West is on the rocks."
    },
    {
        "title": "Stuffed Into Trucks, 78 Thai Protesters Died. Their Killers Are Still Free.",
        "date": "2024-10-23",
        "content": "Twenty years ago, a massacre in southern Thailand fueled an insurgency that has never stopped. If no one is prosecuted for it by Friday, no one ever will be."
    },
    {
        "title": "Trump’s Attacks Again Turn Nasty in Campaign’s Waning Days",
        "date": "2024-10-23",
        "content": "Donald Trump is escalating his attacks against Kamala Harris, turning more personal and derogatory, a pattern from his campaigns in 2016 and 2020."
    },
    {
        "title": "What if Trump Deported Millions of immigrants?",
        "date": "2024-10-23",
        "content": "In Bentonville, Ark., the fast-growing economy depends on immigrant labor."
    },
    {
        "title": "Yelp Disables Comments for McDonald’s Where Trump Donned Apron",
        "date": "2024-10-23",
        "content": "The consumer review site temporarily disabled comments on the franchise’s page after the former president’s appearance prompted a flurry of reviews."
    },
    {
        "title": "Walz Rallies Supporters on Wisconsin’s First Day of Voting, Alongside Obama",
        "date": "2024-10-23",
        "content": "The two men railed against Donald Trump and urged voters to return their ballots early, as polls show a close race in the state."
    },
    {
        "title": "5 Takeaways From Harris’s Interview With NBC News",
        "date": "2024-10-23",
        "content": "The vice president parried persistent questioning on how she might separate herself from President Biden, whether she might pardon Donald Trump and where she stood on transgender rights."
    },
    {
        "title": "Biden Quickly Backtracks After Saying Trump Should Be Locked Up",
        "date": "2024-10-23",
        "content": "The president appeared to slip by suggesting he wanted his predecessor put behind bars, but revised his comment to say he meant locked up “politically.”"
    },
    {
        "title": "Could Polish American Voters Swing the Election?",
        "date": "2024-10-22",
        "content": "Voters with Eastern European backgrounds could be crucial in Pennsylvania, Michigan and Wisconsin."
    },
    {
        "title": "Biden Mocks Trump’s ‘Concept of a Plan’ to Replace Obamacare",
        "date": "2024-10-22",
        "content": "During a visit to New Hampshire to discuss the cost of prescription drugs, President Biden warned that a second Trump presidency could lead millions of people to lose health care."
    },
    {
        "title": "As Election Nears, Kelly Warns Trump Would Rule Like a Dictator",
        "date": "2024-10-22",
        "content": "John Kelly, the Trump White House’s longest-serving chief of staff, said that he believed that Donald Trump met the definition of a fascist."
    },
    {
        "title": "There’s One Main Culprit if Donald Trump Wins",
        "date": "2024-10-22",
        "content": "They should look at themselves and the way they practice politics."
    },
    {
        "title": "Vance Vows an End to Programs for Legal Immigrants",
        "date": "2024-10-22",
        "content": "Hundreds of thousands of immigrants live and work in the United States through programs that give them temporary legal status. In the border state of Arizona, JD Vance vowed they would stop."
    },
    {
        "title": "Biden Warns That Trump’s Election Could Jeopardize Health Care for Millions",
        "date": "2024-10-22",
        "content": "The president mocked his predecessor for offering only “concepts of a plan” to replace the Affordable Care Act, which has grown more popular in recent years."
    },
    {
        "title": "More Republicans Appear to be Voting Early",
        "date": "2024-10-22",
        "content": "Also, Israel said it killed a top Hezbollah leader. Here’s the latest at the end of Tuesday."
    },
    {
        "title": "Kurt Olsen Helped Trump Fight His 2020 Defeat. Trump Is Talking to Him Again.",
        "date": "2024-10-22",
        "content": "Mr. Olsen, a lawyer, has spoken to the former president multiple times in recent weeks. He’s insisted it’s important to make legal demands concerning voting-machine data before Election Day."
    },
    {
        "title": "Britain and Germany Agree on New Defense Pact as Russia Threat Rises",
        "date": "2024-10-22",
        "content": "The two governments said they will coordinate more on defense, with British and German troops conducting joint military exercises on NATO’s eastern border."
    },
    {
        "title": "Bill Gates Privately Says He Has Backed Harris With $50 Million Donation",
        "date": "2024-10-22",
        "content": "Mr. Gates said in a statement to The Times that “this election is different,” reflecting a significant change in his political strategy."
    },
    {
        "title": "Judge Orders Giuliani to Forfeit Millions in Assets to Election Workers He Defamed",
        "date": "2024-10-22",
        "content": "The onetime personal attorney to former President Donald J. Trump has seven days to turn over his Manhattan apartment, a vintage Mercedes-Benz and other possessions."
    },
    {
        "title": "More Republicans Appear to Be Voting Early, Despite Trump’s Mixed Messages",
        "date": "2024-10-22",
        "content": "In 2020, Donald Trump convinced his supporters that anything but a vote cast in person on Election Day could not be trusted — and lost. In response, Republicans shifted their stance."
    },
    {
        "title": "Wednesday Briefing: Casting Doubts on the U.S. Election",
        "date": "2024-10-22",
        "content": "Plus, saving Japan’s most popular rice."
    },
    {
        "title": "How a Knack for Provocation Fueled Mark Robinson’s Rise",
        "date": "2024-10-22",
        "content": "Recklessness has characterized Mr. Robinson’s online persona, his personal life and his rocky campaign for governor in North Carolina."
    },
    {
        "title": "Trump to Go on Joe Rogan’s Podcast, a Play to Reach Less Likely Voters",
        "date": "2024-10-22",
        "content": "Two campaign officials said former President Donald J. Trump will record an interview Friday with the podcast that is popular with young men, a demographic that likes him but might not vote."
    },
    {
        "title": "Despite Global Crises, Gas Prices Slide as U.S. Election Nears",
        "date": "2024-10-22",
        "content": "Fuel prices, which had soared after Russia’s invasion of Ukraine, have dropped to their lowest level since February."
    },
    {
        "title": "Inside the Harris Campaign’s Push to Win Back Muslim and Arab Voters",
        "date": "2024-10-22",
        "content": "The campaign is hoping Facebook ads, WhatsApp channels and small meetings with disillusioned voters will help turn the tide."
    },
    {
        "title": "Filipino American Voters Could Decide Key Races in Nevada",
        "date": "2024-10-22",
        "content": "Democrats in particular have tried to reach voters who are now part of the largest Asian American group in Nevada."
    },
    {
        "title": "A New Effort to Counter Threats to Election Workers",
        "date": "2024-10-22",
        "content": "American officials are highly concerned about the potential for violence against election workers on and around Nov. 5."
    },
    {
        "title": "U.S. Agrees to Give Ukraine Millions to Build More Long-Range Drones",
        "date": "2024-10-22",
        "content": "The move, confirmed by a Pentagon official, is in line with a U.S. policy change aimed at shoring up Ukraine’s ability to fight the war against Russia with its own weapons."
    },
    {
        "title": "Bruce Springsteen Will Perform for Harris in Battleground States",
        "date": "2024-10-22",
        "content": "The rocker will appear at a rally on Thursday in Atlanta alongside the vice president, and again at an event next week in Philadelphia with Barack Obama."
    },
    {
        "title": "U.S. Fears Russia Might Be Planning Post-Election Chaos",
        "date": "2024-10-22",
        "content": "Foreign powers including Russia and Iran could move quickly right after the vote to undermine the democratic process, intelligence agencies warn."
    },
    {
        "title": "The Harris Team Tries to Tether Trump to Project 2025",
        "date": "2024-10-22",
        "content": "A television ad conveys a key part of Kamala Harris’s closing argument: that her rival is a right-wing authoritarian who will make life less affordable and threaten access to abortion."
    },
    {
        "title": "Jamie Dimon Privately Supports Kamala Harris. He Just Won’t Say So.",
        "date": "2024-10-22",
        "content": "JPMorgan’s chief executive has told associates of his support for the vice president, and his dislike of Donald Trump. But fearful of blowback, he won’t say it publicly."
    },
    {
        "title": "Exploring the Failures in the Mideast",
        "date": "2024-10-22",
        "content": "Readers respond to a guest essay by Peter Beinart. Also: Donald Trump’s lewd comments at a rally; lessons from baseball; Queen Esther’s legacy."
    },
    {
        "title": "Passed Over by Harris, Shapiro Tries to Deliver Pennsylvania for Her",
        "date": "2024-10-22",
        "content": "Pennsylvania’s governor may not be on the verge of the vice presidency, but he says he has everything — including his “heart and soul” — riding on a Kamala Harris victory."
    },
    {
        "title": "Republicans Who Led 2020 Election Denial Now Sowing Doubt in 2024 Votes",
        "date": "2024-10-22",
        "content": "The efforts could help lay the groundwork for what could become another push to undermine the results if former President Donald J. Trump loses again."
    },
    {
        "title": "Harris Will Campaign in Texas to Call Attention to Abortion Rights",
        "date": "2024-10-22",
        "content": "The vice president will head to Houston on Friday, hoping to use the issue to peel moderate voters away from Donald J. Trump, who is almost certain to win the state."
    },
    {
        "title": "America’s Flooding Problem",
        "date": "2024-10-22",
        "content": "We explain how the country is responding in three different ways to disasters."
    },
    {
        "title": "Early Voting Grows Among Republicans, and a Lithium Trove in Arkansas",
        "date": "2024-10-22",
        "content": "Plus, the booming Halloween economy."
    },
    {
        "title": "The Many Links Between Project 2025 and Trump’s World",
        "date": "2024-10-22",
        "content": "Former president Donald J. Trump has attempted to distance himself from Project 2025, the conservative policy initiative. But well over half of its contributors have worked for him, and many of its policies overlap with his."
    },
    {
        "title": "U.S. and Europe Agree to Finalize $50 Billion Ukraine Loan Backed by Russian Assets",
        "date": "2024-10-22",
        "content": "Treasury Secretary Janet L. Yellen said an agreement was close. She also rebuked China’s lending practices and called for more debt relief."
    },
    {
        "title": "What’s Wrong With Donald Trump?",
        "date": "2024-10-22",
        "content": "I think there’s an answer. But it’s not age — or, at least, it’s not just age."
    },
    {
        "title": "A Second Trump Administration Would Be a Carnival of Corruption and Greed",
        "date": "2024-10-22",
        "content": "If we know anything about what life would be like if Trump wins again, we know this bottomless grifting would continue."
    },
    {
        "title": "Which Republican Might Join a Harris Cabinet? We Asked Around.",
        "date": "2024-10-22",
        "content": "In a text message, Mitt Romney sounded down on the idea. John Bolton said his chances were “substantially less than zero.” Liz Cheney remained silent on the matter."
    },
    {
        "title": "Sorry, Trump. The Issue of Abortion Is Not Going Away.",
        "date": "2024-10-22",
        "content": "It resists all attempts at moderation and compromise."
    },
    {
        "title": "6 Books to Help You Understand the Reproductive Rights Debate",
        "date": "2024-10-22",
        "content": "Journalists and scholars explore the issue at every level, from the movement that took down Roe to the human stories of women who had abortions, and those who were denied."
    },
    {
        "title": "Harris’s Early Career: Prosecutor by Day, Boldface Name by Night",
        "date": "2024-10-22",
        "content": "As Kamala Harris toiled as a junior prosecutor in Alameda County, Calif., she developed important connections among San Francisco’s financial and social elite."
    },
    {
        "title": "For Vance, an Idyllic Appalachian Startup Became a Hard Lesson",
        "date": "2024-10-22",
        "content": "During JD Vance’s brief career as a venture capitalist, few startups attracted his support more than AppHarvest, a now bankrupt plan to build greenhouses across Appalachia."
    },
    {
        "title": "The Person Leading The Times’s Politics Team",
        "date": "2024-10-22",
        "content": "That the election cycle has been turbulent may be the understatement of the century. And David Halbfinger is overseeing coverage of every twist and turn through Election Day and its aftermath."
    },
    {
        "title": "Why New York’s Orthodox Jewish Voters Could Tip the Battle for the House",
        "date": "2024-10-22",
        "content": "In three key swing districts in New York’s Hudson Valley, candidates are pressing for the support of ultra-Orthodox Jews, who tend to vote as a bloc."
    },
    {
        "title": "Tuesday Briefing",
        "date": "2024-10-22",
        "content": "Two weeks to the U.S. election."
    },
    {
        "title": "Trump Courts Christian Voters, Days After Vulgar Remarks at a Rally",
        "date": "2024-10-22",
        "content": "In a nearly hourlong speech before a crowd that included evangelical leaders, he claimed that only he could protect Christian voters. He did not mention abortion once."
    },
    {
        "title": "Elon Musk Donates Legal Maximum to Trump Campaign",
        "date": "2024-10-22",
        "content": "Mr. Musk, a megadonor, had flummoxed some Trump advisers by previously declining to write a “super max” check directly to the former president’s campaign."
    },
    {
        "title": "With Election Day 2 Weeks Away, 17 Million Voters Have Already Cast a Ballot",
        "date": "2024-10-22",
        "content": "Democrats have dominated early voting in the past. In some key states, Republicans have begun to make gains."
    },
    {
        "title": "The Election Has Taken Over TikTok. Here’s What It Looks Like.",
        "date": "2024-10-22",
        "content": "Tens of thousands of videos are posted to TikTok each week about the presidential election, including dances set to songs made from speech snippets, comedic impersonations, pranks and even news commentary."
    },
    {
        "title": "Would Harris’s Expanded Child Tax Credit Be Worth the Cost?",
        "date": "2024-10-22",
        "content": "Some Republicans, including JD Vance, are also on board."
    },
    {
        "title": "In Trump Ad, ‘Not a Thing That Comes to Mind’ Ties Harris to Biden’s Liabilities",
        "date": "2024-10-22",
        "content": "Kamala Harris’s hesitancy to put daylight between her and President Biden gave Donald Trump’s campaign a big opening."
    },
    {
        "title": "Liz Cheney Campaigns for Harris",
        "date": "2024-10-21",
        "content": "Appearing side by side at a campaign event in Michigan, the Republican former congresswoman expressed her support for Vice President Kamala Harris."
    },
    {
        "title": "Harris Wants Moderate Republicans to Back Her. Are They Out There?",
        "date": "2024-10-21",
        "content": "It’s an unusual effort that reflects just how close the race is."
    },
    {
        "title": "Trump on the Civil War, in His Own Words",
        "date": "2024-10-21",
        "content": "It’s hard to compromise with those who consider any criticism a threat."
    },
    {
        "title": "Republican Official in Arizona Pleads Guilty in Election Certification Case",
        "date": "2024-10-21",
        "content": "Peggy Judd, a county supervisor in Cochise County, a hotbed of election conspiracy theories, had tried to delay certifying the 2022 election results."
    },
    {
        "title": "Harris Is Searching for Precious Swing Voters",
        "date": "2024-10-21",
        "content": "Also, the first sickle cell gene therapy patient left the hospital. Here’s the latest at the end of Monday."
    },
    {
        "title": "Trump Took a Turn at the Fryer. McDonald’s Workers Have Thoughts.",
        "date": "2024-10-21",
        "content": "After Donald J. Trump served fast food during a campaign stop at a McDonald’s, several workers said the candidate showed a willingness to learn but should stick to his day job."
    },
    {
        "title": "Tuesday Briefing: Two Weeks Until Election Day",
        "date": "2024-10-21",
        "content": "Plus, Aleksei Navalny’s memoir."
    },
    {
        "title": "Trump Says He Has Seen No Evidence of Cheating in the Election, but Nonetheless Sows Doubts",
        "date": "2024-10-21",
        "content": "The former president, asked at a news conference in storm-damaged North Carolina if he had seen anything to suggest the election would be unfair, said, “I have not seen that.”"
    },
    {
        "title": "How Media Outlets on the Left and Right Covered Trump’s Stop at McDonald’s",
        "date": "2024-10-21",
        "content": "Former President Donald J. Trump’s campaign event at a McDonalds in Pennsylvania was described by right-leaning outlets as a brilliant move. Left-leaning publications called it weird."
    },
    {
        "title": "People Keep Making These Six Mistakes About Inflation",
        "date": "2024-10-21",
        "content": "Thanks to human nature, we misunderstand the pain, and sometimes the purpose, of rising prices."
    },
    {
        "title": "Trump’s Behavior at the Al Smith Dinner",
        "date": "2024-10-21",
        "content": "Readers respond to a Maureen Dowd column and a Campaign Notebook. Also: The need to vote; the education crisis; dead trees; Juan Soto’s magic."
    },
    {
        "title": "Central Park 5 Sue Trump for Defamation Over Debate Comments",
        "date": "2024-10-21",
        "content": "Donald J. Trump’s remarks during the presidential debate are part of a “continuing pattern” of false statements designed to “make the men suffer,” the lawsuit charged."
    },
    {
        "title": "Liz Cheney and Harris Make a Play for G.O.P. Women in ‘Blue Wall’ Suburbs",
        "date": "2024-10-21",
        "content": "As the pair campaigned together in suburban areas of battleground states, the Republican former congresswoman served as Ms. Harris’s ambassador to conservative women."
    },
    {
        "title": "As Harris Courts Sun Belt, Housing Costs Stand in Her Way",
        "date": "2024-10-21",
        "content": "Shuttered factories and trade deals helped turn working-class Midwesterners against Democrats. Will the high cost of housing do the same in the Sun Belt?"
    },
    {
        "title": "The Deeply Personal Price Women Must Pay for Abortion Bans",
        "date": "2024-10-21",
        "content": "Exceptions to save a mother’s life don’t matter when doctors fear performing the procedure."
    },
    {
        "title": "Harris’s Faith, Inside and Outside the Black Church",
        "date": "2024-10-21",
        "content": "Her biography embodies the multifaith, pluralistic and increasingly secular America she is bidding to lead."
    },
    {
        "title": "As Trump Served Up McDonald’s Fries, Vitriol Boiled Outside",
        "date": "2024-10-21",
        "content": "In Pennsylvania, a critical swing state, supporters of Donald Trump and Kamala Harris, some in weird costumes, gathered along a roadside and screamed at one another."
    },
    {
        "title": "Read the Task Force’s Report",
        "date": "2024-10-21",
        "content": "The House task force on the attempted assassinations of former President Donald J. Trump released its first preliminary report."
    },
    {
        "title": "Why the Oil and Gas Industry Is So Afraid of Kamala Harris",
        "date": "2024-10-21",
        "content": "The Democratic candidate’s agenda takes climate change seriously."
    },
    {
        "title": "What Happens in Vegas Could Decide the Election",
        "date": "2024-10-21",
        "content": "Exploring the impact of the housing crisis in Nevada, a swing state the Democrats have counted on for nearly two decades."
    },
    {
        "title": "A Final Hunt for Undecided Voters, and Israel Escalates Its War in Lebanon",
        "date": "2024-10-21",
        "content": "Plus, New York Liberty are W.N.B.A. champions."
    },
    {
        "title": "State of the Race: A Slight Shift Toward Trump but Still No Clear Favorite",
        "date": "2024-10-21",
        "content": "The polls are not precise enough for a 0.2-point edge to convey meaningful information."
    },
    {
        "title": "Events That Led to Close Call on Trump’s Life Were Preventable, Committee Finds",
        "date": "2024-10-21",
        "content": "A House task force report included detailed accounts from law enforcement at the Butler, Pa., rally, including an officer who confronted the gunman."
    },
    {
        "title": "A Writer Sees Leniency in the Supreme Court’s Approach to Public Corruption",
        "date": "2024-10-21",
        "content": "A Georgetown law professor argues that five rulings by the justices in recent years have allowed behavior that is “sketchy as hell” and meant to make the judiciary look good by contrast."
    },
    {
        "title": "Sorry, Trump: ‘There Is No American Race or Blood That Outsiders Can Pollute’",
        "date": "2024-10-21",
        "content": "Identity-first arguments are flawed. The former president forced me to make one."
    },
    {
        "title": "Trump’s Bro Whispering Could Cost Democrats Too Many Young Men",
        "date": "2024-10-21",
        "content": "Trump’s play for Generation Z men could peel enough away from the Democratic Party to transform the country’s electoral math for years to come."
    },
    {
        "title": "Inside the Last-Ditch Hunt by Harris and Trump for Undecided Voters",
        "date": "2024-10-21",
        "content": "Both campaigns are digging through troves of data to find these crucial Americans. They both think many are younger, Black or Latino. The Harris team is also eyeing white, college-educated women."
    },
    {
        "title": "Can Trump really defund public schools that recognize transgender students?",
        "date": "2024-10-21",
        "content": ""
    },
    {
        "title": "The House Race Where Democrats Desperately Want the ‘Democrat’ to Lose",
        "date": "2024-10-21",
        "content": "A write-in campaign appears to be Democrats’ only hope in a Georgia congressional district after a lawyer with extreme right-wing views won the party’s primary."
    },
    {
        "title": "Kamala Harris Has an Unexpected Ally",
        "date": "2024-10-21",
        "content": "If Trump wins, we’re going to be saddled with an isolationist and nativist conservative movement for generations to come."
    },
    {
        "title": "Where Harris and Trump Stand on Abortion",
        "date": "2024-10-21",
        "content": "In the first presidential election since the Supreme Court overturned Roe v. Wade, Vice President Kamala Harris and former President Donald J. Trump bring sharply different records on abortion. Maggie Astor, a political reporter for The New York T..."
    },
    {
        "title": "How Kamala Harris Should Put America First — for Real",
        "date": "2024-10-21",
        "content": "As president, she can create a foreign policy fit for the 21st century."
    },
    {
        "title": "Biden to Propose That Insurers Cover Over-the-Counter Birth Control",
        "date": "2024-10-21",
        "content": "The new rules under the Affordable Care Act would include emergency contraception, a newly approved nonprescription birth control pill, spermicides and condoms."
    },
    {
        "title": "5 Books to Help You Understand the Economy Before Voting",
        "date": "2024-10-21",
        "content": "The brightest minds explore the issue at every level, from the levers that control inflation to the best way to achieve work-life balance."
    },
    {
        "title": "Trump Ratchets Up Threats on the Media",
        "date": "2024-10-21",
        "content": "Presidents are not all-powerful, but, if elected, Donald Trump would have some influence with the federal regulators who oversee major television networks."
    },
    {
        "title": "Austin Condemns Kremlin ‘Apologists’ in Pledging Support for Ukraine",
        "date": "2024-10-21",
        "content": "The trip by the U.S. defense secretary comes as Russian forces steadily gain territory in eastern Ukraine."
    },
    {
        "title": "What’s on TV This Week: ‘Seth Meyers: Dad Man Walking’ and Spooky Movies",
        "date": "2024-10-21",
        "content": "The comedian’s standup special airs on HBO. Various networks show horror films."
    },
    {
        "title": "Monday Briefing",
        "date": "2024-10-21",
        "content": "Israel escalates its attacks in Lebanon."
    },
    {
        "title": "Harris Sets Record for Biggest Fund-Raising Quarter Ever",
        "date": "2024-10-21",
        "content": "Donald Trump is raising less money than he did during his run in 2020, building a far smaller campaign than Kamala Harris."
    },
    {
        "title": "Harris Says Trump’s Behavior ‘Demeans’ the Presidency After Vulgar Remarks",
        "date": "2024-10-20",
        "content": "In an interview with the Rev. Al Sharpton on MSNBC, the vice president reacted to her opponent’s behavior at rallies, saying Americans “deserve so much better.”"
    },
    {
        "title": "Monday Briefing: Israel Escalates War Against Hezbollah",
        "date": "2024-10-20",
        "content": "Plus, the French town shaken by a rape trial."
    },
    {
        "title": "Trump, Slinging Fries and Smearing Harris, Takes Turn Behind a McDonald’s Counter",
        "date": "2024-10-20",
        "content": "At a campaign photo op, the candidate worked the drive-through window, slammed his opponent and acknowledged a weakness. “I love salt,” he said."
    },
    {
        "title": "Trump Cooks and Serves Fries at a McDonald’s in Pennsylvania",
        "date": "2024-10-20",
        "content": "During his trip to the battleground state, former President Donald J. Trump repeated his unsubstantiated claim that Vice President Kamala Harris lied about working at a McDonald’s in her college days."
    },
    {
        "title": "A Swing District in Red Nebraska Hosts a Hotly Contested House Race",
        "date": "2024-10-20",
        "content": "Tony Vargas, a Democrat vying to become the state’s first Latino representative, lost to Don Bacon, the Republican incumbent, in 2022. But the presidential election could help him in his rematch."
    },
    {
        "title": "Musk’s $1 Million Offer Raises New Legal Questions",
        "date": "2024-10-20",
        "content": "Some election lawyers said the giveaway may run into laws that prohibit paying people to register to vote."
    },
    {
        "title": "Starring in Kamala Harris’s Closing Argument: Donald Trump",
        "date": "2024-10-20",
        "content": "Vice President Kamala Harris has made a notable shift in strategy to paint Donald Trump as unfit and dangerous as Democrats grow anxious about the closeness of the race just two weeks out."
    },
    {
        "title": "Confronted With Facts on Fox News, Trump Claims Ignorance",
        "date": "2024-10-20",
        "content": "In an interview that aired Sunday, Donald Trump defended his recent falsehoods about immigrants and the Capitol riot by claiming, implausibly, that he did not know or had “not heard” the truth."
    },
    {
        "title": "Abortion as an Issue in the Election",
        "date": "2024-10-20",
        "content": "Readers respond to a column by David French. Also: Veterans as poll workers; an immigrant’s story; political messages."
    },
    {
        "title": "Kamala Harris and McDonald’s: A College Job, and a Trump Attack",
        "date": "2024-10-20",
        "content": "Donald Trump has claimed without evidence that Ms. Harris never worked at the fast-food chain. Her campaign and a friend say she did."
    },
    {
        "title": "For Trump, a Lifetime of Scandals Heads Toward a Moment of Judgment",
        "date": "2024-10-20",
        "content": "No major party presidential candidate, much less president, in American history has been accused of wrongdoing so many times."
    },
    {
        "title": "How Elections Affect Our Shopping",
        "date": "2024-10-20",
        "content": "We explore why consumers tend to get skittish about major purchases ahead of a general election."
    },
    {
        "title": "Four of Trump’s Most Meandering Remarks This Week",
        "date": "2024-10-20",
        "content": "The former president says that his style is to “weave” from one subject to the next. Others see something more worrisome in his ramblings."
    },
    {
        "title": "At Homecoming, Howard Alumni Are Excited and Anxious for Harris",
        "date": "2024-10-20",
        "content": "The H.B.C.U. celebrated its centennial homecoming this weekend, with many partygoers holding their breath for the school’s famous alumna, Vice President Kamala Harris, in the election’s homestretch."
    },
    {
        "title": "Harris May Be Catching Up on a Key Polling Question: Which Candidate Helps You?",
        "date": "2024-10-20",
        "content": "Many voters believe Donald Trump’s policies have helped them, Times/Siena polls show. Kamala Harris has made up some lost ground on that question, though there are warning signs in the swing states."
    },
    {
        "title": "I Can’t Buy a House. I Can’t Shop. I’m Too Worried About the Election.",
        "date": "2024-10-20",
        "content": "Election anxiety is causing many consumers to avoid big-ticket purchases like houses, weddings and cars. “Every four years this happens,” one former car dealer said."
    },
    {
        "title": "Door-Knocks, Texts, and Ads, Ads, Ads: Life on the Swing-State Battlefield",
        "date": "2024-10-20",
        "content": "This year’s campaign offers a vivid reminder of how much the playing field in presidential elections has shrunk, giving voters in a handful of states a disproportionate influence in the decision."
    },
    {
        "title": "U.S. Agencies Fund, and Fight With, Elon Musk. A Trump Presidency Could Give Him Power Over Them.",
        "date": "2024-10-20",
        "content": "Mr. Musk, who holds billions in federal contracts, wants to be in charge of the regulators that oversee him if Donald Trump wins."
    },
    {
        "title": "Jill Stein Won’t Stop. No Matter Who Asks.",
        "date": "2024-10-20",
        "content": "People in Stein’s life have implored her to abandon her bid for president, lest she throw the election to Donald Trump. She’s on the ballot in almost every critical state."
    },
    {
        "title": "At a Pennsylvania Rally, Trump Descends to New Levels of Vulgarity",
        "date": "2024-10-20",
        "content": "The G.O.P. nominee repeated crude insults, and his supporters relished each moment. But the display could alienate swing voters."
    },
    {
        "title": "How Indonesia’s Transformative Leader Tarnished His Legacy",
        "date": "2024-10-20",
        "content": "Joko Widodo rose from a slum to the presidency. But with his tenure ending, he is being accused of undermining democracy by trying to install a political dynasty."
    },
    {
        "title": "Harris and Usher Make Abortion Rights the Focus at Atlanta Rally",
        "date": "2024-10-20",
        "content": "Vice President Kamala Harris, campaigning in the state with the most restrictive abortion law of any battleground, criticized former President Donald J. Trump’s record on abortion."
    },
    {
        "title": "Early In-Person Voting Begins in Nevada, as Obama Fires Up Democrats",
        "date": "2024-10-19",
        "content": "Former President Barack Obama held a campaign rally for Vice President Kamala Harris in Las Vegas on Saturday, as early in-person voting got underway in a critical battleground state."
    },
    {
        "title": "Vulnerable Senate Democrat Promotes Trump Ties in New Ad",
        "date": "2024-10-19",
        "content": "The spot, which says that Senator Bob Casey of Pennsylvania had “sided with Trump” on trade and tariffs, was quickly denounced by the Trump campaign."
    },
    {
        "title": "Harris, Armed With a T-shirt and a Message, Sticks Up for Detroit Against Trump",
        "date": "2024-10-19",
        "content": "After former President Donald J. Trump disparaged the city, Vice President Kamala Harris said her campaign was seeking the kind of “grit” and “excellence” the city’s residents possessed."
    },
    {
        "title": "Cuba Suffers Second Power Outage in 24 Hours, Realizing Years of Warnings",
        "date": "2024-10-19",
        "content": "Fidel Castro once called Cuba’s power plants “prehistoric.” But the country still relies on them, contributing to the longest blackout since the collapse of its former patron, the Soviet Union."
    },
    {
        "title": "In Michigan, Trade Policies and the Water Crisis Loom Large for Voters",
        "date": "2024-10-19",
        "content": "After years of challenges, voters in this crucial swing state say they feel let down by their leaders."
    },
    {
        "title": "Harris to Court Moderates With a Onetime Right-Wing Provocateur",
        "date": "2024-10-19",
        "content": "Charlie Sykes, the anti-Trump conservative commentator joining the vice president in Wisconsin on Monday, in the past amplified false claims of voter fraud and referred to Michelle Obama as “Mooch.”"
    },
    {
        "title": "For Executives, ‘Defending Democracy’ Can Seem Risky",
        "date": "2024-10-19",
        "content": "Even seemingly anodyne sentiments supporting fair elections have become politically charged."
    },
    {
        "title": "American Business Cannot Afford to Risk Another Trump Presidency",
        "date": "2024-10-19",
        "content": "Donald Trump is not running as a champion of business. He is running as a tribune of populist grievance."
    },
    {
        "title": "Trump Thinks the Border Got Him Elected in 2016. He’s Convinced It Will Do So Again.",
        "date": "2024-10-19",
        "content": "Voters rank the economy and high cost of living as their top issue. Donald J. Trump believes immigration “beats out the economy,” and he’s made it his closing message."
    },
    {
        "title": "In a Bellwether Pennsylvania County, a Modest Loss Could Be a Win for Harris",
        "date": "2024-10-19",
        "content": "In white, working-class places, Kamala Harris’s goal is simply to lose by less. Thirty interviews in Beaver County, Pa., offered signs that with some swing voters, she is holding the line."
    },
    {
        "title": "Inside Wisconsin’s Fight Over Ballot Drop Boxes",
        "date": "2024-10-19",
        "content": "Ballot drop boxes, used for years in Wisconsin until they were mostly banned after Republicans’ legal challenges, are back. Julie Bosman, the Chicago bureau chief for The New York Times, describes how the boxes have become the subject of bitter de..."
    },
    {
        "title": "How Maya Rudolph’s Impression of Kamala Harris Has Changed",
        "date": "2024-10-19",
        "content": "As Ms. Harris rose to center stage, the actor playing her on “S.N.L.” modified her approach, turning the vice president into a no-nonsense boss, surrounded by dopey men."
    },
    {
        "title": "Split-Ticket Voters Buoy Democrats in Key Senate Races",
        "date": "2024-10-19",
        "content": "In the battleground state of Arizona and other important pockets of the country, polling suggests that voters backing the former president are eschewing Republican Senate candidates."
    },
    {
        "title": "The Fight Over Ballots Has Already Begun in Wisconsin",
        "date": "2024-10-19",
        "content": "Drop boxes, which had been used for years in Wisconsin until they were mostly banned after Republicans mounted legal challenges, are back. They have become the subject of bitter debate."
    },
    {
        "title": "We Don’t Yet Understand What Warehouse Work Is Doing to Communities",
        "date": "2024-10-19",
        "content": "Warehouses in Lehigh Valley, Pa. have been an economic boon for blue collar workers. But they have been a political bust."
    },
    {
        "title": "‘Life Is Complicated’: How a Scourge of Oligarchs Fell in Love With One",
        "date": "2024-10-19",
        "content": "Natalia Morari once reported on corrupt business in Moldova. Now she has upset many by having a son with a tycoon accused of corruption, and running against the pro-West president in elections."
    },
    {
        "title": "Trump Tries to Rewrite History of Jan. 6 in Campaign’s Final Stretch",
        "date": "2024-10-19",
        "content": "Donald J. Trump amplified a conspiracy theory that the federal government had staged the Capitol attack and compared jailed rioters to people of Japanese descent in internment camps."
    },
    {
        "title": "New York Man Who Brought Knife to Jan. 6 Riot Pleads Guilty to a Felony",
        "date": "2024-10-19",
        "content": "Christopher D. Finney was charged after federal investigators found images of him during a search of a “militia” group chat, prosecutors said."
    },
    {
        "title": "These Americans Say They’ll Move Abroad if Their Candidate Loses",
        "date": "2024-10-18",
        "content": "We spoke with Americans who are packing up and moving out."
    },
    {
        "title": "In Michigan, Harris and Trump Fight for Blue-Collar and Arab Voters",
        "date": "2024-10-18",
        "content": "Campaigning in the battleground on the same day, Kamala Harris cast herself as a friend to union workers while Donald Trump sought to capitalize on anger over the war in Gaza."
    },
    {
        "title": "After Hush-Money Verdict, Trump Tried to Silence Stormy Daniels Again",
        "date": "2024-10-18",
        "content": "Donald J. Trump was convicted in May of covering up a hush-money deal with Stormy Daniels. Just two months later, his lawyer offered another deal for her silence."
    },
    {
        "title": "A Sherrod Brown Ad Seizes on an Unwise Remark About Women and Abortion",
        "date": "2024-10-18",
        "content": "Bernie Moreno, his Republican rival, said women older than 50 are “crazy” for caring about abortion rights. A series of Ohio women who fit that description have much to say in response."
    },
    {
        "title": "Why Harris Remains Unlikely to Break From Biden on Israel and Gaza",
        "date": "2024-10-18",
        "content": "Her advisers say the empathy she has expressed for Palestinians as vice president should not be confused with any willingness to break from U.S. foreign policy toward Israel as a presidential candidate."
    },
    {
        "title": "North Carolina Officials Report Record Turnout for First Day of Early Voting",
        "date": "2024-10-18",
        "content": "The more than 353,000 ballots cast signaled enthusiasm in the battleground state, but the significance of the high turnout was unclear."
    },
    {
        "title": "A Candidate for U.S. Senate Says He Was Shot in War. Was He?",
        "date": "2024-10-18",
        "content": "Tim Sheehy, a Republican running for U.S. Senate in Montana, says he has a bullet in his arm from Afghanistan. But new questions have been raised about his account."
    },
    {
        "title": "Italian Judges Strike Down Request to Hold Migrants in Albania",
        "date": "2024-10-18",
        "content": "The ruling was a major blow to the conservative government’s plan to have asylum claims heard in Albania instead of Italy."
    },
    {
        "title": "Mudslides, Misinformation and an Urgency to Vote in Western North Carolina",
        "date": "2024-10-18",
        "content": "On the first day of early voting, residents of western North Carolina weighed which candidates would most help their yearslong recovery."
    },
    {
        "title": "In Swing Districts, Republicans Lean Into Anti-Crime Message to Court the Center",
        "date": "2024-10-18",
        "content": "Representative Lori Chavez-DeRemer, a Republican in a tough re-election race in Oregon, is using a law-and-order pitch to appeal to a broad swath of voters and blunt concerns about the G.O.P. agenda."
    },
    {
        "title": "Judge Releases Redacted Trove of Evidence in Trump Election Case",
        "date": "2024-10-18",
        "content": "The former president’s legal team had objected to any release of material, saying it would amount to election interference."
    },
    {
        "title": "Trump Defends Adams, Arguing Both Are Being ‘Persecuted’",
        "date": "2024-10-18",
        "content": "Mayor Eric Adams, a Democrat, and Donald J. Trump, the Republican former president, are strange bedfellows as both face legal challenges."
    },
    {
        "title": "After Sinwar: What Is the Future of Gaza?",
        "date": "2024-10-18",
        "content": "Responses to the killing of the Hamas leader. Also: Guarding against authoritarianism; medical dramas; expressing sympathy to mourners; October light."
    },
    {
        "title": "JD Vance and the Fight for Pennsylvania’s Catholic Voters",
        "date": "2024-10-18",
        "content": "The Republican vice-presidential nominee is the only Catholic on either national ticket. His politics resonate with many white conservative Catholics."
    },
    {
        "title": "Trump Among New York’s Elites at a Charity Dinner: It Got Awkward",
        "date": "2024-10-18",
        "content": "There were grudge matches and sycophancy in equal measure at the Alfred E. Smith Memorial Foundation Dinner. “Isn’t it just exciting, what’s going on,” Donald Trump said."
    },
    {
        "title": "Democrats’ Report Calls Trump Hotel Business Unethical and Unconstitutional",
        "date": "2024-10-18",
        "content": "Democrats on the House Oversight Committee said the former president overcharged the Secret Service and accepted money from officials and people who were seeking pardons and appointments."
    },
    {
        "title": "Tesla Self-Driving System Will Be Investigated by Safety Agency",
        "date": "2024-10-18",
        "content": "The National Highway Traffic Safety Administration said it was looking into what Elon Musk’s electric car company called the full self-driving system."
    },
    {
        "title": "Biden, in Germany, Urges Unwavering Support for Ukraine",
        "date": "2024-10-18",
        "content": "The president, in a trip to Berlin that lasted barely a day, also joined Chancellor Olaf Scholz of Germany in expressing new optimism about the prospect for peace in the Middle East."
    },
    {
        "title": "200 Years Later, Still Trying to Define the Midwest",
        "date": "2024-10-18",
        "content": "From the geographic boundaries to the values and friendliness, people have debated what defines the region essentially since it was labeled the Midwest. It has taken on a renewed urgency this election year."
    },
    {
        "title": "Harris Will Campaign With the Obamas Next Week",
        "date": "2024-10-18",
        "content": "Barack and Michelle Obama will make their first campaign appearances alongside Kamala Harris at rallies in Georgia and Michigan."
    },
    {
        "title": "The Hidden Politics of Disorder",
        "date": "2024-10-18",
        "content": "The crime researcher Charles Fain Lehman discusses why people feel unsafe, even as violent crime rates have dropped."
    },
    {
        "title": "The Evidence for a Big Youth Gender Gap and a Right Turn for Young Men",
        "date": "2024-10-18",
        "content": "Young men are much more Republican than young women, the best data suggests, and may wind up backing Donald Trump."
    },
    {
        "title": "These Undecided Michigan Voters Really Aren’t All That Undecided",
        "date": "2024-10-18",
        "content": "Many people I spoke to seemed reluctant to admit — even, perhaps, to themselves — that they were really going to vote for that person."
    },
    {
        "title": "There Is No Precedent for Something Like This in American History",
        "date": "2024-10-18",
        "content": "This is no ordinary election, and we cannot act like it is."
    },
    {
        "title": "Forget Swing States. It’s These 21 Microcommunities That Could Decide the Election.",
        "date": "2024-10-18",
        "content": "A look at the political microcommunities that could decide the 2024 presidential election."
    },
    {
        "title": "How Tech Billionaires Became the G.O.P.’s New Donor Class",
        "date": "2024-10-18",
        "content": "Elon Musk and a group of Silicon Valley allies have built a shadow campaign to put Donald Trump back in office."
    },
    {
        "title": "The 25-Year-Old Georgia Senate Candidate Looking to Unseat a Fake Trump Elector",
        "date": "2024-10-18",
        "content": "Ashwin Ramaswami, a Democrat, was still in law school when he decided to run against State Senator Shawn Still, who was indicted with Donald Trump in the Georgia election interference case."
    },
    {
        "title": "A Pollster Helps Us Manage Our Election Anxiety",
        "date": "2024-10-18",
        "content": "It’s been a tumultuous campaign. Kristen Soltis Anderson helps us find stability in the polls."
    },
    {
        "title": "How Is the Economy for Black Voters? A Complex Question Takes Center Stage.",
        "date": "2024-10-18",
        "content": "Donald J. Trump has been talking up his economic record for Black voters. The legacy of the last eight years is complicated."
    },
    {
        "title": "Best, Worst and Most Awkward Lines at the Al Smith Dinner",
        "date": "2024-10-18",
        "content": "Donald J. Trump and Kamala Harris both delivered remarks, Ms. Harris via taped video and Mr. Trump in person in a ballroom in Manhattan."
    },
    {
        "title": "Trump Jabs Harris for Not Attending Al Smith Charity Dinner",
        "date": "2024-10-18",
        "content": "The annual Catholic charity event is known for inviting presidential candidates to lightheartedly roast each other."
    },
    {
        "title": "Friday Briefing",
        "date": "2024-10-18",
        "content": "The leader of Hamas is dead."
    },
    {
        "title": "Nevada’s Senate Rivals Spar in a Debate Heavy on Policy and Light on Fireworks",
        "date": "2024-10-18",
        "content": "Senator Jacky Rosen and her Republican challenger, Sam Brown, met for their only debate, focusing on the cost of living, abortion and other issues."
    },
    {
        "title": "Meet the Candidate: Elon Musk",
        "date": "2024-10-18",
        "content": "The billionaire is spending a fortune to support former President Donald J. Trump. But at a town hall event in Pennsylvania, he looked an awful lot like a politician himself."
    },
    {
        "title": "How Trump’s Radical Tariff Plan Could Wreck Our Economy",
        "date": "2024-10-17",
        "content": "There’s no upside to the former president’s pet economic plan."
    },
    {
        "title": "What Keeps Latino Voting-Rights Activists Up at Night? Disinformation",
        "date": "2024-10-17",
        "content": "Activists say the nefarious material is more widespread, sophisticated and complex than ever."
    },
    {
        "title": "Why the Heck Isn’t She Running Away With This?",
        "date": "2024-10-17",
        "content": "After huge shifts in the electorate, it’s baffling that the two parties are still almost exactly evenly matched."
    },
    {
        "title": "Harris Slams Trump for Calling Jan. 6 a ‘Day of Love’",
        "date": "2024-10-17",
        "content": "Speaking at a campaign rally in La Crosse, Wis., Vice President Kamala Harris said former President Donald J. Trump was “gaslighting” Americans with his effort to rewrite the history of Jan. 6, 2021."
    },
    {
        "title": "In Rambling Interview, Trump Blames Zelensky, Not Putin, for Ukraine War",
        "date": "2024-10-17",
        "content": "The war began when Russia invaded Ukraine, but Donald J. Trump said on a podcast that the Ukrainian president “should never have let that war start.”"
    },
    {
        "title": "The Leader of Hamas Is Dead",
        "date": "2024-10-17",
        "content": "Also, Biden traveled to Germany as the U.S. wrestles with military aid. Here’s the latest at the end of Thursday."
    },
    {
        "title": "Harris Hits Trump Over His ‘Father of I.V.F.’ and Jan. 6 Remarks",
        "date": "2024-10-17",
        "content": "Campaigning in Wisconsin, the vice president sought to amplify her rival’s recent comments that he was “the father of I.V.F.” and that Jan. 6, 2021, was “a day of love.”"
    },
    {
        "title": "Man Who Sprayed Police With Wasp Killer Pleads Guilty to Jan. 6 Charges",
        "date": "2024-10-17",
        "content": "Peter Moloney, who owned funeral homes on Long Island, struck a photojournalist and another man and pleaded guilty to assaulting police officers."
    },
    {
        "title": "Friday Briefing: The Leader of Hamas is Dead",
        "date": "2024-10-17",
        "content": "Plus, an interview with Hugh Grant."
    },
    {
        "title": "Sam Brown, Republican Candidate for Senate in Nevada, Struggles for Traction",
        "date": "2024-10-17",
        "content": "Mr. Brown, who has never held elected office, has found himself outpaced by Senator Jacky Rosen, the low-key and well-financed Democratic incumbent. A debate Thursday night presents a key test."
    },
    {
        "title": "The N.R.A. Again Cuts Back on Top Grades for Congressional Candidates",
        "date": "2024-10-17",
        "content": "The group’s latest ratings show a decline in top marks for the seventh straight election cycle, suggesting its influence is waning."
    },
    {
        "title": "Trump’s Meandering Speeches Motivate His Critics and Worry His Allies",
        "date": "2024-10-17",
        "content": "Some advisers and allies of former President Donald J. Trump are concerned about his scattershot style on the campaign trail as he continues to veer off script."
    },
    {
        "title": "Harris Says Hamas Leader’s Killing Offers Chance to End Gaza War",
        "date": "2024-10-17",
        "content": "“It is time for the day after to begin without Hamas in power,” the vice president said after the Israeli military confirmed that Yahya Sinwar, the leader of the militant group, had been killed."
    },
    {
        "title": "Trump’s In-Law Is Trying to Exploit Democrats’ Weakness With Arab American Voters",
        "date": "2024-10-17",
        "content": "Massad Boulos, Tiffany Trump’s father in-law, has been working behind the scenes to persuade a critical group of voters in Michigan."
    },
    {
        "title": "Amazon Enters News With Live Election Coverage From Brian Williams",
        "date": "2024-10-17",
        "content": "The tech giant has been increasing live programming on its streaming service, but this will be its first test with news."
    },
    {
        "title": "Harris and Democrats Lose Their Reluctance to Call Trump a Fascist",
        "date": "2024-10-17",
        "content": "Since Gen. Mark Milley was quoted as saying Donald Trump is “fascist to the core,” a term avoided by top members of the Democratic Party is suddenly everywhere."
    },
    {
        "title": "In Germany, Biden Prepares for a Farewell Visit to a Key Ally",
        "date": "2024-10-17",
        "content": "The president’s hastily rescheduled trip to Berlin will last less than a day. The German government has trimmed back its celebrations accordingly."
    },
    {
        "title": "Using Tax Cuts and Near-Assassination to Show Trump as a Fighter for Workers",
        "date": "2024-10-17",
        "content": "A pro-Trump super PAC shows Donald Trump’s “Fight! Fight!” response in Butler, Pa., to portray him as a champion for blue-collar Americans."
    },
    {
        "title": "When God Gives You Mark Robinson, Make Lemonade",
        "date": "2024-10-17",
        "content": "Josh Stein’s campaign in North Carolina is a master class in devastating campaign ads."
    },
    {
        "title": "Trump Keeps Promising New Tax Cuts. Other Republicans Are Wary.",
        "date": "2024-10-17",
        "content": "Former President Donald J. Trump’s costly tax agenda undermines the changes he signed into law in 2017. Some Republicans are wary."
    },
    {
        "title": "Advice on a Speech That Harris Could Give",
        "date": "2024-10-17",
        "content": "Responses to a column by Bret Stephens. Also: Donald Trump and the “enemy from within”; medicine for Gaza; A.I. and human voices; a new birth certificate."
    },
    {
        "title": "Could Second-Home Owners Swing New York’s Swing Districts?",
        "date": "2024-10-17",
        "content": "A group is pushing thousands of New Yorkers to vote from weekend homes in swing districts. Its pitch: “Your second home could determine the next speaker.”"
    },
    {
        "title": "Is the Trump Trade Back?",
        "date": "2024-10-17",
        "content": "Market observers see signs that investors increasingly believe Donald Trump will win the election, but there may be alternate explanations for a shift in sentiment."
    },
    {
        "title": "The Power of Government Policies",
        "date": "2024-10-17",
        "content": "The U.S. has the capacity to address its biggest problems. Whether it does is a different matter."
    },
    {
        "title": "19 Days to Go: Early Voting, Dance Parties and Third Parties",
        "date": "2024-10-17",
        "content": "Watch or listen to our political round table."
    },
    {
        "title": "Harris’s Contentious Fox Interview, and Italy Expands Surrogacy Ban",
        "date": "2024-10-17",
        "content": "Plus, One Direction’s Liam Payne dies at 31."
    },
    {
        "title": "19 Days to Go: Early Voting, Dance Parties and Third Parties",
        "date": "2024-10-17",
        "content": "This week on the campaign trail, Donald Trump displayed bizarre town hall behavior, Kamala Harris pursued a strategy aimed at Black men, and the first wave of early voting offered a look at the energy of the electorate. Michael Barbaro sits down w..."
    },
    {
        "title": "Let’s Take the Republican Policy Challenge",
        "date": "2024-10-17",
        "content": "The former president’s actual plans are no better than his tweets."
    },
    {
        "title": "How Accurate, or Off-Target, Could the Polls Be This Year?",
        "date": "2024-10-17",
        "content": "Pre-election polls will never perfectly match election results. But an examination of three decades of polling helps put recent misses into context."
    },
    {
        "title": "White House, Used to Road Blocks on Student Debt, Finds Cause for Victory Lap",
        "date": "2024-10-17",
        "content": "An effort to revive and maximize use of the Public Service Loan Forgiveness program has resulted in student loan forgiveness for over one million people."
    },
    {
        "title": "Yellen Warns Sweeping Tariffs Would Ignite Inflation",
        "date": "2024-10-17",
        "content": "The Treasury secretary criticized former President Donald J. Trump’s economic proposals in a speech."
    },
    {
        "title": "Door Knocking Is Tough These Days. Harris’s Team Is Betting on Apps.",
        "date": "2024-10-17",
        "content": "As technology like doorbell cameras makes it easier to avoid unsolicited visitors, the Harris campaign is leaning on data-capturing apps to supplement the traditional work of canvassing."
    },
    {
        "title": "The Trump Plan to Flip Georgia Back",
        "date": "2024-10-17",
        "content": "Why the Trump team is confident 2024 will not be a repeat of 2020."
    },
    {
        "title": "I Grew Up in Bucks County, Pa. I Went Back to Try to Make Sense of the Election.",
        "date": "2024-10-17",
        "content": "The people in Riegelsville, Pa., expressed two shockingly different visions of what a president should be."
    },
    {
        "title": "Lorna Simpson Is America’s Great Archivist",
        "date": "2024-10-17",
        "content": "Throughout her genre-bending career, the artist has always made marginalization a source of power."
    },
    {
        "title": "America Is Sleepwalking Into an Economic Storm",
        "date": "2024-10-17",
        "content": "The combination of an aging work force, artificial intelligence and shifts in globalization will challenge America in ways not seen in decades."
    },
    {
        "title": "Jonathan Anderson Only Wants to Be the World’s Best Fashion Designer",
        "date": "2024-10-17",
        "content": "The creative director of Loewe and founder of JW Anderson mines culture with the eye of a curator and a restlessness all his own."
    },
    {
        "title": "Theaster Gates Is Redefining What It Means to Be an Artist",
        "date": "2024-10-17",
        "content": "With a practice that includes painting, ceramics and real estate, he has truly earned the title “multidisciplinary.”"
    },
    {
        "title": "How Florence Welch Turned Rage Into Power",
        "date": "2024-10-17",
        "content": "Nearly two decades into her career, the singer still sounds like no one else out there."
    },
    {
        "title": "The Greats",
        "date": "2024-10-17",
        "content": "T celebrates four talents across music, art and fashion who, through patience and perseverance, have transformed the culture."
    },
    {
        "title": "Will the Polls in 2024 Be More Accurate Than in 2016 and 2020?",
        "date": "2024-10-17",
        "content": "Can you trust the polls this year? Kaleigh Rogers, a polling reporter at The New York Times, describes how pollsters have tried to fix past mistakes."
    },
    {
        "title": "Inside the Secretive $700 Million Ad-Testing Factory for Kamala Harris",
        "date": "2024-10-17",
        "content": "Future Forward has ascended to the top of the Democratic political universe, but it has also drawn suspicion and second-guessing."
    },
    {
        "title": "Alone in the Dark: The Nightmare of Bangladesh’s Secret Underground Prison",
        "date": "2024-10-17",
        "content": "In the House of Mirrors, political captives were pushed to the brink of insanity and death. Some are telling their stories now that the woman who put them there, Sheikh Hasina, is gone."
    },
    {
        "title": "Thursday Briefing",
        "date": "2024-10-17",
        "content": "A heated interview with Fox News."
    },
    {
        "title": "This Is What It Takes to Get an Abortion in America",
        "date": "2024-10-17",
        "content": "In text messages, videos, voice memos and pictures, we hear from the people at the frontlines of abortion access about how their worlds have changed."
    },
    {
        "title": "Kamala Harris Arrived for a Fox Interview. She Got a Debate.",
        "date": "2024-10-17",
        "content": "The vice president’s sit-down with Bret Baier was her most contentious meeting with a journalist since becoming the Democratic nominee."
    },
    {
        "title": "Can Harris Really Build 3 Million New Housing Units?",
        "date": "2024-10-17",
        "content": ""
    },
    {
        "title": "6 Takeaways From Harris’s Combative Interview on Fox News",
        "date": "2024-10-17",
        "content": "Pressed and often interrupted by Bret Baier, the vice president opened up a little more distance from President Biden and defended her position on immigration and border security."
    },
    {
        "title": "Judge Strikes Down Multiple Georgia Election Rules",
        "date": "2024-10-17",
        "content": "The measures had been promoted by the State Election Board. The judge called them “illegal, unconstitutional and void.”"
    },
    {
        "title": "Harris Makes a Broad Overture to Republican Voters, Citing the Constitution",
        "date": "2024-10-16",
        "content": "Appearing in a competitive suburban area of southeastern Pennsylvania, the vice president tried to strike a unifying tone even as she warned that Donald Trump posed a threat to the country."
    },
    {
        "title": "Into the Gender Gap",
        "date": "2024-10-16",
        "content": "Harris and Trump are trying to address the gender gap. Their approaches could not be more different."
    },
    {
        "title": "Asked if He Thinks Trump Lost in 2020, Vance Finally Gives an Answer: No",
        "date": "2024-10-16",
        "content": "Senator JD Vance, former President Donald J. Trump’s running mate, had spent weeks dodging questions about Mr. Trump’s false claims he won the 2020 election."
    },
    {
        "title": "Ethel Kennedy Is Eulogized by 3 Presidents, Celebrities and Grandchildren",
        "date": "2024-10-16",
        "content": "The memorial service in Washington drew major names from the Democratic Party and celebrities, including Sting and Stevie Wonder."
    },
    {
        "title": "In a Harris Ad, a Black Man Speaks to Black Men on Her Behalf",
        "date": "2024-10-16",
        "content": "A commercial running in Philadelphia confronts the idea that some Black men might be hesitant to vote for Kamala Harris because she is a woman. “Women know how to make things happen,” a supporter says."
    },
    {
        "title": "Trump Faced Tough Questions From Hispanic Voters",
        "date": "2024-10-16",
        "content": "Also, the Supreme Court suggested that U.S. water regulations are too vague. Here’s the latest at the end of Wednesday."
    },
    {
        "title": "Trump Faces Tough Questions From Hispanic Voters, but Largely Defends or Dodges",
        "date": "2024-10-16",
        "content": "In a town hall that Univision broadcast on Wednesday night, Donald J. Trump did not directly answer many frank questions on climate change, immigration, abortion rights and other topics."
    },
    {
        "title": "Thursday Briefing: Trump Threatens ‘the Enemy From Within’",
        "date": "2024-10-16",
        "content": "Plus, the women of the world’s gnarliest mountain-bike competition."
    },
    {
        "title": "Georgia Prosecutor Seeks to Reinstate Quashed Charges in Trump Elections Case",
        "date": "2024-10-16",
        "content": "The appeal filed on Tuesday disputes a judge’s ruling that six of the charges brought against Donald J. Trump and his allies in Georgia were not specific enough."
    },
    {
        "title": "For Ruben Gallego, the Campaign Trail Runs Through the Grand Canyon",
        "date": "2024-10-16",
        "content": "The Democratic congressman, who is running for Senate in Arizona, hiked thousands of feet down to meet the Havasupai, a Native tribe, on their land, part of an extensive outreach effort in a competitive race."
    },
    {
        "title": "Where Are Trump and Harris Campaigning?",
        "date": "2024-10-16",
        "content": "Here’s where the candidates are spending their time in the final weeks of the 2024 presidential race."
    },
    {
        "title": "In This Small Maine County, the Sheriff’s Race Is Haunted by a Mass Shooting",
        "date": "2024-10-16",
        "content": "The race has become a referendum on what the Sagadahoc County Sheriff’s Office did, and failed to do, before a shooting that killed 18 people in Lewiston last fall."
    },
    {
        "title": "Biden Announces $425 Million in Aid to Ukraine",
        "date": "2024-10-16",
        "content": "President Biden spoke by telephone to President Volodymyr Zelensky of Ukraine about the security package, which includes munitions, armored vehicles and other weapons."
    },
    {
        "title": "Hurricane Helene Eroded Our Shared Reality",
        "date": "2024-10-16",
        "content": "Climate misinformation isn’t new. But it’s getting worse."
    },
    {
        "title": "A Weary Trump Whips Up Anger in Atlanta",
        "date": "2024-10-16",
        "content": "At a rally in a state he lost in 2020, the former president considered the possibility of another defeat."
    },
    {
        "title": "Why an Interview on Fox News Made Sense for Kamala Harris",
        "date": "2024-10-16",
        "content": "The vice president will take questions from Bret Baier in a session to be broadcast at 6 p.m. She joins a long line of Democratic candidates and elected officials who have ventured into hostile television territory."
    },
    {
        "title": "Abortion-Rights Group Accuses DeSantis Administration of Stifling Free Speech",
        "date": "2024-10-16",
        "content": "The group behind an ad in favor of enshrining abortion rights in Florida’s Constitution says the state is violating the First Amendment by threatening TV stations that ran the ad."
    },
    {
        "title": "Judge Extends Sentence for Former County Official Convicted in Las Vegas Journalist’s Murder",
        "date": "2024-10-16",
        "content": "Robert Telles was sentenced to life in prison with the possibility of parole after 20 years for the murder of Jeff German. On Wednesday, a judge added eight years to that minimum."
    },
    {
        "title": "Read the Nebraska Supreme Court Ruling on Voting Rights for Felons",
        "date": "2024-10-16",
        "content": "The decision affirmed a law passed by the Legislature this year clearing the way for people to cast ballots immediately after finishing prison and parole terms."
    },
    {
        "title": "Trump Wants Young Voters, but He’s Nowhere to Be Seen on Snapchat",
        "date": "2024-10-16",
        "content": "The former president, whose personal account was banned after the Capitol riot, has refused to spend campaign money on Snapchat ads, effectively ceding the space to Kamala Harris."
    },
    {
        "title": "In Race for Congress, Republican Election Deniers and Skeptics Seek Swing Seats",
        "date": "2024-10-16",
        "content": "G.O.P. candidates in critical House districts have sought to moderate or gloss over their past questioning of the 2020 election results, as well as hard-right positions on social issues."
    },
    {
        "title": "Trump Raises Eyebrows by Proclaiming Himself the ‘Father of I.V.F.’",
        "date": "2024-10-16",
        "content": "His campaign said the comment, which he said at an event focused on women’s issues, was “made in jest.” He has supported access to I.V.F. recently but didn’t promote it before this year."
    },
    {
        "title": "Jimmy Carter Casts His Ballot for Harris in Georgia",
        "date": "2024-10-16",
        "content": "The 39th president, who entered hospice care in February 2023, submitted an absentee ballot, according to a grandson. His family said he had been eager to vote for Vice President Kamala Harris."
    },
    {
        "title": "Thomas J. Donohue Dies at 86; Transformed Chamber of Commerce",
        "date": "2024-10-16",
        "content": "Under his 24-year leadership, the lobbying group developed enormous clout in Washington, but he broke with the Trump administration over immigration, tariffs and the 2020 election."
    },
    {
        "title": "How Media Outlets on the Left and Right Covered Trump’s Musical Town Hall",
        "date": "2024-10-16",
        "content": "When former President Donald J. Trump played D.J. at a campaign event on Monday, both liberal and conservative media outlets described it as “surreal.”"
    },
    {
        "title": "England Entrusts a National Treasure to (Gasp!) a German",
        "date": "2024-10-16",
        "content": "The appointment of Thomas Tuchel to coach the England men’s national soccer team has provoked, well, some strong feelings."
    },
    {
        "title": "Nebraska Supreme Court Upholds Voting Rights for Felons",
        "date": "2024-10-16",
        "content": "Legislators voted to restore voting rights to more people convicted of felonies, but a dispute over that law’s constitutionality created pre-election confusion."
    },
    {
        "title": "Michelle Obama to Host a Rally to Encourage Voter Turnout in Georgia",
        "date": "2024-10-16",
        "content": "The former first lady, one of the Democratic Party’s most popular but most elusive figures, will appeal to younger, nonwhite voters."
    },
    {
        "title": "It’s Not Just Taylor Swift. Music Activism Gets Back on the Road.",
        "date": "2024-10-16",
        "content": "Bands were sidelined by the Covid-19 pandemic during the 2020 campaign. This year, with increasing sophistication, they are encouraging political activism."
    },
    {
        "title": "Israel Allows Some Aid Into Northern Gaza After U.S. Warning",
        "date": "2024-10-16",
        "content": "There was no official response from the Israeli government, a day after the United States threatened consequences if it didn’t let more relief into Gaza within 30 days."
    },
    {
        "title": "Early Votes Pour In, and a U.S. Warning to Israel Over Gaza",
        "date": "2024-10-16",
        "content": "Plus, the new hot item on wedding registries."
    },
    {
        "title": "The Race That Could Tip Control of the Senate",
        "date": "2024-10-16",
        "content": "Montana’s three-term Democratic senator, Jon Tester, is facing a tough race with increasingly high stakes."
    },
    {
        "title": "Trump Draws, and Repels, Nevada Latinos With His Anti-Immigrant Message",
        "date": "2024-10-16",
        "content": "For some, Donald J. Trump’s incessant attacks on immigrants are too much. Still, many appear prepared to look past his escalations and back a candidate they believe will help their livelihoods."
    },
    {
        "title": "A Crowd of Republicans Will Join Harris at a Pennsylvania Stop",
        "date": "2024-10-16",
        "content": "The visit will take place near the Revolutionary War site where George Washington crossed the Delaware."
    },
    {
        "title": "Why Us vs. Them Is Not Such a Bad Way to See the World",
        "date": "2024-10-16",
        "content": "Two new books by psychologists explore the roots of group identity, arguing that it is natural and potentially useful — even in polarized times."
    },
    {
        "title": "Teens, Do You Feel Represented in This Election?",
        "date": "2024-10-16",
        "content": "As the 2024 election heats up, Headway is asking teenagers to weigh in on whether today’s candidates are addressing their concerns."
    },
    {
        "title": "Presidents in Movies Always Seem to Know What They’re Doing. In Real Life …",
        "date": "2024-10-16",
        "content": "Hollywood’s polished leaders and legible story arcs never quite imagined the places real-life American politics would go."
    },
    {
        "title": "In Case of an Election Crisis, This Is What You Need to Know",
        "date": "2024-10-16",
        "content": "We have just a short time to understand the challenges across state legislatures, Congress, executive branches and elected judges."
    },
    {
        "title": "Fast, Feisty and Plenty of Cancún: Takeaways From the Senate Debate in Texas",
        "date": "2024-10-16",
        "content": "Senator Ted Cruz and his Democratic challenger, Representative Colin Allred, packed a lot of attacks, mostly about policy, into a quick and combative hourlong debate."
    },
    {
        "title": "Trump Has Turned It Up to 11",
        "date": "2024-10-16",
        "content": "The former president is so dependent on racial and ethnic antagonism that without it, he would be a marginal figure."
    },
    {
        "title": "Big Money Flowed to Pro-Trump Groups in the Past Three Months",
        "date": "2024-10-16",
        "content": "Three people — Elon Musk, Miriam Adelson and Dick Uihlein — put a combined $220 million into groups supporting Donald J. Trump in July, August and September."
    },
    {
        "title": "Elon Musk Is Going All In to Elect Donald Trump",
        "date": "2024-10-16",
        "content": "Elon Musk, the richest man in the world, has involved himself in the U.S. election in a manner unparalleled in modern history. Theodore Schleifer, who covers campaign finance and billionaires for The New York Times, explains how Musk, who owns the..."
    },
    {
        "title": "Small-Town Pennsylvania Is Changing, and Democrats See Opportunity",
        "date": "2024-10-16",
        "content": "Lancaster County, famous for its Amish communities, regularly votes Republican. But the demographics are shifting here and throughout the state."
    },
    {
        "title": "Is Elon Musk’s Brazilian Nemesis Saving Democracy or Hurting It?",
        "date": "2024-10-16",
        "content": "Brazil’s top court expanded its power to protect democracy. But some are wondering whether the court now represents the threat."
    },
    {
        "title": "The Progressive Politicians Who Failed San Francisco",
        "date": "2024-10-16",
        "content": "Aaron Peskin, a little-known progressive politician, bears responsibility for some of San Francisco’s biggest problems."
    },
    {
        "title": "What Teenagers Told Us About Their Faith in U.S. Politics",
        "date": "2024-10-16",
        "content": "Most teens who responded to the Headway Election Challenge thought a vote could make a difference, but they don’t trust the overall system to address issues that matter to them."
    },
    {
        "title": "The University of Michigan Doubled Down on D.E.I. What Went Wrong?",
        "date": "2024-10-16",
        "content": "A decade and a quarter of a billion dollars later, students and faculty are more frustrated than ever."
    },
    {
        "title": "These 9 Women Were Solidly With Trump. Here’s What Has Changed.",
        "date": "2024-10-16",
        "content": "The participants discuss how Kamala Harris’s entry into the race changed — or didn’t change — their thinking about the election."
    },
    {
        "title": "Global Electricity Demand Is Rising Faster Than Expected, I.E.A. Says",
        "date": "2024-10-16",
        "content": "A surge in power use worldwide could make it harder for nations to slash emissions and keep global warming in check."
    },
    {
        "title": "Judge Blocks Hand-Counting of Election Ballots in Georgia",
        "date": "2024-10-16",
        "content": "The ruling was confined to the current election, halting the measure from going into effect for 2024 while the judge further weighs its merits in the future."
    },
    {
        "title": "In Pennsylvania, Walz Says Immigrants Aren’t the Outsiders: Trump and Vance Are",
        "date": "2024-10-16",
        "content": "The Democratic vice-presidential nominee unveiled his ticket’s plan targeted at rural voters — including those protesting his visit."
    },
    {
        "title": "Trump Escalates Threats to Political Opponents He Deems the ‘Enemy’",
        "date": "2024-10-16",
        "content": "Never before has a presidential nominee openly suggested turning the military on Americans simply because they oppose his candidacy. With voting underway, Donald Trump has turned to dark vows of retribution."
    },
    {
        "title": "At Town Hall on Women’s Issues, Trump Renews ‘Enemy Within’ Talk",
        "date": "2024-10-16",
        "content": "Donald Trump fielded questions from an audience of all women in Georgia for a Fox News event to be broadcast on Wednesday morning."
    },
    {
        "title": "Biden Takes On Campaign Duty in Pennsylvania, Celebrating Unions",
        "date": "2024-10-16",
        "content": "As Jill Biden and JD Vance also made stops around Philadelphia, the president’s visit highlighted the intense struggle to persuade voters in what may be the most critical swing state."
    },
    {
        "title": "Five Takeaways From Kamala Harris’s Interview With Charlamagne Tha God",
        "date": "2024-10-16",
        "content": "During a free-flowing interview that was by turns friendly and pointed, the vice president went beyond her previous remarks in casting Donald Trump as an authoritarian."
    },
    {
        "title": "The View of the Election from One Philly Barbershop",
        "date": "2024-10-15",
        "content": "A round-table event offers a glimpse of the challenges Harris faces and the effort to overcome them."
    },
    {
        "title": "Asked About Conversations With Putin, Trump Dodges: ‘I Don’t Talk About That’",
        "date": "2024-10-15",
        "content": "The former president, who once pushed to prosecute a former secretary of state for talking with foreign officials, said that it would be “a good thing” for himself to have secretly kept in touch with President Vladimir V. Putin of Russia — if he d..."
    },
    {
        "title": "Harris Needs a Closing Argument. Here’s One.",
        "date": "2024-10-15",
        "content": "Trump turned us into a nation of haters. He’ll do it again if he wins next month."
    },
    {
        "title": "Washington Post C.E.O. Elevates Deal-Making to a Top Priority",
        "date": "2024-10-15",
        "content": "Will Lewis has said he has a mandate from the paper’s owner, Jeff Bezos, to grow the business, including through acquisitions."
    },
    {
        "title": "Georgia Officials Report Record Turnout on First Day of Early Voting",
        "date": "2024-10-15",
        "content": "Democrats and Republicans alike have crusaded for residents to get to the polls early as Donald Trump and Kamala Harris aggressively seek the state’s 16 electoral votes."
    },
    {
        "title": "Meet the Election Denier Forecasting the 2024 Race",
        "date": "2024-10-15",
        "content": "Seth Keshel has become a darling among election deniers by factoring widespread voter fraud — the existence of which has been widely debunked — into his election predictions."
    },
    {
        "title": "Trump Signals Skepticism of Google Breakup, Citing Competition With China",
        "date": "2024-10-15",
        "content": "The former president also said he would do “something” to make Google “more fair” if he regained the presidency."
    },
    {
        "title": "Wednesday Briefing: U.S. Warns it May Cut Israel’s Military Aid",
        "date": "2024-10-15",
        "content": "Plus, an investigation into China’s panda breeding program."
    },
    {
        "title": "Trump Brags About His Math Skills and Economic Plans. Experts Say Both Are Shaky.",
        "date": "2024-10-15",
        "content": "In a combative interview, the former president hinted at even higher tariffs as an economic magic bullet."
    },
    {
        "title": "Nearly 100 People Are Still Missing in North Carolina After Hurricane Helene",
        "date": "2024-10-15",
        "content": "Search and rescue teams are still looking for the missing, officials said, with 95 deaths already attributed to the storm’s wrath in the state."
    },
    {
        "title": "U.S. Warns Israel of Military Aid Cut if Gazans Don’t Get More Supplies",
        "date": "2024-10-15",
        "content": "The demand from Israel’s closest ally came amid reports that the humanitarian catastrophe in the Gaza Strip has grown still worse in recent weeks."
    },
    {
        "title": "Trump Says It Would Be a ‘Smart Thing’ if He Had Talked to Putin",
        "date": "2024-10-15",
        "content": "Donald J. Trump declined to comment on whether he’d talked with the Russian president since leaving office. But he added, “If I have a relationship with people, that’s a good thing.”"
    },
    {
        "title": "Abortion Could Decide Control of State Supreme Courts",
        "date": "2024-10-15",
        "content": "In Michigan, Ohio, Arizona and elsewhere, progressive court candidates are hoping that the abortion issue that helped conservatives remake the federal judiciary will work for them this time."
    },
    {
        "title": "Ted Cruz and Colin Allred Face Off in Texas Senate Debate",
        "date": "2024-10-15",
        "content": "The candidates engaged in a fiery but substantive matchup on Tuesday night, as polls showed Mr. Cruz with a slight lead."
    },
    {
        "title": "U.S. Warns Israel to Increase Aid to Gaza or Face Consequences",
        "date": "2024-10-15",
        "content": "The warning was conveyed in a letter sent Sunday to two top Israeli officials that included the possibility of a cutoff of U.S. military aid, officials said."
    },
    {
        "title": "Mark Robinson Sues CNN Over Report Linking Him to Lewd Comments on Porn Site",
        "date": "2024-10-15",
        "content": "Mr. Robinson’s campaign for governor of North Carolina has been in crisis since the report, which the lawsuit calls “recklessly false.”"
    },
    {
        "title": "Trump Plays Music After Medical Emergencies Derail Town Hall",
        "date": "2024-10-15",
        "content": "Donald J. Trump cut questions short and started playing music after two medical emergencies in the crowd at his town-hall event in suburban Philadelphia."
    },
    {
        "title": "A Pro-Trump Ad Looks to Turn Harris’s Record as a Prosecutor Against Her",
        "date": "2024-10-15",
        "content": "The spot from one of the biggest super PACs backing Donald Trump portrays Kamala Harris as a radical leftist, especially on crime — channeling a G.O.P. law-and-order message that dates back to Nixon."
    },
    {
        "title": "The Push for Minority Voters and the Undecided",
        "date": "2024-10-15",
        "content": "Readers write about Black, Latino and undecided voters in the 2024 campaign. Also: Protection for health workers; a father’s books; Japan’s birthrate."
    },
    {
        "title": "Could the Lone Fed Dissenter Be in Line for a Powerful Role if Trump Wins?",
        "date": "2024-10-15",
        "content": "Michelle Bowman, a Trump-appointed Fed official recently cited by JD Vance, has been gaining prominence."
    },
    {
        "title": "As Black Voters Hesitate on Harris, Democrats Race to Win Them Over",
        "date": "2024-10-15",
        "content": "With a frenzy of activity, the vice president and her allies are trying to strengthen her support with Black voters, whose growing alienation the party’s leaders had not confronted directly until now."
    },
    {
        "title": "Local Officials Cannot Refuse to Certify Election Results, Georgia Judge Rules",
        "date": "2024-10-15",
        "content": "The ruling cuts at the heart of a key argument made by right-wing activists since the 2020 election, when Donald Trump sought to disrupt the certification process as part of his bid to subvert the results."
    },
    {
        "title": "Trump Leans On Creative Bookkeeping to Keep Up in Cash Race",
        "date": "2024-10-15",
        "content": "Donald J. Trump’s official campaign committee has a payroll of fewer than a dozen and has found ways for another account to pick up the tab for his rallies."
    },
    {
        "title": "Profits Leap at Goldman Sachs as Banks See Steady Economy",
        "date": "2024-10-15",
        "content": "The investment bank earned more than expected in the latest quarter, a theme for other big banks, too."
    },
    {
        "title": "With Trump Facing Threats, Security and Politics Intersect as Never Before",
        "date": "2024-10-15",
        "content": "After two assassination attempts and amid threats from Iran, Donald Trump relies for his safety on the same agencies that he has long assailed as part of a hostile deep state."
    },
    {
        "title": "Israel Tells U.S. It Won’t Hit Iran’s Oil or Nuclear Sites in Next Attack, Officials Say",
        "date": "2024-10-15",
        "content": "Instead, Israel has agreed to focus its next attack on military targets in Iran, the officials said."
    },
    {
        "title": "Republican Operatives Function as Hidden Hand Behind Pro-Trump Efforts",
        "date": "2024-10-15",
        "content": "A political nonprofit organization called Building America’s Future has raised and spent more than $100 million over the past four years."
    },
    {
        "title": "Optimism on Wall Street, and Harris Agrees to a Fox News Interview",
        "date": "2024-10-15",
        "content": "Plus, an investigation into China’s panda factories."
    },
    {
        "title": "As Harris Visits Detroit, Some Democrats See Ground To Be Made Up",
        "date": "2024-10-15",
        "content": "Democrats have long won by wide margins in Detroit, but some party leaders said the vice president needed to do more to counter an assertive Trump campaign."
    },
    {
        "title": "Trump’s Border Plans Are Light on Details but Strong on Fury",
        "date": "2024-10-15",
        "content": "The former president’s sweeping immigration proposals face daunting challenges, but voters still trust his positions more than his opponent’s."
    },
    {
        "title": "Harris Has Raised $1 Billion. Can She Get Donors to Give More?",
        "date": "2024-10-15",
        "content": "The sheer amount of money Kamala Harris has raised in her run for president has had unintended consequences."
    },
    {
        "title": "Two Opinion Columnists on Melania Trump’s Memoir",
        "date": "2024-10-15",
        "content": "Pamela Paul and Carlos Lozada dig into the former first lady’s “book-adjacent object.”"
    },
    {
        "title": "Can the Stock Market Keep Going Up? Market Watchers Think So.",
        "date": "2024-10-15",
        "content": "The bullishness on Wall Street is largely based on confidence that the Federal Reserve will tame inflation, the economy will remain solid and corporate earnings will continue to grow."
    },
    {
        "title": "The Hard Truth About Montana and Jon Tester’s Senate Race",
        "date": "2024-10-15",
        "content": "The state’s changing electorate and America’s polarized politics have turned Montana’s Senate race into the most consequential of the year."
    },
    {
        "title": "What’s So Funny About a Dictator? Venezuela’s Comedians-in-Exile Have Ideas",
        "date": "2024-10-15",
        "content": "A generation that fled political persecution and economic hardship is finding a way to laugh amid the pain."
    },
    {
        "title": "Want More Inflation? Go Ahead, Let Presidents Meddle With the Fed",
        "date": "2024-10-15",
        "content": "When presidents try to influence the central bank, they tend to push for lower interest rates — and that’s the problem."
    },
    {
        "title": "Need Help Understanding the Election? Try These Audiobooks",
        "date": "2024-10-15",
        "content": "Gripping histories, cleareyed memoirs and satirical fiction can help you make sense of our political moment."
    },
    {
        "title": "Fanfare for a Common Building",
        "date": "2024-10-15",
        "content": "An apartment house on the Upper West Side turns 100."
    },
    {
        "title": "How a Man Imprisoned in New York Could Sway a Key House Race in Alaska",
        "date": "2024-10-15",
        "content": "Eric Hafner, who is serving a 20-year sentence, is running to represent a state in which he has never set foot. He could play the spoiler under Alaska’s ranked-choice system."
    },
    {
        "title": "Trump Bobs His Head to Music for 30 Minutes in Odd Town Hall Detour",
        "date": "2024-10-15",
        "content": "After multiple interruptions, Donald Trump cut off questions and seemed to decide that it would be more enjoyable for all concerned — and, it appeared, for himself —  if he fired up his campaign playlist."
    },
    {
        "title": "Harris Uses Trump’s Own Words to Attack Him as ‘Unhinged’: ‘Roll the Clip’",
        "date": "2024-10-15",
        "content": "At a rally in Pennsylvania, in a swing county in a swing state, Vice President Kamala Harris played clips of Donald Trump describing critics as an “enemy from within,” drawing jeers from her crowd."
    },
    {
        "title": "America Is on the Brink of a Great Political Realignment. It’s Already Visible in Arizona.",
        "date": "2024-10-14",
        "content": "He and his acolytes purged the G.O.P. to make it smaller and more strident."
    },
    {
        "title": "A Harris Ad Uses the Hurricanes to Try to Inflict Damage on Trump",
        "date": "2024-10-14",
        "content": "Two former homeland security officials under Donald J. Trump describe how he tried to withhold disaster aid from states that he hadn’t won."
    },
    {
        "title": "How Door Knocking Is Going in a Wisconsin Swing County",
        "date": "2024-10-14",
        "content": "Door County, Wis., has picked the presidential winner since 1996. Last time, the margin was 292 votes, so the campaigns are trying to reach every household."
    },
    {
        "title": "Conservative Activist Seizes on Passages From Harris Book",
        "date": "2024-10-14",
        "content": "A report by Christopher Rufo says the Democratic presidential nominee copied five short passages for her 2009 book on crime. A plagiarism expert said the lapses were not serious."
    },
    {
        "title": "Kamala Harris Sets an Interview With a Not-So-Friendly Outlet: Fox News",
        "date": "2024-10-14",
        "content": "The interview, to be conducted by the anchor Bret Baier in Pennsylvania, will air Wednesday at 6 p.m. Eastern."
    },
    {
        "title": "Doctors, A.I. and Empathy for Patients",
        "date": "2024-10-14",
        "content": "Readers discuss a guest essay about ChatGPT’s bedside manner. Also: Breast cancer screenings; Walz’s missteps; supporting the mental health of schoolchildren."
    },
    {
        "title": "Most Voters Have Been Offended by Trump. It’s Not Always a Deal Breaker.",
        "date": "2024-10-14",
        "content": "Voters who said they had been offended by Donald J. Trump, but not recently, supported him by a wide margin."
    },
    {
        "title": "Michigan Republican Blames ‘Proofing Error’ for Misleading Ad in Black-Owned Newspaper",
        "date": "2024-10-14",
        "content": "The state’s legislative Black caucus has asked the attorney general and a county prosecutor to investigate Tom Barrett’s congressional campaign for potential voter disenfranchisement."
    },
    {
        "title": "Harris’s Final Challenge: Restore a Splintering Democratic Coalition",
        "date": "2024-10-14",
        "content": "Defections from Black and Latino voters are making Kamala Harris more dependent on white, suburban voters — and complicating her path to victory."
    },
    {
        "title": "Harris Steps Up a Major Push for Black Voters",
        "date": "2024-10-14",
        "content": "The vice president released a plan to help Black men financially, held interviews with two Black media outlets and put out targeted ads in battleground states."
    },
    {
        "title": "State of the Race: A Close Race Gets Closer",
        "date": "2024-10-14",
        "content": "There’s no sign that a deluge of surveys from Republican-aligned firms is meaningfully affecting the polling averages."
    },
    {
        "title": "Where Polls Can Mess Up (and What Pollsters Do About It)",
        "date": "2024-10-14",
        "content": "Conducting a poll isn’t an exact science. The process is susceptible to lots of common problems and baked-in biases — more than just the “margin of error.”"
    },
    {
        "title": "NASA Launches Europa Clipper to Explore an Ocean Moon’s Habitability",
        "date": "2024-10-14",
        "content": "The spacecraft lifted off Monday on a SpaceX Falcon Heavy rocket, embarking on a nearly six-year journey to Jupiter."
    },
    {
        "title": "Can Charlotte, N.C., Deliver for Kamala Harris?",
        "date": "2024-10-14",
        "content": "Mecklenburg County leans liberal but has broken Democrats’ hearts in past elections with low voter turnout. A new party leader wants to change that."
    },
    {
        "title": "The Trump Voters Who Don’t Believe Trump",
        "date": "2024-10-14",
        "content": "When the former president endorses violence and proposes using the government to attack his enemies, many of his supporters assume it’s just an act."
    },
    {
        "title": "Three Weeks to Go, and That’s All Anyone Is Sure Of",
        "date": "2024-10-14",
        "content": "It’s been a long year. That won’t stop it from being a very long 22 days."
    },
    {
        "title": "Russian Oil Flows Through Western ‘Price Cap’ as Shadow Fleet Grows",
        "date": "2024-10-14",
        "content": "A report shows how Russia has largely evaded sanctions aimed at limiting its revenue from oil sales."
    },
    {
        "title": "In a Tight Presidential Race, Third-Party Candidates Present a Wild Card",
        "date": "2024-10-14",
        "content": "In every battleground state this year, there is at least one third-party or independent candidate on the ballot. The Democrats have been more openly concerned than Republicans."
    },
    {
        "title": "How Wall St. Is Subtly Shaping the Harris Economic Agenda",
        "date": "2024-10-14",
        "content": "The vice president has repeatedly incorporated suggestions from business executives into her economic agenda."
    },
    {
        "title": "Food Is What We Have In Common. Why Don’t We Hear More From the Candidates About It?",
        "date": "2024-10-14",
        "content": "Food is the springboard to talk about a host of issues, including climate, economic justice, public health and labor."
    },
    {
        "title": "In Rural Wisconsin, Race Is an Undercurrent of the Presidential Election",
        "date": "2024-10-14",
        "content": "Former President Donald Trump’s recent attacks on his opponent could affect the vote. “It’s a stirring of the pot,” one voter said."
    },
    {
        "title": "A Fact Checker Reflects on Our Age of Political Lying",
        "date": "2024-10-14",
        "content": "In “Beyond the Big Lie,” Bill Adair worries that the world of spin and fabrication in America has gotten out of hand."
    },
    {
        "title": "Kash Patel: The Magical Rise of a Self-Described ‘Wizard’ in Trump World",
        "date": "2024-10-14",
        "content": "The MAGA loyalist Mr. Patel aims to run the C.I.A. if Donald Trump wins the presidency. But critics say his swagger masks deep inexperience."
    },
    {
        "title": "In Heated House Race, a Moderate Republican Goes Full Trump",
        "date": "2024-10-14",
        "content": "Representative Marc Molinaro of New York, running against Josh Riley, a Democrat, has accused recent immigrants of committing violent crimes and killing pets."
    },
    {
        "title": "What China’s Leaders Grasp About Another Trump Term",
        "date": "2024-10-14",
        "content": "Trump remains well outside a bipartisan consensus on competing with China."
    },
    {
        "title": "Trump Receives Endorsement from Border Patrol Union",
        "date": "2024-10-14",
        "content": "The National Border Patrol Council formally pledged its support for the former president, appearing onstage with him during a rally in Arizona."
    },
    {
        "title": "Harris Rallies in North Carolina",
        "date": "2024-10-14",
        "content": "The vice president criticized former President Donald J. Trump, calling him “weak and unstable.”"
    },
    {
        "title": "Man Is Arrested on Weapons Charges Heading to Trump Rally in Coachella, Officials Say",
        "date": "2024-10-14",
        "content": "Law-enforcement officials said that former President Donald J. Trump was not in any danger, and the man was released on bail."
    },
    {
        "title": "Harris Suggests Trump Is ‘Weak and Unstable’ in Pointed Challenge",
        "date": "2024-10-13",
        "content": "Kamala Harris asked why Donald J. Trump had not released his medical records, appeared on “60 Minutes” or agreed to a second debate."
    },
    {
        "title": "Harris Sends a Secret Weapon to a Georgia Fish Fry: Bill Clinton",
        "date": "2024-10-13",
        "content": "With early voting set to begin in Georgia, the Harris campaign is sending the former president to get out the vote in rural areas."
    }
]