[
    {
        "title": "On the Trail, Vance Is Dogged by Questions About Trump’s Loss in 2020",
        "date": "2024-10-12",
        "content": "Speaking at a factory for military vehicles in Johnstown, Pa., Senator JD Vance of Ohio again refused to acknowledge former President Donald J. Trump’s defeat in the 2020 election."
    },
    {
        "title": "Letters in Song Lyrics and Poetry",
        "date": "2024-10-12",
        "content": "These are some of our favorites from among more than 800 submissions in response to our request for variations on traditional letters."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters in  Arizona",
        "date": "2024-10-12",
        "content": "Results of a New York Times/Siena College poll conducted among 808 likely voters in Arizona from Oct. 7 to 10, 2024."
    },
    {
        "title": "A Mystery Repeats: Harris Up 4 in Pennsylvania, and Trump Up 6 in Arizona",
        "date": "2024-10-12",
        "content": "Being uncertain about our earlier poll results but finding almost the same numbers the next time around."
    },
    {
        "title": "Who Are These People Interviewing Trump and Harris?",
        "date": "2024-10-12",
        "content": "For the presidential candidates, the media future is now."
    },
    {
        "title": "Where Is the Fierce Urgency of Beating Trump?",
        "date": "2024-10-12",
        "content": "The vice president needs to pull out all the stops to get out of her stall."
    },
    {
        "title": "This Election Will Need More Heroes",
        "date": "2024-10-12",
        "content": "Honorable public servants of both parties upheld democracy after the 2020 election. America is counting on them again to do their duty."
    },
    {
        "title": "This Is Why Trump Imagines He Will Win",
        "date": "2024-10-12",
        "content": "The way he is now running is the best window we have into what kind of president he will be in a second term."
    },
    {
        "title": "A Conversation With JD Vance",
        "date": "2024-10-12",
        "content": "The Republican vice-presidential candidate rejects the idea that he’s changed, defends his rhetoric and still won’t say if Trump lost in 2020."
    },
    {
        "title": "‘The Interview’: A Conversation With JD Vance",
        "date": "2024-10-12",
        "content": "In this interview, Senator JD Vance, the Republican vice-presidential nominee, rejects the idea that he has changed, defends his rhetoric and still won’t say whether former President Donald J. Trump lost in 2020."
    },
    {
        "title": "Daring Trump, Harris’s Campaign Releases Medical Information",
        "date": "2024-10-12",
        "content": "Vice President Kamala Harris released a letter from her doctor saying that she is in “excellent health,” as her campaign tries to capitalize on the lack of health information shared by her rival."
    },
    {
        "title": "5 Takeaways From Vance’s Interview With The New York Times",
        "date": "2024-10-12",
        "content": "Pressed to say if he thought the 2020 election was stolen, JD Vance repeatedly sidestepped. And he defended the sentiment behind his “childless cat ladies” comment, even as he regretted his word choice."
    },
    {
        "title": "Trump Leads in Arizona as Harris Holds an Edge in Pennsylvania, New Polls Show",
        "date": "2024-10-12",
        "content": "The latest Times/Inquirer/Siena polls found Donald Trump with a six-point advantage in Arizona, and Kamala Harris with a four-point lead in Pennsylvania."
    },
    {
        "title": "A Frustrated Trump Lashes Out Behind Closed Doors Over Money",
        "date": "2024-10-12",
        "content": "Donald J. Trump is feeling aggrieved, unappreciated by donors and fenced in by security concerns in the final stretch of the race."
    },
    {
        "title": "Christian Conservatives, Looking to Mobilize Women, Turn to a Biblical Queen",
        "date": "2024-10-12",
        "content": "Alarmed by abortion and transgender rights, Christian activists are invoking the Old Testament story of Esther, the Jewish orphan who bravely saved her people."
    },
    {
        "title": "Black Voters Drift From Democrats, Imperiling Harris’s Bid, Poll Shows",
        "date": "2024-10-12",
        "content": "Vice President Kamala Harris is on track to win a majority of Black voters, and has brought many back to her party since taking over for President Biden. Still, a significant gap in support persists."
    },
    {
        "title": "Tester’s Fight for Political Survival Is Democrats’ Last Stand on the Great Plains",
        "date": "2024-10-12",
        "content": "Once able to win on the prairie, the Democratic Party sees the Senate race in Montana as a final test of whether it can still be successful in heavily rural states that have turned deep red."
    },
    {
        "title": "Twitter Barred Them. What Happened When Elon Musk Brought Them Back?",
        "date": "2024-10-12",
        "content": "Many users who were reinstated by X have continued to share the kinds of false narratives and conspiracies that once got them suspended."
    },
    {
        "title": "California Tries ‘Trump-Proofing’ Its Climate Policies",
        "date": "2024-10-12",
        "content": "A second Trump administration would be expected to shred climate policies. California officials are devising ways to insulate its environmental regulations."
    },
    {
        "title": "One of the World’s Most Immigrant-Friendly Countries Is Changing Course",
        "date": "2024-10-12",
        "content": "Canada has long had one of the world’s most open immigration policies. Now, faced with a growing popular backlash, it’s changing the rules."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Black Registered Voters",
        "date": "2024-10-12",
        "content": "Results of a nationwide New York Times/Siena College poll conducted among 589 Black voters from Sept. 29 to Oct. 6, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Inquirer/Siena Poll of the Likely Electorate in Pennsylvania",
        "date": "2024-10-12",
        "content": "Results of a New York Times/Philadelphia Inquirer/Siena College poll conducted among 857 likely voters in Pennsylvania from Oct. 7 to 10, 2024."
    },
    {
        "title": "Toplines: October 2024 Times/Inquirer/Siena Poll of Registered Voters in Pennsylvania",
        "date": "2024-10-12",
        "content": "Results of a New York Times/Philadelphia Inquirer/Siena College poll conducted among 857 registered voters in Pennsylvania from Oct. 7 to 10, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Likely Electorate in Arizona",
        "date": "2024-10-12",
        "content": "Results of a New York Times/Siena College poll conducted among 808 likely voters in Arizona from Oct. 7 to 10, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Black Likely Electorate",
        "date": "2024-10-12",
        "content": "Results of a nationwide New York Times/Siena College poll conducted among 589 Black voters from Sept. 29 to Oct. 6, 2024."
    },
    {
        "title": "Harris Says She Would Form Bipartisan Council of Advisers",
        "date": "2024-10-12",
        "content": "The stop in Arizona was part of the Harris campaign’s strategy to court Republicans disaffected with former President Donald J. Trump."
    },
    {
        "title": "The OB-GYN Running on Abortion Rights in Conservative Wisconsin",
        "date": "2024-10-12",
        "content": "Dr. Kristin Lyerly is looking to make inroads in a heavily Catholic part of the state."
    },
    {
        "title": "Trump Rally in Aurora, Colo., Is Marked by Nativist Attacks",
        "date": "2024-10-12",
        "content": "The former president continued to make claims about the city that have been disputed by local officials, including its Republican mayor."
    },
    {
        "title": "Arizona Democrats Shut Down a Phoenix Campaign Office After Shootings",
        "date": "2024-10-11",
        "content": "The office was hit three times after hours, once with a BB gun and twice with a firearm. No one was hurt, the authorities said."
    },
    {
        "title": "Obama’s Admonishing Tone to Black Men Presents a Risk for Democrats",
        "date": "2024-10-11",
        "content": "The former president’s remarks that some Black men are not “feeling the idea” of a female president were blunt and urgent, but also potentially alienating for a vital group of Democratic voters."
    },
    {
        "title": "Swing State Voters: What’s in Your Mailbox?",
        "date": "2024-10-11",
        "content": "Share images of your political correspondence with the On Politics newsletter."
    },
    {
        "title": "Trump Scaled Up His Efforts to Stoke Immigration Fears",
        "date": "2024-10-11",
        "content": "Also, the Nobel Peace Prize went to Japanese atomic bomb survivors. Here’s the latest at the end of Friday."
    },
    {
        "title": "Why Nevada Latinos Are Losing Faith in Government",
        "date": "2024-10-11",
        "content": "Democrats have found their popularity with the Nevada electorate slipping. The fallout from the pandemic, including a struggling economy, has fostered mistrust in the government."
    },
    {
        "title": "A Nebraska Senate Ad Lets One Mechanic Throw a Wrench at Another",
        "date": "2024-10-11",
        "content": "Deb Fischer, the Republican incumbent, faces a stiff challenge from a union leader, Dan Osborn, running as an independent. Her latest ad calls him a “Democrat in disguise.”"
    },
    {
        "title": "Inside Donald Trump’s Shadow Presidency",
        "date": "2024-10-11",
        "content": "In the years since he left the White House, former President Donald J. Trump has remained a force in international politics, meeting with a number of foreign leaders and operating out of his Mar-a-Lago estate in Florida."
    },
    {
        "title": "Trump Is Said to Consider Brooke Rollins for White House Chief of Staff",
        "date": "2024-10-11",
        "content": "Ms. Rollins, a conservative lawyer who ran domestic policy in the Trump administration, is said to be under consideration for the role should Donald J. Trump win the election."
    },
    {
        "title": "In Michigan, Walz Assails Trump’s Record on Manufacturing",
        "date": "2024-10-11",
        "content": "The Minnesota governor running for vice president on the Democratic ticket also had strong words for Elon Musk, the billionaire businessman who is working to get former President Donald J. Trump elected."
    },
    {
        "title": "In Texas Senate Race, Cruz and Allred Duel Over Youth Sports Without Saying ‘Trans.’",
        "date": "2024-10-11",
        "content": "Ted Cruz’s re-election campaign has poured resources into attack ads that focus on transgender participation in youth sports. His Democratic opponent, Representative Colin Allred, responded with his own ad."
    },
    {
        "title": "‘Pod Save America’ Won’t Quit",
        "date": "2024-10-11",
        "content": "The hosts of the political podcast have outlasted the wave of anti-Trump #Resistance that made it popular. That’s where things get complicated."
    },
    {
        "title": "Hurricanes, Climate Change and the 2024 Election",
        "date": "2024-10-11",
        "content": "Readers discuss recent hurricanes and actions that citizens can take. Also: Jack Smith’s timing; the Supreme Court and the campaign; therapy as health care; a Trumpian character."
    },
    {
        "title": "As Trump Arrives, Aurora Insists It’s Not the ‘War Zone’ He Sees",
        "date": "2024-10-11",
        "content": "The former president held rally in a Colorado city he falsely claims was overtaken by violent immigrants from Venezuela. The city’s leaders, Republicans and Democrats alike, tried to pre-emptively fact-check him."
    },
    {
        "title": "These Arizona Women Are Keeping Kamala Harris’s Hopes Alive",
        "date": "2024-10-11",
        "content": "A conversation among “mom friends” in suburban Phoenix shows the depths of Donald J. Trump’s trouble with a key slice of female voters."
    },
    {
        "title": "Harris to Appear on ‘The Breakfast Club’ With Charlamagne Tha God",
        "date": "2024-10-11",
        "content": "The radio show hosted by the entertainer and author has long been a venue for candidates to appeal to Black voters."
    },
    {
        "title": "Vance, Given 5 Chances to Say Trump Lost in 2020, Takes None",
        "date": "2024-10-11",
        "content": "In an interview with The New York Times, Senator JD Vance repeatedly refused to acknowledge Donald J. Trump’s defeat and said he would not have certified the 2020 results."
    },
    {
        "title": "Vance Refuses to Acknowledge That Trump Lost the 2020 Election",
        "date": "2024-10-11",
        "content": "During an interview with Lulu Garcia-Navarro, host of “The Interview,” Senator JD Vance of Ohio repeatedly dodged a question on whether he believed Donald J. Trump lost the 2020 election."
    },
    {
        "title": "Trump Aides Sought Enhanced Security for Closing Stages of Campaign",
        "date": "2024-10-11",
        "content": "Susie Wiles, a top Trump campaign adviser, was in contact with the White House chief of staff and the head of the Secret Service seeking military assets and other steps."
    },
    {
        "title": "Big Banks Steer Through ‘Treacherous’ Conditions",
        "date": "2024-10-11",
        "content": "Profits fell at JPMorgan and Wells Fargo, but the lenders reported results that were largely better than had been expected, a sign that the economy remained solid — for now."
    },
    {
        "title": "‘Everything Is Politicized’: Chris Christie on Trump, Harris and Hurricane Lies",
        "date": "2024-10-11",
        "content": "How did we get here?"
    },
    {
        "title": "In Wisconsin, Democrats Hope Competing Down Ballot Helps Harris, Too",
        "date": "2024-10-11",
        "content": "For the first time in 13 years, Wisconsin Democrats are contesting a number of local races. Even a few thousand voters energized by the candidates at their door could make a difference in a tight presidential contest."
    },
    {
        "title": "I’ve Covered Politics for 50 Years. Here’s Why So Much Hinges on Electing Kamala Harris.",
        "date": "2024-10-11",
        "content": "The Democratic candidate would bring three things the country desperately needs: stability, unity and optimism."
    },
    {
        "title": "Musk Is Going All In to Elect Trump",
        "date": "2024-10-11",
        "content": "Elon Musk is planting himself in Pennsylvania, has brought his brain trust to help and may even knock on doors himself."
    },
    {
        "title": "I Was Trump’s Ghostwriter. A New Biopic Gets the Most Important Thing Right.",
        "date": "2024-10-11",
        "content": "Critics may argue about specific factual details, but a new account of Trump’s ascent jibes with everything I saw with my own eyes."
    },
    {
        "title": "The Problem With This Conspiracy Theory Is Reality",
        "date": "2024-10-11",
        "content": "It’s not indoctrination that’s keeping a majority of younger voters out of the Republican column."
    },
    {
        "title": "Many Haitians Prospered in Springfield, Ohio. Then Came the Hate.",
        "date": "2024-10-11",
        "content": "A young family came to love the city where they rebuilt their lives and bought a home. Since a false rumor spread, they have scrapped outings, even to the park."
    },
    {
        "title": "They Were Loyal Republicans — Until Trump and Abortion Bans",
        "date": "2024-10-11",
        "content": "Abortion is emerging as a major issue in this election, inspiring more women to show up to the polls and vote for Kamala Harris, while at the same time driving a wedge between some conservative women and Donald Trump. That dynamic is especially vi..."
    },
    {
        "title": "‘Founder Mode’ Explains the Rise of Trump in Silicon Valley",
        "date": "2024-10-11",
        "content": "A trendy management style called “founder mode” illustrates Silicon Valley’s growing tilt toward authoritarianism."
    },
    {
        "title": "The Market Has Been Fabulous, Maybe Excessively So",
        "date": "2024-10-11",
        "content": "You may not realize how great the stock market has been. But, our columnist says, it can’t keep rising at this pace for long."
    },
    {
        "title": "The Supreme Court Has Grown Too Powerful. Congress Must Intervene.",
        "date": "2024-10-11",
        "content": "Lawmakers must assert their power to reject the justices’ interpretations of the Constitution and enact their own."
    },
    {
        "title": "A Democratic Boss Is in Prison. He Still Has 2 Public School Jobs.",
        "date": "2024-10-11",
        "content": "The Democratic chairman of Hillside, N.J., is serving a six-month prison term. He got an $80,000 teaching job in the township after pleading guilty to tax fraud."
    },
    {
        "title": "Jimmy Kimmel Debunks the Government-Hurricane-Control Theory",
        "date": "2024-10-11",
        "content": "“The only person who can control the weather is Beyoncé,” Kimmel said on Thursday."
    },
    {
        "title": "Seven Ways to Love Better",
        "date": "2024-10-11",
        "content": "Reading some 200,000 love stories has taught me a few lessons about love and life. Here are the ones that help me most."
    },
    {
        "title": "Obama Rallies for Harris in Pittsburgh",
        "date": "2024-10-11",
        "content": "The former president made the case for Vice President Kamala Harris’s bid for the White House by delivering a takedown of Donald Trump as unable to relate to everyday Americans."
    },
    {
        "title": "Harris Walks Fine Line on Immigration at Univision Town Hall",
        "date": "2024-10-11",
        "content": "The event in Las Vegas featured emotional questions from voters on health care and the economy — and displayed the balance Kamala Harris is seeking on tough border rules and paths to citizenship."
    },
    {
        "title": "A Stern Obama Tells Black Men to Drop ‘Excuses’ and Support Harris",
        "date": "2024-10-11",
        "content": "Before speaking at a rally for Vice President Kamala Harris in Pittsburgh, the former president spoke directly to Black male voters in an effort to bolster flagging support."
    },
    {
        "title": "In the Middle (Class) of It All",
        "date": "2024-10-10",
        "content": "Voters in Wisconsin are weighing which candidate better understands their economic anxieties."
    },
    {
        "title": "Judge Approves Limited Further Release of Evidence in Trump Election Case",
        "date": "2024-10-10",
        "content": "An appendix to a high-profile prosecutorial brief, released last week, could become public next week. But much of it would be redacted."
    },
    {
        "title": "Tim Walz Takes His Folksiness on the Road, Trying Not to Say ‘Stupid Things’",
        "date": "2024-10-10",
        "content": "On a swing through the Southwest, the Democratic vice-presidential candidate received a warm welcome — and had to clean up his remarks about the Electoral College."
    },
    {
        "title": "How Harris Can Finish Strong",
        "date": "2024-10-10",
        "content": "Some tips from novelists and screenwriters on how to keep audiences’ attention."
    },
    {
        "title": "In a Rambling Speech, Trump Offers Gripes and Yet Another Tax Cut",
        "date": "2024-10-10",
        "content": "Even before this latest proposal, aimed at promoting car sales, an analysis found that the former president’s economic agenda could add $15 trillion to the nation’s debt over a decade."
    },
    {
        "title": "Millions Are Without Power After Milton Tore Through Florida",
        "date": "2024-10-10",
        "content": "Also, Republicans appear poised to win control of the Senate. Here’s the latest at the end of Thursday."
    },
    {
        "title": "Candidates Square Off on Courts, Policy and Party in Maryland Senate Debate",
        "date": "2024-10-10",
        "content": "Larry Hogan, the Republican former governor, and Angela Alsobrooks, the Democratic Prince George’s County executive, sparred over whether to expand the Supreme Court and overhaul the legislative filibuster."
    },
    {
        "title": "Trump Says He Was ‘Man of the Year.’ His Source Says It Isn’t True.",
        "date": "2024-10-10",
        "content": "Fact-checkers have found no evidence over the years that former President Donald J. Trump once received the honor in Michigan."
    },
    {
        "title": "Friday Briefing: Florida Hurricane Kills at Least 7",
        "date": "2024-10-10",
        "content": "Plus, Han Kang receives the Nobel Prize in Literature."
    },
    {
        "title": "Tim Johnson, Senator Who Came Back From an Aneurysm, Dies at 77",
        "date": "2024-10-10",
        "content": "One of the last Democrats from the Great Plains to be elected to national office, he built his career on delivering benefits to his home state, South Dakota."
    },
    {
        "title": "Billy Shaw, a Singular Hall of Fame Lineman, Dies at 85",
        "date": "2024-10-10",
        "content": "He was the only inductee to play his entire career in the American Football League, where he helped the Buffalo Bills win two championships in the 1960s."
    },
    {
        "title": "Bizarre Falsehoods About Hurricanes Helene and Milton Disrupt Recovery Efforts",
        "date": "2024-10-10",
        "content": "Experts warn that weather-related disinformation can rapidly escalate into real-world risks and distract from aid."
    },
    {
        "title": "Claudia Conway Declares Her Independence",
        "date": "2024-10-10",
        "content": "The scion and sometimes antagonist of two figures in Republican politics has re-emerged as an independent aiming to sway her fellow Gen-Z voters."
    },
    {
        "title": "‘Separated’ Review: Interrogating a Policy",
        "date": "2024-10-10",
        "content": "The latest documentary from Errol Morris looks at the Trump administration’s practice of taking children from their parents at the southern border."
    },
    {
        "title": "Reasons to Vote for Harris, Not Trump",
        "date": "2024-10-10",
        "content": "Readers respond to an editorial and critiques of the former president by those who have worked with him. Also: young voter outreach; L.G.B.T.Q. Jews; the war in Gaza; Robert Moses."
    },
    {
        "title": "Garvey’s M.L.B. Teams Are Contenders. His Senate Campaign? Not So Much.",
        "date": "2024-10-10",
        "content": "As his old teams — the Los Angeles Dodgers and the San Diego Padres — battle in the playoffs, the onetime all-star Steve Garvey finds himself an underdog in his Senate race against Adam Schiff."
    },
    {
        "title": "Kamala Harris Puts Sarah Huckabee Sanders in Her Unhumble Place",
        "date": "2024-10-10",
        "content": "Parents have no monopoly on modesty."
    },
    {
        "title": "Democrats Seize on Trump’s ‘You’re Rich as Hell’ Remarks to Donors",
        "date": "2024-10-10",
        "content": "An ad from the main super PAC backing Kamala Harris casts Donald Trump as a tycoon who will give handouts to the rich, and the vice president as the candidate of working people."
    },
    {
        "title": "Ethel Kennedy, Passionate Supporter of the Family Legacy, Dies at 96",
        "date": "2024-10-10",
        "content": "She never remarried after the assassination of her husband, Senator Robert F. Kennedy, and she devoted herself to working on behalf of the causes he had championed."
    },
    {
        "title": "As Deadline for Another Debate Passes, Trump Again Rejects a Rematch",
        "date": "2024-10-10",
        "content": "CNN said the former president had until noon on Thursday to accept an invitation to an Oct. 23 showdown with Vice President Kamala Harris, who will do a town hall with the cable network instead."
    },
    {
        "title": "25 Days to Go",
        "date": "2024-10-10",
        "content": "In the final sprint to Election Day, which voters matter most to the Harris and Trump campaigns? Watch or listen to our political round table."
    },
    {
        "title": "Consumer Price Increases Cooled, but Not as Much as Expected",
        "date": "2024-10-10",
        "content": "The Consumer Price Index is moderating, but September’s report contained both good and bad news for policymakers."
    },
    {
        "title": "Watch: ‘How Tennessee Keeps Nearly Half a Million People From Voting’",
        "date": "2024-10-10",
        "content": "Should former felons have their right to vote restored?"
    },
    {
        "title": "Supreme Court Reform Is in the Air",
        "date": "2024-10-10",
        "content": "Say no to court packing — and yes to term limits."
    },
    {
        "title": "Why Democratic Senate Control Seems to Be Slipping Away",
        "date": "2024-10-10",
        "content": "A Times/Siena poll shows Jon Tester behind by seven points in Montana, while Colin Allred trails Ted Cruz by four in Texas."
    },
    {
        "title": "Republicans Appear Poised to Take Control of Senate, New Poll Shows",
        "date": "2024-10-10",
        "content": "The latest polling from The New York Times and Siena College shows Republicans leading in key Senate races in Montana, Texas and Florida."
    },
    {
        "title": "Obama Heads to Pennsylvania to Give Harris a Jolt of Democratic Energy",
        "date": "2024-10-10",
        "content": "The former president, one of the party’s most popular figures, will rally in Pittsburgh for Kamala Harris, as her campaign deploys its most influential surrogates in a push to get out the vote."
    },
    {
        "title": "Children’s Books About Elections That Might Inspire Grown-Ups, Too",
        "date": "2024-10-10",
        "content": "How do you explain the democratic process to future voters? Start with these lively picture books and compelling histories."
    },
    {
        "title": "A Pollster’s Guide to the Homestretch",
        "date": "2024-10-10",
        "content": "The presidential race is basically a tossup. Here’s how to understand what that means and what might happen."
    },
    {
        "title": "Trump Spreads His Politics of Grievance to Nonwhite Voters",
        "date": "2024-10-10",
        "content": "Eight years ago, he won over many white voters, who were often called the forgotten Americans. Now, he hopes to make inroads with Black and Latino voters by stoking resentments and pointing to scapegoats."
    },
    {
        "title": "The Fight Over Proposition 1 in New York",
        "date": "2024-10-10",
        "content": "Republicans are trying to frame a statewide measure to protect reproductive rights as an attack on family values."
    },
    {
        "title": "I Study Political Violence. I’m Worried About the Election.",
        "date": "2024-10-10",
        "content": "Our officials and our ballots may be in physical danger."
    },
    {
        "title": "I Was a Whistle-Blower Under Trump. Here’s What’s at Risk for Public Health.",
        "date": "2024-10-10",
        "content": "The future of America’s public health agencies looks bleak under Trump."
    },
    {
        "title": "The Good Old Days of Manufacturing Are Long Gone",
        "date": "2024-10-10",
        "content": "If manufacturing returns, it will look nothing like the renaissance being promised by Harris and Trump."
    },
    {
        "title": "Sebastian Stan and Jeremy Strong Say Their Trump Movie Is a Tragedy, Not a Mockery",
        "date": "2024-10-10",
        "content": "The “Apprentice” stars and the director Ali Abbasi say their film is a “humanistic” treatment of the former president and his mentor, Roy Cohn."
    },
    {
        "title": "Let’s Not Bring Back Jail for Swearing",
        "date": "2024-10-10",
        "content": "The latest threat to our right to speak freely comes all the way from the 1700s."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters in Montana",
        "date": "2024-10-10",
        "content": "Results of a New York Times/Siena College poll conducted among 656 likely voters in Montana from Oct. 5 to 8, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Likely Electorate in Montana",
        "date": "2024-10-10",
        "content": "Results of a New York Times/Siena College poll conducted among 656 likely voters in Montana from Oct. 5 to 8, 2024."
    },
    {
        "title": "Faced With Regional Setbacks, India Flexes Its New Economic Muscle",
        "date": "2024-10-10",
        "content": "Tapping into a fast-growing economy, Prime Minister Narendra Modi has been offering financial help to India’s neighbors as he tries to counter China’s influence."
    },
    {
        "title": "Lake and Gallego Spar Over Immigration and Abortion in Arizona Senate Debate",
        "date": "2024-10-10",
        "content": "At times, Kari Lake, the Republican candidate and close ally of Donald Trump, veered into personal attacks. Ruben Gallego, the Democrat, needled her over frequent visits to Mar-a-Lago."
    },
    {
        "title": "Vance and Walz Make Dueling Appearances, as Voting Begins in Arizona",
        "date": "2024-10-10",
        "content": "The two vice-presidential candidates crisscrossed the state on the first day of early voting, saying little of each other after their debate last week."
    },
    {
        "title": "Tim Walz Rally Is Livestreamed on Twitch in Pitch to Young Voters",
        "date": "2024-10-10",
        "content": "A streamer played World of Warcraft while commenting on the Democratic nominee’s rally speech. At one point he criticized Project 2025 and at another mused about his character: “Wait, am I dying?”"
    },
    {
        "title": "Trump Keeps the Tax Cut Promises Coming, Now for Americans Abroad",
        "date": "2024-10-10",
        "content": "Former President Donald J. Trump said in a statement that he would seek to end the “double taxation” of Americans overseas."
    },
    {
        "title": "Trump’s Remarks on Migrants Illustrate His Obsession With Genes",
        "date": "2024-10-10",
        "content": "In discussing migrants and genes, the former president used language that reflected his decades-long belief that bloodlines determine a person’s capacity for success or violence."
    },
    {
        "title": "Why Republicans Are Muddling Their Early Voting Message",
        "date": "2024-10-09",
        "content": "Republicans are encouraging people to vote early but, in some cases, making it harder to do so."
    },
    {
        "title": "In Interviews, Kamala Harris Continues to Bob and Weave",
        "date": "2024-10-09",
        "content": "Her media swing showed how she often responds to uncomfortable questions by acknowledging them, yet not fully answering them."
    },
    {
        "title": "Hurricane Milton Began Thrashing Florida’s West Coast",
        "date": "2024-10-09",
        "content": "Also, Kamala Harris has already raised more than $1 billion. Here’s the latest at the end of Wednesday."
    },
    {
        "title": "The Many Meanings of Kamala Harris’s Glock",
        "date": "2024-10-09",
        "content": "In a “60 Minutes” interview this week, the vice president shared the kind of gun she owns. Its associations with law enforcement and pop culture make it a potent symbol."
    },
    {
        "title": "Trump Plans Rally at Madison Square Garden",
        "date": "2024-10-09",
        "content": "The rally, reportedly set for late October, is part of a series of Trump campaign events planned for blue states."
    },
    {
        "title": "Brett Favre, a Personal Injury Lawyer and a 30-Second Pitch for Trump",
        "date": "2024-10-09",
        "content": "An ad in Pennsylvania, paid for by a lawyer in Florida, uses a Hall of Fame quarterback to promote Donald J. Trump on national security."
    },
    {
        "title": "With Medicare, Harris Sees a Potential Last-Minute Appeal to Voters",
        "date": "2024-10-09",
        "content": "Kamala Harris’s campaign proposal to add home health care to Medicare was a sign of the program’s growing power in American politics."
    },
    {
        "title": "The Contests, Clubs and Big Promises of Trump’s Fund-Raising Emails",
        "date": "2024-10-09",
        "content": "A review of some 7,400 emails sent by the Trump campaign turned up dozens of sweepstakes, advisory councils and other opportunities of access to Mr. Trump — and very little evidence anyone has gotten it."
    },
    {
        "title": "Thursday Briefing: Florida Braces for Hurricane Milton",
        "date": "2024-10-09",
        "content": "Plus, literature’s greatest prize."
    },
    {
        "title": "‘Joy’ Is Working for Harris, but Can It Close the Deal?",
        "date": "2024-10-09",
        "content": "The vice president needs to speak with voters directly."
    },
    {
        "title": "In an Era of Mistrust and Upheaval, Democracy Seeks a Path Forward",
        "date": "2024-10-09",
        "content": "The Athens Democracy Forum last week explored the world’s schisms in the face of threats from technology and shifts in the world order."
    },
    {
        "title": "Voices from the Swing States",
        "date": "2024-10-09",
        "content": "In the months leading up to the 2024 election, we traveled to the seven states most likely to decide the election. We talked to voters about the rising cost of housing, immigration, abortion and more."
    },
    {
        "title": "It’s Crunchtime for Kari Lake in Arizona’s Senate Race",
        "date": "2024-10-09",
        "content": "The Republican firebrand trails in the polls and faces a large financial disadvantage. Wednesday night’s debate may be her last big chance to land a blow against her Democratic opponent."
    },
    {
        "title": "Eric Adams Was Never the Future of the Democratic Party",
        "date": "2024-10-09",
        "content": "The real lesson of Adams’s mayoralty has nothing to do with corruption."
    },
    {
        "title": "Maryland Senate Race Becomes a Slugfest as Both Parties Eye High Stakes",
        "date": "2024-10-09",
        "content": "Larry Hogan, the popular former Republican governor, and Angela Alsobrooks, the Prince George’s County executive, both describe their race as critical to the future of the Senate."
    },
    {
        "title": "Biden Accuses Trump of ‘Outright Lies’ About Hurricane Response",
        "date": "2024-10-09",
        "content": "President Biden expressed concern that misinformation would undermine confidence in the response to Hurricane Milton."
    },
    {
        "title": "Why the Election Has Wall Street Frozen",
        "date": "2024-10-09",
        "content": "Among deal makers with fortunes at stake, the consequences of a Harris or a Trump win are increasingly murky."
    },
    {
        "title": "Inside Biden’s ‘War’ Room: Heads of State and Heads of Hair",
        "date": "2024-10-09",
        "content": "Bob Woodward doesn’t know which story he wants to tell in his latest presidential chronicle."
    },
    {
        "title": "Kamala Harris Has Raised $1 Billion Since Entering 2024 Presidential Race",
        "date": "2024-10-09",
        "content": "No presidential candidate is believed to have ever raised so much money so fast after entering a race. The campaign has stopped trumpeting its fund-raising totals to keep Democrats from becoming complacent."
    },
    {
        "title": "An Awkward Dance: Harris Has to Defer to the President She Seeks to Replace",
        "date": "2024-10-09",
        "content": "Vice President Kamala Harris has been a loyal understudy to President Biden. But tensions are inevitable as she increasingly takes center stage."
    },
    {
        "title": "Trump Repeatedly Referred to Maine’s Female Governor as a Man",
        "date": "2024-10-09",
        "content": "On a call with supporters, the former president incorrectly used masculine pronouns six times while referring to Janet Mills."
    },
    {
        "title": "In Trump’s Speeches, Signs of Cognitive Impairment",
        "date": "2024-10-09",
        "content": "Readers discuss Donald Trump’s age and cognitive patterns. Also: A traumatized Israel; the “ghost guns” case; Eric Adams; A.I. and nuclear power."
    },
    {
        "title": "Resistance to Public Health, No Longer Fringe, Gains Foothold in G.O.P. Politics",
        "date": "2024-10-09",
        "content": "The merger of the Robert F. Kennedy Jr. and Donald J. Trump campaigns puts the so-called medical freedom movement on the cusp of real power in Washington, with a new slogan: “Make America Healthy Again.”"
    },
    {
        "title": "At Michigan, Pro-Palestinian Activists Lose, and Money for Student Clubs Is Restored",
        "date": "2024-10-09",
        "content": "In a fraught meeting, the student government rejected a plan to redirect its budget from campus activities to aid for Gaza. But the fight is not over."
    },
    {
        "title": "After Floods, Soaring Insurance Rates Become a Hot Election Issue",
        "date": "2024-10-09",
        "content": "Few states elect their insurance commissioners. But in North Carolina, a proposed 42 percent rate hike and Hurricane Helene have raised the stakes in the upcoming election."
    },
    {
        "title": "A Filmmaker Explores Climate and Democracy",
        "date": "2024-10-09",
        "content": "In his next documentary, Michael P. Nash takes on A.I. and how it might be used to address environmental issues."
    },
    {
        "title": "Meeting of Western Leaders on Ukraine Is Postponed, a Setback for Kyiv",
        "date": "2024-10-09",
        "content": "A top-level gathering in Germany intended to show support for Ukraine was put off after President Biden canceled his trip to deal with Hurricane Milton."
    },
    {
        "title": "Floridians Rush to Evacuate, and Harris Outlines Home Health Care Plan",
        "date": "2024-10-09",
        "content": "Plus, Brazil unblocks X after Elon Musk backs down."
    },
    {
        "title": "What Do Celebrities Owe Their Fans?",
        "date": "2024-10-09",
        "content": "Many stars have long accepted fan misbehavior, intense pressure and intrusions into their personal lives as the price of fame. Should they?"
    },
    {
        "title": "Jack Smith Owes Us an Explanation",
        "date": "2024-10-09",
        "content": "The Justice Department should not have allowed revelations about the Trump Jan. 6 case to be disclosed so close to Election Day."
    },
    {
        "title": "Trump Has Something He’d Like to Sell You",
        "date": "2024-10-09",
        "content": "The former president’s history of merchandising himself may be broadly revealing in unexpected ways."
    },
    {
        "title": "Trump Holds Up Transition Process, Skirting Ethics and Fund-Raising Rules",
        "date": "2024-10-09",
        "content": "Donald J. Trump has so far opted out of the official planning for a government handover, a move that allows him to avoid disclosing his donors to his transition effort."
    },
    {
        "title": "How Harris and Trump Are Battling for Pennsylvania",
        "date": "2024-10-09",
        "content": "Pennsylvania is widely seen to be the tipping-point state of the 2024 election. Shane Goldmacher, a national political correspondent for The New York Times, explains what Vice President Kamala Harris and former President Donald J. Trump are doing ..."
    },
    {
        "title": "Inside the Battle for America’s Most Consequential Battleground State",
        "date": "2024-10-09",
        "content": "Kamala Harris and Donald Trump are pouring more money, time and energy into Pennsylvania than anywhere else, waging an ad war as they crisscross the state."
    },
    {
        "title": "They Flew 7,000 Miles to Fight Haiti’s Gangs. The Gangs Are on Top.",
        "date": "2024-10-09",
        "content": "Hundreds of Kenyan police officers are in Port-au-Prince, trying to take the capital back from gangs, but financing and personnel shortages have hampered the effort."
    },
    {
        "title": "Yolanda Robinson, Wife of Mark Robinson, Has Had Scandals of Her Own",
        "date": "2024-10-09",
        "content": "North Carolina’s second lady helped make her husband’s political foray possible. But her ventures — a day care and a nonprofit — also caused problems."
    },
    {
        "title": "Why Kamala Harris’s ‘Call Her Daddy’ Strategy Might Not Be Enough",
        "date": "2024-10-09",
        "content": "Gen Z men could swing the election. Trump knows that."
    },
    {
        "title": "Why Cakes Can Be a Powerful Form of Protest",
        "date": "2024-10-09",
        "content": "A new generation of bakers are reviving an old tradition."
    },
    {
        "title": "Trump Family Business Eyes Hotel Deals in Israel",
        "date": "2024-10-09",
        "content": "The Trump Organization was in talks about Israeli hotels before the Hamas attack last year. It says it wants to resume them in the future, raising questions about the mingling of politics and money in the event of a second Trump term."
    },
    {
        "title": "Slotkin and Rogers Attack Each Other’s Records in Michigan Senate Debate",
        "date": "2024-10-09",
        "content": "Representative Elissa Slotkin, a Democrat, and former Representative Mike Rogers, a Republican, had bitter exchanges over abortion, war and China."
    },
    {
        "title": "The 9 Elements of a Trump Rally",
        "date": "2024-10-09",
        "content": "The themes Donald Trump returns to again and again at his rallies"
    },
    {
        "title": "Walz Says the Electoral College ‘Needs to Go’",
        "date": "2024-10-09",
        "content": "Gov. Tim Walz of Minnesota suggested at fund-raisers that he backed switching to a national popular vote. His spokesman clarified that this was not the position of Kamala Harris’s campaign."
    },
    {
        "title": "Harris Cracks a Beer With Colbert and Talks Foreign Policy and Trump",
        "date": "2024-10-09",
        "content": "In a chat with Stephen Colbert, Kamala Harris suggested the Gaza war was unlikely to end soon, even as she urged optimism. And she condemned Donald Trump over reports that he sent rare Covid test machines to Russia."
    },
    {
        "title": "Afghan Man Arrested on Charges of Plotting Election Day Attack",
        "date": "2024-10-09",
        "content": "It is not clear where the man intended to stage the attack, though the criminal complaint said he sought to inflict mass casualties on behalf of the Islamic State."
    },
    {
        "title": "Antisemitism and Threats Directed at Officials Over Storm Response",
        "date": "2024-10-09",
        "content": "Some online posts have threatened violence against FEMA officials. A research group found that the X platform has been one of the main drivers of misinformation."
    },
    {
        "title": "Small Business Administration Will Soon Exhaust Disaster Loan Funds",
        "date": "2024-10-08",
        "content": "The agency has less than $100 million for new loans, according to officials, while Hurricane Milton is headed toward Florida and after Hurricane Helene devastated much of the Southeast."
    },
    {
        "title": "What Omarosa, John Kerry and Michael Cohen Have in Common",
        "date": "2024-10-08",
        "content": "And why it matters in 2024."
    },
    {
        "title": "With Kennedy on the Ballot, Vance Talks Public Health in Michigan",
        "date": "2024-10-08",
        "content": "Senator JD Vance of Ohio spoke of the occurrence of “weird childhood diseases” that may be caused by “weird stuff” in the food and water supply."
    },
    {
        "title": "Millions Are Fleeing Florida’s Gulf Coast Ahead of Milton",
        "date": "2024-10-08",
        "content": "Also, the Supreme Court appeared open to limits on “ghost guns.” Here’s the latest at the end of Tuesday."
    },
    {
        "title": "Romney Won’t Endorse Harris, Saying He Wants to Keep His Voice in the Party",
        "date": "2024-10-08",
        "content": "Senator Mitt Romney of Utah, the 2012 Republican nominee for president, says the party may need to be rebuilt."
    },
    {
        "title": "Wednesday Briefing: An Israeli Airstrike in Syria",
        "date": "2024-10-08",
        "content": "Plus, revisiting Oppenheimer’s Communist ties."
    },
    {
        "title": "13 Things We Learned From Harris’s Interview With Howard Stern",
        "date": "2024-10-08",
        "content": "In a lengthy sit-down, the veteran radio host extracted an array of new details about Kamala Harris’s life."
    },
    {
        "title": "How Helene Has Upended North Carolina’s Election Plans",
        "date": "2024-10-08",
        "content": "With 13 counties devastated by flooding, the state is trying to make sure that residents can still vote. Candidates have been forced to abandon door-knocking and phone banks."
    },
    {
        "title": "Harris Spends an Hour in the Warm Embrace of Howard Stern",
        "date": "2024-10-08",
        "content": "The shock jock has become a required stop for Democratic politicians."
    },
    {
        "title": "Inside a Harris Ad in Which Ex-Trump Aides Blast Him as Unfit for Office",
        "date": "2024-10-08",
        "content": "An attack ad from Kamala Harris’s campaign uses denunciations of Donald Trump by his own former top security lieutenants to portray him as too risky to restore to power."
    },
    {
        "title": "Voting Wars Open a New Front: Which Mail Ballots Should Count?",
        "date": "2024-10-08",
        "content": "Voting by mail is increasingly popular, but mail ballots are rejected far more often than in-person ones. In Pennsylvania and elsewhere, parties are battling over which ones to count — or not."
    },
    {
        "title": "Trump and Republicans Bet Big on Anti-Trans Ads Across the Country",
        "date": "2024-10-08",
        "content": "Republicans have spent tens of millions of dollars on the ads, part of an attempt to help them win over suburban female voters."
    },
    {
        "title": "U.S. Budget Deficit Rises to $1.8 Trillion in 2024",
        "date": "2024-10-08",
        "content": "New estimates from the Congressional Budget Office show continuing fiscal strain, despite steady economic growth."
    },
    {
        "title": "On ‘The View,’ Harris Hits at Trump’s ‘Callousness’ in His Storm Response",
        "date": "2024-10-08",
        "content": "In a wide-ranging interview, the vice president also she could not think of a way she would act differently from President Biden, and laid out a plan to help Americans take care of aging loved ones."
    },
    {
        "title": "On Drug Prices, Harris Pushes for Deeper Cuts While Trump Offers Few Specifics",
        "date": "2024-10-08",
        "content": "Both have campaigned for lower prescription costs. Kamala Harris has promised to expand President Biden’s policies. Donald Trump is a wild card."
    },
    {
        "title": "Top Musk Lieutenant Joins Trump Super PAC for Final Push",
        "date": "2024-10-08",
        "content": "Steve Davis is often called upon by Mr. Musk to help in all-hands-on-deck situations, such as after Mr. Musk’s purchase of Twitter."
    },
    {
        "title": "Pro-Palestinian ‘Uncommitted’ Group Comes Out Firmly Against Trump",
        "date": "2024-10-08",
        "content": "The organization that emerged from protests against the Biden administration’s Middle East policies now says a second Trump term would be far worse."
    },
    {
        "title": "Biden Warns Floridians to ‘Evacuate Now’ as He Postpones Foreign Trip Over Hurricane Milton",
        "date": "2024-10-08",
        "content": "President Biden had been scheduled to leave for Germany and Angola on Thursday."
    },
    {
        "title": "Iran Crisis Ignites New Debate About Trump’s Nuclear Deal Exit",
        "date": "2024-10-08",
        "content": "President Donald J. Trump labeled it “the worst deal in history.” But critics of the withdrawal say it prompted Iran to accelerate its nuclear program."
    },
    {
        "title": "Asheville, Tampa and Lessons From Hurricane Helene",
        "date": "2024-10-08",
        "content": "Readers reflect on the devastation, the recovery and climate havens. Also: An ex-hostage’s plea; the women who accuse Donald Trump; a Trump rally."
    },
    {
        "title": "Will Trump Get Jail Time? We Looked at Similar Cases to Find Out.",
        "date": "2024-10-08",
        "content": "Donald J. Trump faces sentencing on Nov. 26. The election three weeks earlier may determine not only if he returns to the presidency, but if he ends up behind bars."
    },
    {
        "title": "Book Revives Questions About Trump’s Ties to Putin",
        "date": "2024-10-08",
        "content": "The journalist Bob Woodward cited an unnamed aide saying that Donald J. Trump had spoken to Vladimir V. Putin as many as seven times since leaving office. Multiple sources say they cannot confirm that report."
    },
    {
        "title": "Federal Debt and the Election",
        "date": "2024-10-08",
        "content": "National debt may soon exceed G.D.P. We explore the causes — and possible solutions."
    },
    {
        "title": "How NAFTA Broke American Politics",
        "date": "2024-10-08",
        "content": "Since its passage in 1993, the trade agreement has played an outsize role in presidential elections."
    },
    {
        "title": "What Trump and Vance Want From Hurricane Helene",
        "date": "2024-10-08",
        "content": "Trump has successfully trained millions of Americans to think of the truth as an obstacle to winning power."
    },
    {
        "title": "A Florida Poll That Should Change the Way You Look at the Election",
        "date": "2024-10-08",
        "content": "A big Trump lead in the state paradoxically adds to evidence of a smaller Electoral College edge for him. And a choice by pollsters may be causing them to miss state shifts."
    },
    {
        "title": "This Year’s October Surprise May Be That There Isn’t One",
        "date": "2024-10-08",
        "content": "The polls are very, very stable in spite of events."
    },
    {
        "title": "Poll Finds Harris Rising as She Challenges Trump on Change",
        "date": "2024-10-08",
        "content": "A national Times/Siena poll found Kamala Harris with a slim lead over Donald J. Trump. Voters were more likely to see her, not Mr. Trump, as a break from the status quo."
    },
    {
        "title": "What We’ve Heard From Teens About the 2024 Election",
        "date": "2024-10-08",
        "content": "Since September, the Headway team has been asking teenagers across the country for their thoughts on the election. Here’s what we’ve heard so far."
    },
    {
        "title": "The 10 Most Common Questions Teenagers Asked About the Election",
        "date": "2024-10-08",
        "content": "Headway has received more than 500 questions from teens about this year’s presidential election. Here are their most frequently asked questions — and our answers."
    },
    {
        "title": "Why France’s Most Controversial Novelist Is Also Its Most Celebrated",
        "date": "2024-10-08",
        "content": "Reviled as much as he is lauded, Michel Houellebecq holds up a mirror to a world we would rather not see."
    },
    {
        "title": "Black Men Are Waiting for a Democratic Party That Delivers for Them",
        "date": "2024-10-08",
        "content": "Democrats have spent too much time drawing symbolic distinctions with Republicans without illuminating substantive differences."
    },
    {
        "title": "We Can Do Better Than ‘Positive Masculinity’",
        "date": "2024-10-08",
        "content": "It doesn’t challenge stereotypes; it reinforces them."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters Nationwide",
        "date": "2024-10-08",
        "content": "Results of a nationwide New York Times/Siena College poll conducted among 3,385 registered voters from Sept. 29 to Oct. 6, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Likely Electorate in Texas",
        "date": "2024-10-08",
        "content": "Results of a New York Times/Siena College poll conducted among 617 likely voters in Texas from Sept. 29 to Oct. 4, 2024."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters in Florida",
        "date": "2024-10-08",
        "content": "Results of a New York Times/Siena College poll conducted among 622 registered voters in Florida from Sept. 29 to Oct. 6, 2024."
    },
    {
        "title": "Toplines: October 2024 Times/Siena Poll of Registered Voters in  Texas",
        "date": "2024-10-08",
        "content": "Results of a New York Times/Siena College poll conducted among 617 likely voters in Texas from Sept. 29 to Oct. 4, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the Likely Electorate in Florida",
        "date": "2024-10-08",
        "content": "Results of a New York Times/Siena College poll conducted among 622 likely voters in Florida from Sept. 29 to Oct. 6, 2024."
    },
    {
        "title": "Cross-Tabs: October 2024 Times/Siena Poll of the National Likely Electorate",
        "date": "2024-10-08",
        "content": "Results of a nationwide New York Times/Siena College poll conducted among 3,385 likely voters from Sept. 29 to Oct. 6, 2024."
    },
    {
        "title": "Why a Measure to Protect Abortion Rights in New York May Be in Trouble",
        "date": "2024-10-08",
        "content": "The statewide ballot measure, known as the Equal Rights Amendment, has become a target for Republican opponents who have cast it as an attack on family values."
    },
    {
        "title": "Trump Has an Edge With These 13 Undecided Voters. One Issue Is Tripping Him Up.",
        "date": "2024-10-08",
        "content": "The participants discuss the vice-presidential debate and if and how it influenced their vote for president."
    },
    {
        "title": "Tuesday Briefing",
        "date": "2024-10-08",
        "content": "Israelis and Palestinians commemorate a year of loss."
    },
    {
        "title": "Trump Sees Antisemitism in Only One Direction: On the Left",
        "date": "2024-10-08",
        "content": "At an event marking the anniversary of Hamas’s Oct. 7 attack on Israel, Donald Trump claimed that antisemitism existed within the Democratic Party but not the Republican Party."
    },
    {
        "title": "7 Takeaways From Harris’s Interview on ‘60 Minutes’",
        "date": "2024-10-08",
        "content": "Pressed repeatedly, Kamala Harris stayed focused on the points she wanted to make. She also spoke about owning a Glock, and Tim Walz revealed she had told him to be a “little more careful” speaking."
    },
    {
        "title": "Athens Democracy Forum: Where Is Global Politics Headed?",
        "date": "2024-10-08",
        "content": "Voters have more opportunities than ever in 2024 to shape history in their countries, but war, technology and other forces pose a powerful threat, experts said."
    },
    {
        "title": "Does India Offer a Glimmer of Hope for Democracy?",
        "date": "2024-10-08",
        "content": "Prime Minister Modi was re-elected, but his party fell short in dominating Parliament. Was that an inflection point for the world’s largest democracy?"
    },
    {
        "title": "Youth Leaders Make Democracy Their Focus",
        "date": "2024-10-08",
        "content": "Six young people from around the world who attended the Athens Democracy Forum spoke about what drives them and the challenges they face."
    },
    {
        "title": "That Gun Harris Told Oprah Winfrey About? It’s a Glock.",
        "date": "2024-10-08",
        "content": "“And I’ve had it for quite some time,” Vice President Kamala Harris said on “60 Minutes.”"
    },
    {
        "title": "Democracy at the World’s Ballot Boxes",
        "date": "2024-10-08",
        "content": "Much of Earth’s population has been voting this year. Where democracies are strained and stressed, is there room for optimism?"
    },
    {
        "title": "Trump Says He’s Visited Gaza, but No Record of Such a Trip Exists",
        "date": "2024-10-08",
        "content": "An aide, speaking on the condition of anonymity, pointed to the former president’s trip to Israel. But Gaza is not in Israel."
    },
    {
        "title": "Russia, China and Iran Intend to Stoke False Election Claims, Officials Warn",
        "date": "2024-10-08",
        "content": "Intelligence officials said that foreign adversaries were planning to take advantage of another close U.S. election to undermine trust in the country’s democratic process."
    },
    {
        "title": "Trump’s Ugly Closing Argument",
        "date": "2024-10-07",
        "content": "He delivers a mix of disinformation, false claims about cheating in elections and personal attacks."
    },
    {
        "title": "A Year Later, Biden Faces the Limits of U.S. Influence in the Mideast",
        "date": "2024-10-07",
        "content": "In the immediate aftermath of the Hamas-led attacks on Oct. 7, the president stepped in to support Israel, counsel moderation and seek a lasting peace."
    },
    {
        "title": "Inside a Trump Ad Attacking Harris on Energy and the Environment",
        "date": "2024-10-07",
        "content": "An ad in Michigan and Pennsylvania revives the vice president’s past positions on climate change and the environment."
    },
    {
        "title": "Harris Honors Oct. 7 Dead as Victims of ‘Pure Evil’ and Vows to Defend Israel",
        "date": "2024-10-07",
        "content": "Condemning the Hamas-led attacks a year ago and calling again for the release of hostages in Gaza, Vice President Kamala Harris also spoke of “the immense suffering of innocent Palestinians.”"
    },
    {
        "title": "One Year After Oct. 7, Peace Seems More Elusive Than Ever",
        "date": "2024-10-07",
        "content": "Also, Hurricane Milton heads toward Florida as a Category 5 storm. Here’s the latest at the end of Monday."
    },
    {
        "title": "Tuesday Briefing: Israelis and Palestinians Mourn a Year of Loss",
        "date": "2024-10-07",
        "content": "Plus, Chappell Roan navigates the demands of fame."
    },
    {
        "title": "Harris Often Sidesteps Her History-Making Potential. Walz Doesn’t.",
        "date": "2024-10-07",
        "content": "Vice President Kamala Harris rarely points out the fact that she would be the first female president or the first Black or Indian woman to hold the job. Her running mate embraces it."
    },
    {
        "title": "Kamala Harris Should Think Twice About Touting This Economy",
        "date": "2024-10-07",
        "content": "The labor market isn’t as healthy as the September jobs report suggests. And Americans know it."
    },
    {
        "title": "Musk’s Super PAC Offers $47 to Those Who Help It Find Trump Voters",
        "date": "2024-10-07",
        "content": "Musk’s group wants registered voters to sign a petition that it can use to target potential supporters of Donald Trump’s presidential campaign. It’s offering a cash reward for referrals."
    },
    {
        "title": "The Mideast War Threatens Harris in Michigan as Arab Voters Reject Her",
        "date": "2024-10-07",
        "content": "A year after the Oct. 7 attacks, Kamala Harris faces deepening Democratic fractures in a crucial state. Interviews suggest that her support from Muslim and Arab Americans is drying up."
    },
    {
        "title": "Oct. 7: For Jews in America, a Time of Reflection",
        "date": "2024-10-07",
        "content": "Readers respond to a column by Bret Stephens. Also: Republicans’ plans to challenge the election; Vanderbilt’s leader, on flawed college rankings."
    },
    {
        "title": "Porn Industry Jumps Into the Presidential Campaign, Targeting Project 2025",
        "date": "2024-10-07",
        "content": "In seven swing states, the industry’s websites will feature ads decrying the conservative policy blueprint’s proposed ban on pornography."
    },
    {
        "title": "Two Tech Moguls Split on Trump",
        "date": "2024-10-07",
        "content": "Elon Musk appeared onstage at a rally for the former president this weekend, but Silicon Valley was abuzz about Ben Horowitz’s U-turn on backing the Republican candidate."
    },
    {
        "title": "Trump’s Plans Could Increase U.S. Debt While Raising Costs for Most Americans",
        "date": "2024-10-07",
        "content": "A new analysis finds that Vice President Kamala Harris and former President Donald J. Trump’s plans would both add to the deficit, but Mr. Trump’s proposals could create a fiscal hole twice as big."
    },
    {
        "title": "How Could the Election Be This Close?",
        "date": "2024-10-07",
        "content": "No one said it was going to be easy for Kamala Harris."
    },
    {
        "title": "A Year After Oct. 7 Massacre, Jewish Anxiety Peaks in Pennsylvania",
        "date": "2024-10-07",
        "content": "Jewish voters in Pittsburgh feel squeezed by intolerance on the left and the right, and torn by presidential candidates seeking their support in a vital battleground state."
    },
    {
        "title": "State of the Race: A Big Week in News, but a Quiet One in Polling",
        "date": "2024-10-07",
        "content": "The polls are still so close that neither candidate has a significant advantage."
    },
    {
        "title": "The ‘Crypto Punks’ Behind Trump’s Murky New Business Venture",
        "date": "2024-10-07",
        "content": "The serial entrepreneurs behind Donald J. Trump’s new cryptocurrency project have left a trail of lawsuits, unpaid debt and tax liens."
    },
    {
        "title": "The Tech Lobbying Group Helping to Broaden the First Amendment’s Reach",
        "date": "2024-10-07",
        "content": "NetChoice, backed by tech giants including Meta and Google, has successfully argued in court that Big Tech hosts protected speech."
    },
    {
        "title": "What I’m Thinking About on the First Anniversary of the War",
        "date": "2024-10-07",
        "content": "One year after being attacked, Israel has not won the battle on the ground or the battle for a good story to tell about itself and this war."
    },
    {
        "title": "Harris Hits Back at G.O.P. Criticism of Childless Women on ‘Call Her Daddy’ Podcast",
        "date": "2024-10-06",
        "content": "“All of us understand that this is not the 1950s anymore,” Vice President Kamala Harris told the host of the podcast “Call Her Daddy,” which is popular with millennial and Gen Z women."
    },
    {
        "title": "Monday Briefing: Reflecting on a Year of War",
        "date": "2024-10-06",
        "content": "Plus, Paris Fashion Week’s closing fantasia."
    },
    {
        "title": "A ‘Hallowed Place,’ With a Whiff of Onion Rings and Sun Block",
        "date": "2024-10-06",
        "content": "Donald Trump returned to the site where he was shot in the ear. For some of his supporters, it was a religious event as much as a campaign rally."
    },
    {
        "title": "Tim Walz Makes First Sunday Show Appearance Since Joining Ticket",
        "date": "2024-10-06",
        "content": "Mr. Walz, who has kept a relatively low profile since becoming Vice President Kamala Harris’s running mate, appeared on Fox News Sunday."
    },
    {
        "title": "In Talking About ‘Freedom,’ Harris Hopes She Has a Winning Message on Guns",
        "date": "2024-10-06",
        "content": "The vice president is talking about firearms in a new way for a Democrat — by co-opting the language of Republicans."
    },
    {
        "title": "U.K. Prime Minister’s Chief of Staff, Sue Gray, Resigns",
        "date": "2024-10-06",
        "content": "Ms. Gray said intense media scrutiny of her role meant she “risked becoming a distraction” to the new Labour government."
    },
    {
        "title": "Kamala Harris Is Turning a Trump Tactic on Its Head",
        "date": "2024-10-06",
        "content": "Trump wants to position himself as the nation’s protector. But Harris is offering real-world, practical protection on the issues that matter."
    },
    {
        "title": "JD Vance and the Prophets of Trumpism",
        "date": "2024-10-06",
        "content": "For this group of Christians, “Trump is good. He’s been baptized by their theology.”"
    },
    {
        "title": "Harris Will Appear in a Whirlwind of Interviews, Most of Them Friendly",
        "date": "2024-10-06",
        "content": "After mostly avoiding interviews as her campaign began, the vice president will hold several this week, including with Howard Stern, Stephen Colbert and the hosts of “The View.”"
    },
    {
        "title": "How Trump’s Speeches Raise Questions About Age",
        "date": "2024-10-06",
        "content": "With President Biden out of the 2024 election, former President Donald J. Trump at 78 is now the oldest major party nominee in U.S. history. Peter Baker, senior White House correspondent at The New York Times, explains the change he found in the f..."
    },
    {
        "title": "Trump’s Speeches, Increasingly Angry and Rambling, Reignite the Question of Age",
        "date": "2024-10-06",
        "content": "With the passage of time, the 78-year-old former president’s speeches have grown darker, harsher, longer, angrier, less focused, more profane and increasingly fixated on the past, according to a review of his public appearances over the years."
    },
    {
        "title": "The Fight for Rural America",
        "date": "2024-10-06",
        "content": "One in five Americans identifies as rural, and since the 1960s, their votes have become increasingly Republican. Astead W. Herndon, a politics reporter and the host of the New York Times podcast “The Run-Up,” examines how Republicans expanded thei..."
    },
    {
        "title": "A Year After Feinstein’s Death, Her Life’s Belongings Are for Sale",
        "date": "2024-10-06",
        "content": "Senator Dianne Feinstein collected fine jewelry, paintings and a trove of political mementos. Because of her trust, many of those items are available for public inspection — and purchase."
    },
    {
        "title": "Bruised Supreme Court Returns to Bench With Possible Election Cases Looming",
        "date": "2024-10-06",
        "content": "Aside from major disputes on issues like transgender rights and guns, the docket is fairly routine. That could change fast if the presidential race is contested."
    },
    {
        "title": "Melinda French Gates’s New Life: Abortion Politics and Kamala Harris",
        "date": "2024-10-06",
        "content": "After her divorce from Bill Gates, Ms. French Gates came into her own billions of dollars, with which she could do whatever she chose. She used to insist on appearing nonpartisan, but no more."
    },
    {
        "title": "The 3 Brothers at the Center of the Bribery Inquiry Rocking City Hall",
        "date": "2024-10-06",
        "content": "David Banks and Philip Banks III eclipsed their younger brother by rising to help run New York City. Then federal prosecutors seized the phones of all three men."
    },
    {
        "title": "Tunisia’s Autocratic Leader Is Poised to Steamroll to Election Victory",
        "date": "2024-10-06",
        "content": "President Kais Saied, who has jailed opponents and consolidated power, is almost certain to win Sunday’s election in the North African country, the birthplace of the Arab Spring movement."
    },
    {
        "title": "Trump’s Return to Scene of Attack Was a Do-Over in More Ways Than One",
        "date": "2024-10-06",
        "content": "The former president returned to the stage where a gunman tried to kill him in July and tried to recapture some of the momentum he had before President Biden dropped out."
    },
    {
        "title": "Elon Musk Leaps to Trump’s Side in Rally Appearance",
        "date": "2024-10-06",
        "content": "Mr. Musk, the world’s richest man and the leader of Tesla and X,  delivered a dark warning during an animated appearance at former President Donald J. Trump’s rally."
    },
    {
        "title": "Harris Meets With Arab and Muslim Leaders in Michigan",
        "date": "2024-10-05",
        "content": "The meeting, which took place backstage, came as Vice President Kamala Harris’s campaign ramped up efforts to appeal directly to Arab and Muslim voters in the final weeks before the election."
    },
    {
        "title": "Kamala Harris Visits North Carolina to Check on Hurricane Response",
        "date": "2024-10-05",
        "content": "The vice president visited Charlotte, N.C., for an update on relief efforts after Hurricane Helene ravaged wide swaths of the Southeast."
    },
    {
        "title": "Security Is Tighter for Trump Rally at Site of July Assassination Attempt",
        "date": "2024-10-05",
        "content": "The Secret Service has deployed large forces to protect former President Donald J. Trump as he prepares to hold a rally in Butler, Pa., where a gunman attacked him in July."
    },
    {
        "title": "Trump Did Nothing to Stop the Mob",
        "date": "2024-10-05",
        "content": "“Stop the Steal” is about not trusting voters."
    },
    {
        "title": "Former Gov. David Paterson of New York Assaulted in Manhattan",
        "date": "2024-10-05",
        "content": "Mr. Paterson and his stepson suffered minor injuries in a street attack on Friday. The former governor was not believed to have been targeted in the assault, the police said."
    },
    {
        "title": "America Needs a President",
        "date": "2024-10-05",
        "content": "The sidelining of the White House in global crisis spots is a big red flag."
    },
    {
        "title": "JD Smirks His Way Into the Future",
        "date": "2024-10-05",
        "content": "The misogynist ticket takes a shot at Kamala for dancing — and being a woman."
    },
    {
        "title": "To Understand Trump vs. Harris, You Must Know These American Myths",
        "date": "2024-10-05",
        "content": "It’s as if we are living in two different countries, each with a different understanding of who counts as American."
    },
    {
        "title": "Fear Factors",
        "date": "2024-10-05",
        "content": "Sometimes the scariest movies are the ones that depict the ordinary horrors of life."
    },
    {
        "title": "In Final Stretch, Biden Faces Some of the Biggest Crises of His Presidency",
        "date": "2024-10-05",
        "content": "Even as President Biden recedes from view, some of the most consequential days of his term may be ahead of him."
    },
    {
        "title": "Where Trump and Harris Stand on the Economy",
        "date": "2024-10-05",
        "content": "Here’s where Vice President Kamala Harris and former President Donald Trump stand on economic issues like inflation, taxes and more. Maggie Astor, who covers politics for The New York Times, looks at the candidates’ views, proposals and records."
    },
    {
        "title": "30 Days Out, the Harris and Trump Campaigns Brace for ‘Trench Warfare’",
        "date": "2024-10-05",
        "content": "With tight contests in all seven battleground states, the candidates are pressing for a few thousand votes that could sway the outcome of the entire election."
    },
    {
        "title": "How Gender Became the Election’s Crucial Fault Line",
        "date": "2024-10-05",
        "content": "Harris could be the first female president. But it’s Trump and Vance who are playing the gender card."
    },
    {
        "title": "Supporters Who Watched as Trump Was Shot Prepare to Welcome Him Back",
        "date": "2024-10-05",
        "content": "Donald J. Trump is returning to Butler, Pa., to hold another rally at the site where he was nearly assassinated in July in an attack that killed a man and wounded two others."
    },
    {
        "title": "Campaigning for Harris, Women Share Their Abortion Stories With Neighbors",
        "date": "2024-10-05",
        "content": "The Harris campaign is trying to transform women in battleground states into an organizing force who can drive their friends and family to the polls."
    },
    {
        "title": "As Lawmaker Claims Trump’s Shooting Was Inside Job, G.O.P. Indulges Him",
        "date": "2024-10-05",
        "content": "Representative Eli Crane, a first-term Arizona Republican, has emerged as the chief right-wing voice pushing conspiracy theories about the Trump assassination attempts."
    },
    {
        "title": "Pro-Palestinian Group Is Relentless in Its Criticism of Israel, and It Isn’t Backing Down",
        "date": "2024-10-05",
        "content": "Within Our Lifetime, a group formed by New York students, has galvanized pro-Palestinian activists who are calling for the end of Israel — and facing accusations of antisemitism."
    },
    {
        "title": "Big Business Saw an Ally in Eric Adams, and Overlooked His Issues",
        "date": "2024-10-05",
        "content": "New York’s business community threw its support behind Mr. Adams, and continued backing him even as his legal problems began to threaten the governance of the city."
    },
    {
        "title": "Villages Spared a Soviet Nuclear Plant Are Split Over a U.S. One",
        "date": "2024-10-05",
        "content": "A plan to place American-made reactors on a picturesque coastline has broad support in Poland — and in Washington — but the geopolitical calculations have run into local opposition."
    },
    {
        "title": "Behind Trump’s Views on Ukraine: Putin’s Gambit and a Political Grudge",
        "date": "2024-10-05",
        "content": "The roots of Donald Trump’s animus toward Ukraine — an issue with profound consequences should he be elected again — can be found in a yearlong series of events spanning 2016 and 2017."
    },
    {
        "title": "Biden Urges Congress to Replenish Disaster Relief Funds Quickly",
        "date": "2024-10-05",
        "content": "The president said a Small Business Administration program needed to help business owners recover from Hurricane Helene was set to run out of money in weeks, before Congress reconvenes."
    },
    {
        "title": "5 Takeaways From Melania Trump’s Book",
        "date": "2024-10-05",
        "content": "Shining a little more light on her mysterious life, her memoir details her support for abortion rights, her doubts about the 2020 election and her explanation for that “I really don’t care” jacket."
    },
    {
        "title": "In North Carolina Town Hall, Trump Makes a Series of Promises to Appeal to Veterans",
        "date": "2024-10-05",
        "content": "Donald J. Trump answered preselected questions from a pro-military crowd who echoed his false claims and approved of his vow to conduct massive deportations of undocumented immigrants."
    },
    {
        "title": "Aides Say Trump Resisted Sending Federal Funds After California Wildfires",
        "date": "2024-10-05",
        "content": "He changed his mind after being shown data that his supporters in the state had been affected, the former officials said. One called his approach “red states vs. blue states.”"
    },
    {
        "title": "2 Men Sentenced to Prison for Attacking Officers at Jan. 6 Riot",
        "date": "2024-10-04",
        "content": "One of the men, from New Jersey, referred to lawmakers as “traitors” and encouraged other rioters to drag them out of the building by their hair, prosecutors said."
    },
    {
        "title": "Harris, in Michigan, Tries to Head Off Trump’s Attacks Over Gas Cars",
        "date": "2024-10-04",
        "content": "Kamala Harris, who has faced a flurry of Trump ads in Michigan misleadingly arguing that she wants to ban gas cars altogether, promised, “I will never tell you what kind of car you have to drive.”"
    },
    {
        "title": "Trump’s False Claims About the Federal Response to Hurricane Helene",
        "date": "2024-10-04",
        "content": "The former president falsely accused the Biden administration of spending disaster funding on migrants, neglecting areas that had voted for Republicans and ignoring a call from a Republican governor."
    },
    {
        "title": "It’s Not World War III. But Foreign Conflicts May Get Uglier Before Election Day.",
        "date": "2024-10-04",
        "content": "Rarely do foreign crises and a presidential election collide like they have in the past few days."
    },
    {
        "title": "Reporter Asks Biden if He Would Reconsider Dropping Out of the Race",
        "date": "2024-10-04",
        "content": "President Biden, who reluctantly surrendered his bid for a second term, has wanted to be president for most of his adult life."
    },
    {
        "title": "Trump Campaign Distributes Raised Funds to Victims in Butler, Pa.",
        "date": "2024-10-04",
        "content": "The recipients included the families of those killed and wounded, and a Trump supporter who lost income when his rental cranes were stuck at the site."
    },
    {
        "title": "The Economy Looks Strong After the Latest Jobs Report",
        "date": "2024-10-04",
        "content": "Also, Trump is returning to the site where he was shot. Here’s the latest at the end of Friday."
    },
    {
        "title": "Trump Falsely Promotes Endorsement From Banker Who Hasn’t Endorsed Him",
        "date": "2024-10-04",
        "content": "As the campaign reaches its final month, the Republican nominee is intensifying his pattern of making false and outlandish statements."
    },
    {
        "title": "Ports Rush to Reopen After First Major Strike in Decades Is Suspended",
        "date": "2024-10-04",
        "content": "Days after tens of thousands of longshoremen along the East and Gulf Coasts walked out, their union and their bosses reached a tentative agreement on wages."
    },
    {
        "title": "Biden Voices Concern That the Election May Not Be ‘Peaceful’",
        "date": "2024-10-04",
        "content": "President Biden said he was confident next month’s election would be free and fair, but that he was concerned about what former President Donald J. Trump and his supporters would do if he lost his bid for another term."
    },
    {
        "title": "In Key Nevada County, Harassment of Election Workers Takes a Toll",
        "date": "2024-10-04",
        "content": "Republicans this year attempted to block certification of local elections in Washoe, a critical swing county — a worrying sign for what could be ahead, the Democratic secretary of state said."
    },
    {
        "title": "Trump Takes Aim at Legal Immigration",
        "date": "2024-10-04",
        "content": "The former president and his allies, who often decry undocumented immigrants, are targeting programs that allow millions of people to enter the country lawfully."
    },
    {
        "title": "Harris Ad to Showcase Support of Liz Cheney and Other Republicans",
        "date": "2024-10-04",
        "content": "Vice President Kamala Harris has been seeking to give Republicans who dislike the former president a permission structure to support her instead."
    },
    {
        "title": "Trump’s Return to Butler Is Sure to Be a Spectacle. Is It Safe?",
        "date": "2024-10-04",
        "content": "At a time of increased security risks, the former president has urged thousands of supporters to return with him to the place a gunman tried to take his life."
    },
    {
        "title": "Biden Says the Election Will Be Fair. But He’s Not Sure It Will Be Peaceful.",
        "date": "2024-10-04",
        "content": "President Biden’s remarks underscore the concerns in the government about the possibility of violence during or after the election."
    },
    {
        "title": "I’m a Queer Man Who Had a Fling With Another Guy. Should His Girlfriend Be Told?",
        "date": "2024-10-04",
        "content": "The magazine’s Ethicist columnist on who has the right and responsibility to reveal an affair."
    },
    {
        "title": "Biden Will Allow Legal Permission to Lapse for Migrants From 4 Countries",
        "date": "2024-10-04",
        "content": "The decision comes as political pressure mounts to cut down on programs that allow migrants to stay in the United States temporarily, even without a visa or green card."
    },
    {
        "title": "Conservative Activists Are Monitoring, and Filming, Voter Registration Sites",
        "date": "2024-10-04",
        "content": "In Arizona and other states, the activists are accusing Latino advocacy groups of registering undocumented immigrants. Canvassers are growing concerned about safety."
    },
    {
        "title": "Disaster Funding Has Its Own Perils",
        "date": "2024-10-04",
        "content": "Congressional leaders deferred a debate over sending federal money to respond to Hurricane Helene until after the election, delaying a potentially messy political fight."
    },
    {
        "title": "Undecided Voters Tell Us About Their Biggest Worries",
        "date": "2024-10-04",
        "content": "Donald J. Trump and Kamala Harris are starkly different presidential candidates. So why are so many voters —  roughly 1 in 6 — still unsure of their choice?"
    },
    {
        "title": "Engaging With a Conservative on Campus",
        "date": "2024-10-04",
        "content": "Responses to a conservative professor’s guest essay. Also: JD Vance at the debate; caring for child caregivers; smaller restaurant portions."
    },
    {
        "title": "Jobs Report Adds to Economic Momentum for Harris",
        "date": "2024-10-04",
        "content": "Recent reports have shown inflation slowing and the economy growing at a robust clip. The Fed has also cut interest rates, bringing mortgage rates down."
    },
    {
        "title": "The Job Market Is Chugging Along, Completing a Solid Economic Picture",
        "date": "2024-10-04",
        "content": "After months of wobbling, a fresh jobs report showed that hiring and wage growth are strong, aligning with other robust economic data."
    },
    {
        "title": "In Georgia, Black Men’s Frustration With Democrats Creates Opening for Trump",
        "date": "2024-10-04",
        "content": "Most Black men in the key battleground will back Vice President Kamala Harris — but the Trump campaign has made an effort to capitalize on a sense of dissatisfaction some voters have expressed."
    },
    {
        "title": "Exploring Your Political Identity and Values: A How-To Guide for Our 2024 Coming of Age Contest",
        "date": "2024-10-04",
        "content": "Four steps to figuring out what you want to say and how you would like to say it, with inspiration from 31 teen-created works across genres."
    },
    {
        "title": "Obama, Democrats’ Elder Statesman, Will Stump for Harris in Final Election Push",
        "date": "2024-10-04",
        "content": "Mr. Obama, the first Black president, had cast Vice President Kamala Harris as the inheritor of his political movement in a speech at the Democratic convention."
    },
    {
        "title": "Every Election Has Big Swings, Even in a Polarized Country. This One Will Too.",
        "date": "2024-10-04",
        "content": "In just the last few years, any number of issues might have led people to reconsider their loyalties."
    },
    {
        "title": "Democrats Have a Corruption Problem. They Can’t Keep Ignoring It.",
        "date": "2024-10-04",
        "content": "For the sake of their electoral fortunes and the country, Democrats must show voters a plan to curb corruption — including within their own ranks."
    },
    {
        "title": "The One Thing Not Named Trump That Trump Cares About",
        "date": "2024-10-04",
        "content": "For the former president, removing millions of undocumented immigrants is the solution to most of the nation’s most pressing challenges."
    },
    {
        "title": "The Economy Is at a Hinge Moment",
        "date": "2024-10-04",
        "content": "The economist Jason Furman discusses the economic fights that the next presidential administration will face."
    },
    {
        "title": "Unpacking the Role JD Vance Played on That Debate Stage",
        "date": "2024-10-04",
        "content": "Neither candidate engaged with the core criticisms facing their parties."
    },
    {
        "title": "Kamala Harris and the Influence of an Estranged Father Just Two Miles Away",
        "date": "2024-10-04",
        "content": "Donald J. Harris rarely speaks to his famous daughter, who lives nearby. But he helped shape who she became."
    },
    {
        "title": "Kamala Harris Is Doing Something Brilliant Up There on the Tightrope",
        "date": "2024-10-04",
        "content": "She’s strong. But she’s warm. That makes all the difference."
    },
    {
        "title": "Late Night Heaps Scorn on Trump’s Latest Defense",
        "date": "2024-10-04",
        "content": "Jimmy Kimmel said Donald Trump was “partially right” in denying interference in the 2020 election: “He tried to rig the election and failed to rig the election.’"
    },
    {
        "title": "The Year American Jews Woke Up",
        "date": "2024-10-04",
        "content": "American Jews need to recover their instinct for danger."
    },
    {
        "title": "Liz Cheney Endorses Kamala Harris",
        "date": "2024-10-04",
        "content": "The former congresswoman and Republican exile campaigned with the vice president in the battleground state of Wisconsin."
    },
    {
        "title": "Trump Rally in Michigan Dominated by More False Statements",
        "date": "2024-10-04",
        "content": "Appearing for roughly 85 minutes onstage, the Republican nominee repeated false claims about the 2020 election and introduced a mischaracterization about disaster-relief money."
    },
    {
        "title": "A Steely Liz Cheney, at Harris’s Side, Calls It ‘Our Duty’ to Reject Trump",
        "date": "2024-10-04",
        "content": "The former congresswoman and Republican exile stumped for Kamala Harris in Ripon, Wis., the birthplace of the G.O.P., calling on conservatives to shun Donald Trump’s “depraved cruelty.”"
    },
    {
        "title": "Walz, Appealing to Muslim Voters, Says War in Gaza ‘Must End Now’",
        "date": "2024-10-04",
        "content": "Gov. Tim Walz addressed a virtual event hosted by a group focused on building Muslim American political power."
    },
    {
        "title": "Los Angeles District Attorney Says He Is Reviewing Menendez Case",
        "date": "2024-10-04",
        "content": "Interest in the Menendez brothers has intensified after the release of a new Netflix drama about the case. A separate documentary is forthcoming."
    },
    {
        "title": "Teenagers on What Has Shaped Their Political Beliefs and Values",
        "date": "2024-10-04",
        "content": "Ahead of the 2024 Election, we invited teens to explore their political identities and tell us how they have come to believe what they believe."
    },
    {
        "title": "A Recipe for a Striving America",
        "date": "2024-10-03",
        "content": "The question is not whether to do industrial policy but how."
    },
    {
        "title": "Why Trump Is Lying About Disaster Relief",
        "date": "2024-10-03",
        "content": "His usual trash-talking is losing its mojo."
    },
    {
        "title": "Port Union Agrees to Suspend Strike",
        "date": "2024-10-03",
        "content": "The International Longshoremen’s Association received a new wage offer and will halt its walkout at East and Gulf Coast ports, which began Tuesday."
    },
    {
        "title": "At the Debate, JD Vance Put a Lifetime of Spin to Use",
        "date": "2024-10-03",
        "content": "Mr. Vance sanded down Donald Trump’s edges the way he often sharpens attacks for rally crowds — picking the facts that can deliver the most impact and discarding the rest."
    },
    {
        "title": "Biden Promised Federal Support for Survivors of Helene",
        "date": "2024-10-03",
        "content": "Also, Liz Cheney is campaigning tonight with Kamala Harris. Here’s the latest at the end of Thursday."
    },
    {
        "title": "Trump Saw 2020 Election Results as an Obstacle, Not an Outcome",
        "date": "2024-10-03",
        "content": "A court filing offers insight into his thinking and makes it hard to see him accepting another loss."
    },
    {
        "title": "Bruce Springsteen Endorses Kamala Harris for President",
        "date": "2024-10-03",
        "content": "The rock star has long aligned himself with Democrats and been critical of former President Donald J. Trump."
    },
    {
        "title": "Firefighters Union Declines to Endorse a Presidential Candidate",
        "date": "2024-10-03",
        "content": "The International Association of Fire Fighters was one of the first unions to endorse Joe Biden in 2020. In 2024, its board voted not to endorse at all."
    },
    {
        "title": "Filing in Trump Election Case Fleshes Out Roles of a Sprawling Cast",
        "date": "2024-10-03",
        "content": "Donald Trump is the only defendant in the special counsel’s case that charges him with a plot to remain in power after his 2020 loss. But a newly unsealed brief provides fresh details about many other figures."
    },
    {
        "title": "Former County Clerk Gets 9 Years in Prison for Tampering With Voting Machines",
        "date": "2024-10-03",
        "content": "Tina Peters, the former clerk of Mesa County, Colo., had tried to prove that the machines had been used to rig the 2020 election against former President Donald J. Trump."
    },
    {
        "title": "Photos Show New York Congressman in Blackface as Michael Jackson",
        "date": "2024-10-03",
        "content": "Representative Mike Lawler, a Republican locked in a tight race for re-election, dressed as the pop star for Halloween as a college student in 2006."
    },
    {
        "title": "Southern States Try to Minimize Voting Disruptions After Hurricane Helene",
        "date": "2024-10-03",
        "content": "Florida’s governor plans to sign an executive order giving election officials in 13 counties greater flexibility in administering early and absentee voting."
    },
    {
        "title": "After Helene, Even Restoring Internet Service Is Political",
        "date": "2024-10-03",
        "content": "Former President Donald J. Trump praised Elon Musk for bringing service to hard-hit areas. The Biden administration noted that the government was already on the case."
    },
    {
        "title": "Inside a Trump Ad Saying Harris Will Raise Taxes and He Will Cut Them",
        "date": "2024-10-03",
        "content": "A blunt argument hitting voters in the wallet, and a deceptive truncation of a quotation from The Times, pack a wallop."
    },
    {
        "title": "Unable to Penetrate Systems, Hackers Spread Lies About Vulnerabilities",
        "date": "2024-10-03",
        "content": "When France fended off cyberattacks during the Olympics, hackers circulated false claims about their attacks, a tactic the United States could face during the election."
    },
    {
        "title": "Trump, Vance and the Jan. 6 Case",
        "date": "2024-10-03",
        "content": "Readers respond to the special counsel Jack Smith’s filing. Also: The pain of IUD insertions; food and the environment; A.I. and the patient."
    },
    {
        "title": "U.S. Faces Economic Turbulence Just as Recession Fears Eased",
        "date": "2024-10-03",
        "content": "War in the Middle East, a strike by port workers and a devastating hurricane injected uncertainty into the U.S. economy."
    },
    {
        "title": "JD Vance Is Smoother — but No Better — Than Donald Trump",
        "date": "2024-10-03",
        "content": "Do not use normal appraisals for an abnormal election."
    },
    {
        "title": "Trump Says He Would Try Again to Revoke Haitian Immigrants’ Protections",
        "date": "2024-10-03",
        "content": "He again disparaged Haitians in Springfield, Ohio, and said he would end their legal status in the country and send them back. His first attempt to do that failed."
    },
    {
        "title": "Melania Trump, Whose Husband Helped End Roe, Signals Support for Abortion Rights",
        "date": "2024-10-03",
        "content": "As Donald Trump tries to muddy his anti-abortion position, his wife released a video calling “individual freedom” an “essential right that all women possess,” asking, “What does ‘my body, my choice’ really mean?”"
    },
    {
        "title": "The Union Leader Behind the Ports Strike",
        "date": "2024-10-03",
        "content": "As president of the International Longshoremen’s Association, Harold Daggett is taking advantage of organized labor’s resurgence to drive a hard bargain."
    },
    {
        "title": "How Trump Could Punish His Enemies",
        "date": "2024-10-03",
        "content": "We look at why legal experts are concerned."
    },
    {
        "title": "Biden Deploys Troops in Helene Aid Effort, and Trump’s Jan. 6 Case",
        "date": "2024-10-03",
        "content": "Plus, making fall foliage pop for the colorblind."
    },
    {
        "title": "Biden Traces Helene’s Ruinous Trail in Visits to Florida and Georgia",
        "date": "2024-10-03",
        "content": "President Biden promised that the government would not abandon the survivors of one of the deadliest storms in American history."
    },
    {
        "title": "Liz Cheney to Campaign With Harris at the Birthplace of the G.O.P.",
        "date": "2024-10-03",
        "content": "Ms. Cheney, the most prominent Republican to endorse the Democratic nominee, will appear alongside her in Ripon, Wis., where meetings in 1854 helped lead to the party’s formation."
    },
    {
        "title": "JD Vance, Tim Walz and the Fight for Rural America",
        "date": "2024-10-03",
        "content": "Both vice-presidential candidates have roots in parts of the country where voters feel overlooked, and Democrats have struggled."
    },
    {
        "title": "Who’s Too Old to Be President Now? Take a Guess.",
        "date": "2024-10-03",
        "content": "If voters felt 81 was too old for Joe Biden, it’s hard to believe they can overlook 78 in Donald Trump."
    },
    {
        "title": "Fact-Checking JD Vance and Tim Walz",
        "date": "2024-10-03",
        "content": "How factual have Senator JD Vance and Gov. Tim Walz been during the campaign? Linda Qiu, a New York Times reporter who looks at some statements made by politicians and public figures, checks some of their claims."
    },
    {
        "title": "The Real Loser of the V.P. Debate",
        "date": "2024-10-03",
        "content": "It’s our politics."
    },
    {
        "title": "Donald Trump, You Lucky Dog",
        "date": "2024-10-03",
        "content": "It’s unnerving how many fortunate things have happened to this guy."
    },
    {
        "title": "To Revive Manufacturing, How Much Can a President Do?",
        "date": "2024-10-03",
        "content": "The policy focus on the industry has changed from job quantity to job quality. And while federal incentives matter, local factors are more important."
    },
    {
        "title": "The Whiskey Industry Is Bracing for a Trade War if Trump Wins. It’s Not Alone.",
        "date": "2024-10-03",
        "content": "Business owners and foreign governments are preparing for high tariffs and trade disruptions, depending on the outcome of the election."
    },
    {
        "title": "Why Legal Experts Are Worried About a Second Trump Presidency",
        "date": "2024-10-03",
        "content": "In a survey of 50 members of the D.C. legal establishment, many warn that Trump could follow through on his threats to prosecute his political adversaries."
    },
    {
        "title": "Trump Promised to Release His Medical Records. He Still Won’t Do It.",
        "date": "2024-10-03",
        "content": "If elected again, he would become the oldest president by the end of his term. Yet he is refusing to disclose even basic health information."
    },
    {
        "title": "Four Takeaways From Jack Smith’s Brief in the Trump Election Case",
        "date": "2024-10-03",
        "content": "The special counsel provided new details that help flesh out how Donald Trump sought to remain in power, while setting out his argument for the case to survive the Supreme Court’s immunity decision."
    },
    {
        "title": "Walz Spoke of Gun Violence Affecting His Son. Here’s an Account of the Shooting.",
        "date": "2024-10-03",
        "content": "At Tuesday’s debate, Gov. Tim Walz said that his son, Gus Walz, witnessed a shooting at a community center. A volleyball coach said Gus helped other young players to safety."
    },
    {
        "title": "A Storm, a Strike and War Abroad Pose Challenges for Harris",
        "date": "2024-10-02",
        "content": "Scenes of striking workers, hurricane devastation in the Southeast and missiles over Israel represent a rare moment of turbulence for Kamala Harris."
    },
    {
        "title": "Transcript: Ezra Klein on the V.P. Debate",
        "date": "2024-10-02",
        "content": "The Oct. 2, 2024, episode of “The Ezra Klein Show.”"
    },
    {
        "title": "Harris Visits Georgia After Hurricane Helene, Promising Federal Help",
        "date": "2024-10-02",
        "content": "The vice president said federal money would play a major role in storm recovery efforts as she met with local officials in Augusta, Ga., and helped hand out food and snacks."
    },
    {
        "title": "A ‘Veep’ Star Vibe-Checks the Vance-Walz Showdown",
        "date": "2024-10-02",
        "content": "“This is not a date, it’s a debate!”"
    },
    {
        "title": "The V.P. Debate Came Down to One Moment",
        "date": "2024-10-02",
        "content": "JD Vance’s response to a question about challenging this year’s election results was telling."
    },
    {
        "title": "New Evidence Was Unsealed in the Federal Election Case Against Trump",
        "date": "2024-10-02",
        "content": "Also, Biden ordered 1,000 troops to help areas destroyed by Helene. Here’s the latest at the end of Wednesday."
    },
    {
        "title": "JD Vance and Tim Walz Debate Draws 43 Million Viewers",
        "date": "2024-10-02",
        "content": "The figure is significantly lower than the vice-presidential debate in 2020."
    },
    {
        "title": "Curious About How The Times Is Covering the Election? Send Us Your Questions.",
        "date": "2024-10-02",
        "content": "The election is fast approaching. New York Times editors and reporters want to answer your questions about how we will cover one of the biggest nights in news."
    },
    {
        "title": "Read the Special Counsel’s Newly Unsealed Evidence Against Trump",
        "date": "2024-10-02",
        "content": "A sprawling legal brief by the special counsel, Jack Smith, lays out his case for why former President Donald J. Trump is not immune from prosecution on federal charges of plotting to overturn the 2020 election. It adds new details of how Mr. Trum..."
    },
    {
        "title": "Trump Did Not ‘Save’ Obamacare. He Just Failed to Kill It.",
        "date": "2024-10-02",
        "content": "By trying to repeal and replace the law while president, he wound up making it popular."
    },
    {
        "title": "Thursday Briefing: Israeli Troops Clashed with Hezbollah",
        "date": "2024-10-02",
        "content": "Plus, what we learned from fashion month."
    },
    {
        "title": "The V.P. Debate Might Boost Vance and Walz, but It Probably Won’t Shift the Polls",
        "date": "2024-10-02",
        "content": "Voters may view JD Vance and Tim Walz more positively after Tuesday’s debate. But it’s unlikely to have much impact on their choices for president."
    },
    {
        "title": "Trump’s Insults to Harris’s Intelligence? Jokes, Lara Trump Claims.",
        "date": "2024-10-02",
        "content": "During rallies and on social media, former President Donald J. Trump has repeatedly disparaged Vice President Kamala Harris."
    },
    {
        "title": "How a Judge Will Weigh Immunity in Trump’s Jan. 6 Case",
        "date": "2024-10-02",
        "content": "How does the Supreme Court’s presidential immunity ruling apply to former President Donald J. Trump’s election-interference case? Here’s how Judge Tanya S. Chutkan will decide."
    },
    {
        "title": "Judge Unseals New Evidence in Federal Election Case Against Trump",
        "date": "2024-10-02",
        "content": "Judge Tanya Chutkan made public portions of a filing by prosecutors setting out their argument for why the case should go forward despite the Supreme Court’s ruling on presidential immunity."
    },
    {
        "title": "Mayorkas Warns of Funding Shortfall for Rest of Hurricane Season",
        "date": "2024-10-02",
        "content": "The homeland security secretary said FEMA, which is dealing with the destruction from Hurricane Helene, would need more money to respond to another major storm."
    },
    {
        "title": "A Shift Among Democrats: Embrace Record Levels of Oil and Gas",
        "date": "2024-10-02",
        "content": "Tim Walz said climate change is real, but boasted about high U.S. levels of oil and gas production. JD Vance called climate change “weird science.”"
    },
    {
        "title": "Like Trump, Vance Wavers on What to Do With Obamacare",
        "date": "2024-10-02",
        "content": "JD Vance seemed to back away from a proposal to separate healthy and sick people in insurance markets, which could cause major disruption for people with pre-existing conditions."
    },
    {
        "title": "Tim Walz as a Harris Ally: Folksy, Factually Sloppy and Far Less Visible",
        "date": "2024-10-02",
        "content": "The Minnesota governor has brought his charm to the campaign trail, but his debate was uneven and he has so far been scarcely seen on national television. His team says that may be changing."
    },
    {
        "title": "What Happens Next in Hunter Biden’s Criminal Cases",
        "date": "2024-10-02",
        "content": "The president’s son now confronts a daunting and uncertain process that could result in serious time behind bars when he is sentenced in his tax and gun cases in mid-December."
    },
    {
        "title": "Flare-Up in Israel-Iran Conflict Leaves Harris Unable to Avoid the Subject",
        "date": "2024-10-02",
        "content": "Missiles over Tel Aviv fed Donald Trump’s narrative of a world in chaos and vaporized any hopes of an end to the war. In the near term, that poses political problems for Democrats."
    },
    {
        "title": "JD Vance’s Old Yale Law Classmates Raise Money for Springfield’s Haitian Residents",
        "date": "2024-10-02",
        "content": "Some donors said they were seeking to repair damage the Trump-Vance campaign, and Mr. Vance himself, had caused by spreading bogus rumors that migrants were harming pets."
    },
    {
        "title": "On Child Care, Vance Tests a Talking Point Democrats Also Embrace",
        "date": "2024-10-02",
        "content": "Both vice-presidential candidates say the government should spend more on child care, a rare point of agreement. But there are still major differences in how they talk about families and gender roles."
    },
    {
        "title": "Vance vs. Walz: The Debate Reviews Are In",
        "date": "2024-10-02",
        "content": "Readers offer assessments of the candidates’ performances while praising the debate’s civility. Also: A college president’s resignation; storm relocation."
    },
    {
        "title": "It All Seemed So Conventional. And Then Came Jan. 6.",
        "date": "2024-10-02",
        "content": "JD Vance may well be thinking about 2028 and beyond. He will need a lot more than a fairly mild 90-minute debate to fully soften his image."
    },
    {
        "title": "Is It OK to Leave the U.S. if the Wrong Candidate Becomes President?",
        "date": "2024-10-02",
        "content": "The magazine’s Ethicist columnist on modes of resistance to American electoral politics."
    },
    {
        "title": "Vance and Walz’s Battle of the Network Co-Stars",
        "date": "2024-10-02",
        "content": "In what could be the last prime-time showdown of the 2024 campaign, the supporting players performed against type."
    },
    {
        "title": "Inside a Pro-Harris Ad Telling Hispanic Voters She’s Friendlier Than Trump",
        "date": "2024-10-02",
        "content": "An ad from two Democratic groups skates over Kamala Harris’s tough recent stance on border security and instead focuses on her more immigration-friendly plans."
    },
    {
        "title": "Tesla Sales Increase, Suggesting Electric Car Demand Is Rebounding",
        "date": "2024-10-02",
        "content": "The automaker reported a gain of 6.4 percent for the latest quarter, its first such increase this year."
    },
    {
        "title": "The Misogyny of Gen Z Men Has Been Overstated",
        "date": "2024-10-02",
        "content": "The majority of them support equality, even if they don’t call themselves feminists."
    },
    {
        "title": "Vance and Walz Spar Over Key Policy Issues",
        "date": "2024-10-02",
        "content": "Gov. Tim Walz of Minnesota and Senator JD Vance of Ohio debated immigration, abortion and foreign policy — and then clashed over Donald Trump’s 2020 election loss. Jazmine Ulloa, a national politics reporter for The New York Times, highlights some..."
    },
    {
        "title": "Israel Vows Retaliation Against Iran, and Takeaways From the Debate",
        "date": "2024-10-02",
        "content": "Plus, Mexico’s first female president."
    },
    {
        "title": "The Walz-Vance Debate: Civility and Then a Clash",
        "date": "2024-10-02",
        "content": "The vice-presidential candidates sparred over immigration, abortion and the Jan. 6 riot."
    },
    {
        "title": "Biden Surveys Wreckage From Helene and Deploys 1,000 Troops to Assist",
        "date": "2024-10-02",
        "content": "Officials are still uncovering the extent of the devastation in western North Carolina, which President Biden took in from the air. The storm killed at least 183 people in six states."
    },
    {
        "title": "Why Trump Wants to Make America the ‘Crypto Capital of the Planet’",
        "date": "2024-10-02",
        "content": "The former president’s views of virtual coins have shifted markedly in recognition of the emergence of this sector as a major player in campaign finance."
    },
    {
        "title": "‘Vance’s Excellent Reviews Will Enrage Trump’: 13 Writers on Who Won the Vice-Presidential Debate",
        "date": "2024-10-02",
        "content": "Our columnists and contributors rate Tim Walz’s and JD Vance’s debate performances."
    },
    {
        "title": "How Two Billionaire Preachers Remade Texas Politics",
        "date": "2024-10-02",
        "content": "They control Republican politics in the state. Now they’re poised to take their theocratic agenda nationwide."
    },
    {
        "title": "This Is Why MAGA Loves JD Vance",
        "date": "2024-10-02",
        "content": "Trump’s running mate is no Mike Pence."
    },
    {
        "title": "Best, Worst and Most Unlikely Lines of the Vice-Presidential Debate",
        "date": "2024-10-02",
        "content": "JD Vance gave a shout-out to his wife. Tim Walz sang the praises of Minnesota. Offstage, Donald Trump got distracted."
    },
    {
        "title": "Vance Strains to Sell a Softer Trump",
        "date": "2024-10-02",
        "content": "From the opening handshake, the Republican vice-presidential nominee sought to reinvent and repackage the record and views of the former president."
    },
    {
        "title": "The Campaigns Need Younger People to Vote. Did the V.P. Debate Help?",
        "date": "2024-10-02",
        "content": "At three colleges, there were snacks, big screens and homework assignments. But energy and enthusiasm were sparse — and by the end, even more so."
    },
    {
        "title": "Who Won the Debate? A Crisp Vance Fends Off Walz",
        "date": "2024-10-02",
        "content": "The vice-presidential candidates largely avoided personal attacks, with JD Vance showing a knack for revising history while Tim Walz appeared to battle nerves."
    },
    {
        "title": "The Moment When Vance Dodged a Jan. 6 Question but Said Plenty",
        "date": "2024-10-02",
        "content": "JD Vance sailed fairly smoothly through some 90 minutes of Tuesday’s debate with Tim Walz. Then the subject turned to the Jan. 6, 2021, attack on the Capitol."
    },
    {
        "title": "A Wider War in the Middle East, From Hamas to Hezbollah and Now Iran",
        "date": "2024-10-02",
        "content": "The main questions now are how much the conflict will escalate and whether the United States will get more directly involved in the defense of Israel."
    },
    {
        "title": "Civility and Then a Clash Over Jan. 6: Seven Takeaways From the Debate",
        "date": "2024-10-02",
        "content": "Senator JD Vance of Ohio and Gov. Tim Walz of Minnesota sparred over immigration, abortion and foreign policy — and then on Donald Trump’s 2020 election loss."
    },
    {
        "title": "The Politics of a Boring Suit",
        "date": "2024-10-02",
        "content": "A night of few fireworks between the candidates was also a night of little sartorial flair. And that was the goal."
    },
    {
        "title": "Vance Says Trump Delivered ‘Stability’",
        "date": "2024-10-02",
        "content": "Senator JD Vance defended Donald J. Trump’s time in office during the vice-presidential debate."
    },
    {
        "title": "Walz Calls Himself a ‘Knucklehead’ for Past Misstatements",
        "date": "2024-10-02",
        "content": "Gov. Tim Walz said he “misspoke” about where he was during the Tiananmen Square massacre in June of 1989."
    },
    {
        "title": "Walz Tells of Women Living Under Abortion Bans, Putting Vance on the Defensive",
        "date": "2024-10-02",
        "content": "By recounting stories of women who have suffered dire health consequences since Roe’s overturning, Gov. Tim Walz of Minnesota embraced a Democratic strategy as he argued for abortion rights."
    },
    {
        "title": "Walz Says His Son Witnessed a Shooting at a Community Center",
        "date": "2024-10-02",
        "content": "The story by Gov. Tim Walz of Minnesota drew sympathy from his Republican opponent, Senator JD Vance of Ohio."
    },
    {
        "title": "At a Wisconsin Watch Party, the Debate Leaves Some Students Uninspired",
        "date": "2024-10-02",
        "content": "Some students at the University of Wisconsin-Parkside seemed underwhelmed. One noted, ‘This is long, huh?’"
    },
    {
        "title": "Gov. Walz Criticizes Trump’s Record on Roe v. Wade",
        "date": "2024-10-02",
        "content": "Gov. Tim Walz attacked former President Donald J. Trump’s record on abortion — and then turned to the stories of women living with the consequences of abortion bans."
    },
    {
        "title": "Walz Says His Teenage Son Witnessed Shooting",
        "date": "2024-10-02",
        "content": "Gov. Tim Walz, mentioning his family’s exposure to gun violence, made the case for stricter gun control laws."
    },
    {
        "title": "Walz Failed to Expose Vance’s Debate Masquerade",
        "date": "2024-10-02",
        "content": "Harris’s running mate missed multiple opportunities to demonstrate how Trump and his running mate are unfit for office."
    },
    {
        "title": "CBS Sought the Middle Ground on Fact-Checking. Vance Jumped Into the Gap.",
        "date": "2024-10-02",
        "content": "During Tuesday’s vice-presidential debate, JD Vance clashed with a moderator over whether the ground rules allowed her to clarify his comments about immigrants in his home state."
    },
    {
        "title": "Walz Says He ‘Misspoke’ About Being in Hong Kong During Tiananmen Square Protests",
        "date": "2024-10-02",
        "content": "At the vice-presidential debate, Gov. Tim Walz tried to dismiss a previous misstatement as insignificant and said he could be “a knucklehead at times.”"
    },
    {
        "title": "Exchange Between Vance and Walz Shows Gulf on Climate Change Views",
        "date": "2024-10-02",
        "content": "As Hurricane Helene made climate change an early focus of the vice-presidential debate, the running mates quickly demonstrated the stark differences between the parties on the issue."
    },
    {
        "title": "Vance’s Dominant Debate Performance Shows Why He’s Trump’s Running Mate",
        "date": "2024-10-02",
        "content": "He’s making a case for Trump’s record far more effectively than Trump has ever been capable of doing."
    },
    {
        "title": "Video Footage Shows Fatal Shooting of Kentucky Judge",
        "date": "2024-10-02",
        "content": "A preliminary hearing in the case against a former sheriff yielded details about his interactions with the slain judge before he was killed."
    },
    {
        "title": "Tracking Attacks in the Vance-Walz Debate",
        "date": "2024-10-01",
        "content": "See how the vice presidential candidates used their speaking time to discuss the issues or criticize their opponent."
    },
    {
        "title": "The Veep Debate, or When the Opening Act Becomes the Headliner",
        "date": "2024-10-01",
        "content": "Tonight’s showdown could be the last between representatives of both tickets before the election."
    },
    {
        "title": "In a Pair of Disjointed Events, Trump Talks Gaza, Migrants and ‘Full Metal Jacket’",
        "date": "2024-10-01",
        "content": "President Donald J. Trump criticized President Biden’s leadership and insisted again he would have prevented the crisis in the Middle East had he won in 2020."
    },
    {
        "title": "CBS Says Trump Will Not Participate in ‘60 Minutes’ Interview",
        "date": "2024-10-01",
        "content": "This is not the first time that the former president has clashed with the country’s most popular television news program."
    },
    {
        "title": "When an Ohioan Debates a Minnesotan, the Midwest Takes Center Stage",
        "date": "2024-10-01",
        "content": "JD Vance and Tim Walz each have roots in the Midwest, but how voters in the region will view the vice-presidential candidates’ different visions remains to be seen."
    },
    {
        "title": "Israel Weighs Retaliation After Iranian Missile Attack",
        "date": "2024-10-01",
        "content": "Security analysts and former officials said the damage Israel had inflicted on Hezbollah, an Iranian-backed militia, had stripped Tehran of much of its deterrence against a wider Israeli attack."
    },
    {
        "title": "Iran Attacked Israel With Waves of Missiles",
        "date": "2024-10-01",
        "content": "Also, Tim Walz and JD Vance will face off tonight in a debate. Here’s the latest at the end of Tuesday."
    },
    {
        "title": "U.S. Destroyers Helped Israel Intercept Iran’s Missiles, Biden Says",
        "date": "2024-10-01",
        "content": "The president said the United States was “fully, fully, fully supportive of Israel,” in a show of solidarity between two allies whose relations have become strained."
    },
    {
        "title": "Wednesday Briefing: Iran Launched Ballistic Missiles at Israel",
        "date": "2024-10-01",
        "content": "Plus, Jimmy Carter turned 100."
    },
    {
        "title": "Tim Walz Said He Was in Hong Kong in 1989 During Tiananmen. Not True.",
        "date": "2024-10-01",
        "content": "Mr. Walz taught at a high school in China as part of a program sending American teachers abroad, but he did not actually travel to the country until August 1989."
    },
    {
        "title": "Inside a Trump Ad Slamming Harris Over the Push for Electric Vehicles",
        "date": "2024-10-01",
        "content": "Scaremongering in Michigan, an ad claims that the vice president wants to “end all gas-powered cars” and that her policies would lead to “massive layoffs.”"
    },
    {
        "title": "Biden Scrambles to Contain Economic and Political Fallout of Port Strike",
        "date": "2024-10-01",
        "content": "The labor dispute has forced President Biden and Vice President Kamala Harris into a complicated position just weeks before the election."
    },
    {
        "title": "The Ghosts of Vice-Presidential Debates Past",
        "date": "2024-10-01",
        "content": "The face-offs between the candidates on the bottom of the ticket have produced some standout moments. Here’s a look at the most memorable exchanges."
    },
    {
        "title": "What Tim Walz’s Time in Minnesota Says About How He Governs",
        "date": "2024-10-01",
        "content": "Mr. Walz was willing to move the state swiftly to the left as soon as Democrats had an opening. He supported all but one bill that fellow Democrats approved, issuing a single veto last year."
    },
    {
        "title": "Ohio Reaps Benefits From a Climate Law JD Vance Repeatedly Attacks",
        "date": "2024-10-01",
        "content": "Former President Donald J. Trump has called for clawing back unspent funds included in the Inflation Reduction Act, President Biden’s landmark climate bill. That could have adverse impacts in Ohio."
    },
    {
        "title": "Trump’s Consistent Message Online and Onstage: Be Afraid",
        "date": "2024-10-01",
        "content": "Donald Trump has long used fear as a tool to stir up his conservative base. He’s taking his doomsday approach to a new extreme, predicting World War III and other catastrophes."
    },
    {
        "title": "Trump Insults Harris’s Mental Fitness, Adding to Questions About His Own",
        "date": "2024-10-01",
        "content": "Readers condemn the former president’s attacks and cite examples of his  incoherence and unfitness. Also: Jimmy Carter at 100; Christian women; the Oakland A’s."
    },
    {
        "title": "Why a Racist Professor Doesn’t Scare Me",
        "date": "2024-10-01",
        "content": "Having grown up in an increasingly diverse America, I find Amy Wax’s resentments more pathetic than threatening."
    },
    {
        "title": "What to Know About JD Vance and Project 2025",
        "date": "2024-10-01",
        "content": "JD Vance has repeatedly tried to distance himself from the project, a conservative policy blueprint for a future Republican administration that has outraged Democrats."
    },
    {
        "title": "A Tense, Policy-Heavy Debate Ends With Clash Over Democracy",
        "date": "2024-10-01",
        "content": "Senator JD Vance of Ohio and Gov. Tim Walz of Minnesota kept their disagreements civil. What was perhaps the sharpest exchange of the night came at the end of the night."
    },
    {
        "title": "Fact-Checking Vance and Walz on the Campaign Trail",
        "date": "2024-10-01",
        "content": "Gov. Tim Walz of Minnesota has acted as attack dog for the Harris campaign, and Senator JD Vance of Ohio has stepped in to explain away former President Donald J. Trump’s incendiary remarks."
    },
    {
        "title": "‘There’s a Trap Here’: Four Columnists Brace for the Vance-Walz Debate",
        "date": "2024-10-01",
        "content": "With Harris and Trump locked in a tight race, will the vice-presidential debate do anything to help or hurt either ticket?"
    },
    {
        "title": "Mark Cuban on Why He’s All In for Kamala Harris",
        "date": "2024-10-01",
        "content": "One of the most surprising surrogates of 2024 argues that Harris is best for the economy — and therefore for everyone."
    },
    {
        "title": "Why Georgia’s Election Board Is Being Sued",
        "date": "2024-10-01",
        "content": "Georgia, one of the most important battleground states in the country, finds itself back in the news after Democrats sued the Georgia State Election Board on Monday."
    },
    {
        "title": "Trump Thinks Harris’s Sisterhood Is a ‘Sorority Party.’ He Should Think Again.",
        "date": "2024-10-01",
        "content": "The vice president is an institutionalist politician. Her membership in a “Divine Nine” organization helps explain why."
    },
    {
        "title": "How JD Vance Disqualified Himself From Becoming Vice President",
        "date": "2024-10-01",
        "content": "Why he represents a grave risk to the rule of law in American democracy."
    },
    {
        "title": "Teens, What Makes You Want to Make Your Voice Heard?",
        "date": "2024-10-01",
        "content": "This week, the Headway Election Challenge hears from teenagers who are turning out the vote for this year’s election, and even working to pass legislation."
    },
    {
        "title": "Early Voting Has Started. Here’s What to Watch.",
        "date": "2024-10-01",
        "content": "Track the early vote for the 2024 election."
    },
    {
        "title": "Not Just Fun and Games: Politics Edges Deeper Into Livestreams",
        "date": "2024-10-01",
        "content": "As more streamers discuss politics, including major events like Tuesday’s debate, they have become the focus of intense interest for both presidential campaigns."
    },
    {
        "title": "Could Republicans Gain a Senate Seat After the Menendez Scandal?",
        "date": "2024-10-01",
        "content": "Curtis Bashaw, a Republican hotel owner, is running a long-shot campaign to represent New Jersey in the Senate against Andy Kim, a Democratic congressman."
    },
    {
        "title": "Port Workers Strike on East and Gulf Coasts",
        "date": "2024-10-01",
        "content": "Members of the International Longshoremen’s Association walked out for the first time since 1977 in a standoff over wages, benefits and job security."
    },
    {
        "title": "What to Watch For in Tuesday’s Vance-Walz Debate",
        "date": "2024-10-01",
        "content": "As the two running mates hold their first debate in New York, here is what to be on the lookout for."
    },
    {
        "title": "Vance Pitches Republican Megadonors on Eve of Debate",
        "date": "2024-10-01",
        "content": "Senator JD Vance addressed some of the party’s biggest donors at a private sit-down before the American Opportunity Alliance."
    },
    {
        "title": "How Trump Tore One Family Apart",
        "date": "2024-10-01",
        "content": "His father was “an honest, loving man” but then fell under the sway of MAGA."
    },
    {
        "title": "Newsom Tacks to the Middle With California in the Spotlight",
        "date": "2024-10-01",
        "content": "While Donald J. Trump has attacked California as too liberal for the nation, Gov. Gavin Newsom has vetoed several bills that could have become political fodder."
    }
]