[
    {
        "title": "North Carolina Officials Begin Post-Helene Election Planning",
        "date": "2024-09-30",
        "content": "While the region hit hardest is largely rural, it holds a healthy share of the state’s nearly 7.7 million registered voters."
    },
    {
        "title": "The Politics of Disaster",
        "date": "2024-09-30",
        "content": "Big storms before elections are a test of how would-be — or incumbent — leaders handle a crisis."
    },
    {
        "title": "Trump, No Stranger to Playing Storm Politics, Visits a Battered Georgia",
        "date": "2024-09-30",
        "content": "In Valdosta, Ga., Donald Trump made a false claim about President Biden’s responsiveness and demonstrated his long-held instinct to view disaster response through the prism of his personal politics."
    },
    {
        "title": "Why Isn’t Harris Clobbering Trump? These 15 Swing State Voters Can Tell You.",
        "date": "2024-09-30",
        "content": "The participants discuss what either candidate might say that could solidify their vote."
    },
    {
        "title": "Why Trumponomics Could Lead to Trumpflation",
        "date": "2024-09-30",
        "content": "The former president is contemplating policies that would act like a self-inflicted pandemic."
    },
    {
        "title": "Pennsylvania Republicans Lag Democrats in Early Mail Ballot Requests",
        "date": "2024-09-30",
        "content": "Encouraging voters to cast mail ballots — and cast them early — benefits political campaigns. But former President Donald J. Trump’s skepticism has hurt Republican efforts in a key state."
    },
    {
        "title": "Trump Says ‘One Really Violent Day’ Would End Property Crime",
        "date": "2024-09-30",
        "content": "The remarks were the latest example of his praise for executive power and force in imposing order, this time over crimes the F.B.I. said last week were falling."
    },
    {
        "title": "Tester’s Senate Fate Could Make or Break a Harris Presidency",
        "date": "2024-09-30",
        "content": "With Democrats waging an uphill battle to hold the Senate, the vice president, should she win, could end up facing a Republican firewall with veto power over her cabinet, court picks and legislation."
    },
    {
        "title": "Biden Expands Asylum Restrictions at the Southern Border",
        "date": "2024-09-30",
        "content": "Biden administration officials have credited the policy for leading to the dramatic reduction in illegal crossings."
    },
    {
        "title": "In Biden’s Homestretch, Selfies on Air Force One and a Chorus of ‘Thank You, Joe’",
        "date": "2024-09-30",
        "content": "In the months since President Biden dropped out of the race, Democratic voters have bombarded him with words of gratitude. But they are, at least in part, thanking him for quitting."
    },
    {
        "title": "How Should We View and Treat Obesity?",
        "date": "2024-09-30",
        "content": "Readers discuss an essay about whether it is a disease and how it should be diagnosed. Also: Fear in schools; natural disasters; political distractions."
    },
    {
        "title": "Democrats Sue Over Georgia Requirement That Ballots Be Counted by Hand",
        "date": "2024-09-30",
        "content": "The lawsuit claims that the new rule would invite chaos on election night, delaying some reporting and putting the security of ballots at risk."
    },
    {
        "title": "In Iowa, Democrats Count on Backlash to Abortion Law to Bolster Bids for Congress",
        "date": "2024-09-30",
        "content": "Democrats in a pair of competitive House districts are spotlighting the anti-abortion stances of Republican incumbents after the state enacted one of the most restrictive bans in the country."
    },
    {
        "title": "Want to Check That Fact? For V.P. Debate Viewers, Just Scan the Code.",
        "date": "2024-09-30",
        "content": "CBS is experimenting with a novel way to offer real-time fact-checking of the vice-presidential debate on Tuesday. Just don’t expect the moderators to frequently jump in."
    },
    {
        "title": "Around the World, Diplomats Gird for a Trump Assault on Climate Action",
        "date": "2024-09-30",
        "content": "Some leaders insist that the global clean energy transition will happen with or without the United States."
    },
    {
        "title": "We Watched Vance’s Old Debates. Here’s What We Learned.",
        "date": "2024-09-30",
        "content": "Senator JD Vance assumed his first public office just last year. But to win that job, he had to survive about a dozen debates, sharpening his chops when facing opponents onstage."
    },
    {
        "title": "We Watched Tim Walz’s Old Debates. Here’s What We Learned.",
        "date": "2024-09-30",
        "content": "He may not be a lofty orator, but he has shown an ability to deliver punchy critiques with Everyman appeal."
    },
    {
        "title": "Inside a Kamala Harris Ad That Draws an Implicit Contrast on Character",
        "date": "2024-09-30",
        "content": "Voters have signaled that they want to know more about the vice president. By leaning on her background as a prosecutor, this ad aims to fill in those gaps and assuage any worries."
    },
    {
        "title": "Michel Houellebecq’s Outlook for an Ailing France: C’est Fini",
        "date": "2024-09-30",
        "content": "In what the author says is his last novel, both a family and a society are on the verge of collapse."
    },
    {
        "title": "Alliance vs. Isolation: Harris and Trump’s Competing Views on Foreign Policy",
        "date": "2024-09-30",
        "content": "How the candidates position themselves regarding the wars in Ukraine and the Middle East."
    },
    {
        "title": "Nothing to See Here but Upgrades",
        "date": "2024-09-30",
        "content": "Eric Adams gives new meaning to the concept of the frequent-flier program."
    },
    {
        "title": "They’ve Made Hats for McCain and Trump. And Obama and Harris.",
        "date": "2024-09-30",
        "content": "One of the last remaining union-run hat factories in the country is in New Jersey. Over more than three decades, its workers have made hats for competing campaigns."
    },
    {
        "title": "Will the Real Midwest Please Stand Up?",
        "date": "2024-09-30",
        "content": "The vice-presidential debate, pitting Senator JD Vance of Ohio against Gov. Tim Walz of Minnesota, shines the spotlight on a complicated region."
    },
    {
        "title": "State of the Race: A Calm Week and Perhaps the Clearest Picture Yet",
        "date": "2024-09-30",
        "content": "It’s getting easier to trust that the news isn’t driving the numbers, and we take a closer look at the Hispanic vote."
    },
    {
        "title": "Millions Could Lose Insurance Subsidies, Depending on the Election",
        "date": "2024-09-30",
        "content": "The issue is getting less attention than a possible repeal of the Affordable Care Act, but it’s much more likely to happen."
    },
    {
        "title": "Jimmy Carter Approaches the Century Mark, Eclipsing His Presidential Peers",
        "date": "2024-09-30",
        "content": "Nineteen months after entering hospice care, the 39th president is set to turn 100 on Tuesday. His birthday wish? A chance to vote for his party’s candidate one more time."
    },
    {
        "title": "Counteroffers Exchanged in Effort to Avert U.S. Dock Strike",
        "date": "2024-09-30",
        "content": "A work stoppage at East and Gulf Coast ports would halt most activity at some of the busiest American ports."
    },
    {
        "title": "An Ohio Businessman Faces Death Threats for Praising His Haitian Workers",
        "date": "2024-09-30",
        "content": "The lifelong Republican employs fewer Haitians than others in Springfield, but his life has been upended since Donald J. Trump spread falsehoods about immigrants in his hometown."
    },
    {
        "title": "An Open Letter to Jimmy Carter, on His 100th Birthday",
        "date": "2024-09-30",
        "content": "You have made the most of a long life, Mr. President, serving in nearly every way imaginable as an example of moral seriousness and service to others."
    },
    {
        "title": "As Mexico’s President Steps Down, Some Laud His Legacy, but Others Fear It",
        "date": "2024-09-30",
        "content": "President Andrés Manuel López Obrador lifted millions out of poverty while eroding democratic norms, allowing his nationalist political movement to expand its sway."
    },
    {
        "title": "Trump’s Volunteers: ‘Beautiful Ladies’ From a Secretive Evangelical Church",
        "date": "2024-09-30",
        "content": "Women from an insular North Carolina church — with a history of “blasting” members judged sinners — are helping to stage the former president’s campaign events."
    },
    {
        "title": "What to Expect if Kennedy Is Promoted to a Position of Power",
        "date": "2024-09-30",
        "content": "Giving him a top health job would entrench partisanship around public health."
    },
    {
        "title": "A Good Reason for Rural Rage: The Crushing Power of Corporate Meat",
        "date": "2024-09-30",
        "content": "Highlighting efforts to reduce the power of Big Ag over farmers can be a winning strategy for Harris."
    },
    {
        "title": "The Case Kamala Harris Can’t Stop Prosecuting",
        "date": "2024-09-30",
        "content": "Being tougher on so-called frauds, cheaters and financial predators would make the criminal justice system a bit more equal."
    },
    {
        "title": "The Only Patriotic Choice for President",
        "date": "2024-09-30",
        "content": "Kamala Harris has demonstrated care, competence and respect for the Constitution — the fundamental qualities necessary for high office."
    },
    {
        "title": "Harris Tries to Goad Trump Into Another Debate",
        "date": "2024-09-30",
        "content": "At a rally in Las Vegas, Vice President Kamala Harris played up the vice-presidential debate set for Tuesday and pushed for another face-off with former President Donald J. Trump."
    },
    {
        "title": "After Harris Calls for a Crackdown on Fentanyl, Trump Twists Her Position",
        "date": "2024-09-29",
        "content": "Vice President Kamala Harris vowed to combat the flow of fentanyl into the country when she visited the border on Friday. Former President Donald J. Trump ratcheted up his false claims in response."
    },
    {
        "title": "Trump Says He’s in Danger. So Why Did He Seek Out the Embrace of 100,000 Fans?",
        "date": "2024-09-29",
        "content": "After two assassination attempts, the former president seems to be relishing the dangers of his job. Some at the Georgia-Alabama football game wondered if his appearance was wise."
    },
    {
        "title": "Monday Briefing: The Aftermath of Nasrallah’s Death",
        "date": "2024-09-29",
        "content": "Plus, we retraced one of Mayor Eric Adams’s lavish trips to Istanbul."
    },
    {
        "title": "California Governor Vetoes Sweeping A.I. Legislation",
        "date": "2024-09-29",
        "content": "The bill would have been the first in the nation to place strict guardrails on the new technology, but Gov. Gavin Newsom said the bill was flawed."
    },
    {
        "title": "Republicans Criticize Trump Over His Insults of Harris",
        "date": "2024-09-29",
        "content": "Several Republicans distanced themselves from their party’s standard-bearer after he called Vice President Kamala Harris “mentally disabled.”"
    },
    {
        "title": "Top Adams Aides Get Married as Investigation Swirls Around Them",
        "date": "2024-09-29",
        "content": "Eric Adams’s schools chancellor and first deputy mayor married in Martha’s Vineyard this weekend. Both have had their phones seized by federal investigators."
    },
    {
        "title": "Rape Cases in the Headlines and in Our Everyday Lives",
        "date": "2024-09-29",
        "content": "Readers discuss a guest essay about famous cases and offer personal stories. Also: Helping immigrants; A.I. at war; Donald Trump, TV and real life."
    },
    {
        "title": "I Grew Up Much Like JD Vance. How Did We End Up So Different?",
        "date": "2024-09-29",
        "content": "The vice-presidential nominee should be thinking of how to extend a ladder to those he left behind, not how to pull it up behind him."
    },
    {
        "title": "Netanyahu, Ignoring Allies and Defying Critics, Basks in a Rare Triumph",
        "date": "2024-09-29",
        "content": "Israel’s strike on Hassan Nasrallah was the culmination of several startling moves that suggest the Israeli prime minister feels unconstrained by foreign criticism."
    },
    {
        "title": "There’s a Dangerous Misconception About the Military’s Obligations to the President",
        "date": "2024-09-29",
        "content": "The prospect of a second Trump administration has rekindled an important debate from four years ago."
    },
    {
        "title": "Why the World’s Biggest Powers Can’t Stop a Middle East War",
        "date": "2024-09-29",
        "content": "The United States’ ability to influence events in the Mideast has waned, and other major nations have essentially been onlookers."
    },
    {
        "title": "Beneath the Potential Strike at U.S. Ports: Tensions Over Innovation",
        "date": "2024-09-29",
        "content": "Port operators have long embraced automation, while dockworkers view it as a threat to their livelihoods."
    },
    {
        "title": "Five Court Cases to Watch Ahead of Election Day",
        "date": "2024-09-29",
        "content": "A blizzard of voting lawsuits are landing in swing states in the final weeks before the election. Here’s a guide to the cases that could matter most."
    },
    {
        "title": "The Border in the Campaign and in Real Life",
        "date": "2024-09-29",
        "content": "What do some people who live on the border make of the shifting politics in the battle over their backyard? Astead W. Herndon, a national politics reporter and the host of the politics podcast “The Run-Up,” talked with a group in El Paso, mostly D..."
    },
    {
        "title": "Donald Trump and His Real-Life Apprentice",
        "date": "2024-09-29",
        "content": "The former president views JD Vance as a kindred political spirit, while Mr. Vance has spoken of Mr. Trump as a kind of father figure."
    },
    {
        "title": "Trump Allies Bombard the Courts, Setting Stage for Post-Election Fight",
        "date": "2024-09-29",
        "content": "Republicans are filing a barrage of election lawsuits in the final weeks of the presidential campaign. The cases may be a road map for a legal battle over the results."
    },
    {
        "title": "In a Year of Elections, Democracies Face Threats as Extremist Parties Surge",
        "date": "2024-09-29",
        "content": "Experts at the Democracy Forum in Athens this week will explore the global challenges to democracy and attempt to weigh how endangered it really is."
    },
    {
        "title": "The Black Church Has a Gen-Z Issue: ‘They Don’t Come Into the Building Anymore’",
        "date": "2024-09-29",
        "content": "These congregations are struggling to attract younger members. That has consequences for social cohesion and Black political power writ large."
    },
    {
        "title": "A Grieving Mother. A Famous Uncle. An Unlikely Crusade.",
        "date": "2024-09-29",
        "content": "Tragedy turned Nadia Milleron, Ralph Nader’s niece, into an activist. Now she’s on a long-shot campaign for Congress."
    },
    {
        "title": "Vance Criticizes Ukraine’s President a Day After His Meeting With Trump",
        "date": "2024-09-29",
        "content": "Senator JD Vance of Ohio, former President Donald J. Trump’s running mate, criticized President Volodymyr Zelensky of Ukraine during a campaign rally in Pennsylvania."
    },
    {
        "title": "Trump’s Answer to Harris’s Border Trip: Calling Her ‘Mentally Disabled’",
        "date": "2024-09-29",
        "content": "Former President Donald J. Trump assailed Vice President Kamala Harris in harshly personal terms in what he conceded was “a dark speech.”"
    },
    {
        "title": "Strike on Hezbollah Deepens Disconnect Between Biden and Netanyahu",
        "date": "2024-09-28",
        "content": "Israeli officials gave their American counterparts no advance warning of the strike that killed Hassan Nasrallah, the longtime leader of Hezbollah, according to U.S. officials. But Mr. Biden said the killing was “a measure of justice” for victims ..."
    },
    {
        "title": "Vance Appears at Event of Evangelical Leader Who Spoke of Harris’s ‘Witchcraft’",
        "date": "2024-09-28",
        "content": "Senator JD Vance of Ohio campaigned in Pennsylvania at an event organized by Lance Wallnau, who described Vice President Kamala Harris’s debate performance as “witchcraft.”"
    },
    {
        "title": "The Fans Want to Watch Football. Trump and Walz Will Be There, Too.",
        "date": "2024-09-28",
        "content": "Donald Trump and Tim Walz are attending college games on Saturday that will draw plenty of viewers in the swing states of Michigan and Georgia."
    },
    {
        "title": "Trump Voters Drive a Rise in Ticket Splitting",
        "date": "2024-09-28",
        "content": "Ticket splitters in key presidential battlegrounds and Ohio tend to be supporters of Donald J. Trump who are skeptical of his picks for Senate, polling shows."
    },
    {
        "title": "Can Lina Khan Hold On?",
        "date": "2024-09-28",
        "content": "Ms. Khan’s term as the chair of the Federal Trade Commission ended Wednesday. In a wide-ranging interview, she discussed her aggressive approach to antitrust and its critics."
    },
    {
        "title": "The Indictment of Eric Adams Shouldn’t Surprise Us",
        "date": "2024-09-28",
        "content": "The mayor is accused of injecting foreign funds directly into his election campaigns, compromising not only his office but also American elections."
    },
    {
        "title": "The Most Important Question Kamala Harris Hasn’t Answered",
        "date": "2024-09-28",
        "content": "What would a President Harris do about the war in Ukraine?"
    },
    {
        "title": "Kamala Harris Said She Owns a Gun for a Very Strategic Reason",
        "date": "2024-09-28",
        "content": "She has been doing an effective job of vice signaling from the left."
    },
    {
        "title": "At Capacity",
        "date": "2024-09-28",
        "content": "If we can’t remember the things we read and watch and even loved, do they still “count”?"
    },
    {
        "title": "Harris’s Historic Run Could Outpace Hollywood’s Oval Offices",
        "date": "2024-09-28",
        "content": "Black and Asian American women have rarely, if at all, played the U.S. commander in chief in television and film. As Kamala Harris makes her presidential bid, Hollywood lags behind."
    },
    {
        "title": "John Oliver Is Still Working Through the Rage",
        "date": "2024-09-28",
        "content": "The host of ‘Last Week Tonight’ talks about what he’s learned in the ten years of making the show and why he doesn’t consider himself a journalist."
    },
    {
        "title": "Could We See a 270-268 Election? The Polls Are Tighter Than Ever.",
        "date": "2024-09-28",
        "content": "The latest Times/Siena polls show Harris slightly ahead in Michigan and Wisconsin, with a healthy lead in Nebraska’s Second District."
    },
    {
        "title": "Ahead of Debate, Walz Is Viewed More Favorably Than Vance in Midwest, Polls Find",
        "date": "2024-09-28",
        "content": "Gov. Tim Walz is viewed more favorably than Senator JD Vance by likely voters in Michigan, Ohio and Wisconsin, according to New York Times/Siena College polls."
    },
    {
        "title": "Harris Leads in Race for Eastern Nebraska’s One Electoral Vote, Poll Finds",
        "date": "2024-09-28",
        "content": "If Ms. Harris were to win the “blue wall” and lose the Sun Belt swing states, the single electoral vote in Greater Omaha could determine the winner of the presidential election."
    },
    {
        "title": "Democratic Senate Candidates Lead in Ohio, Michigan and Wisconsin, Polls Find",
        "date": "2024-09-28",
        "content": "Strong showings in new Times/Siena College polls leave a narrow path open for Democrats to keep hold of the chamber, but Republicans maintain an advantage with the map."
    },
    {
        "title": "Harris and Trump Are Neck and Neck in Michigan and Wisconsin, Polls Find",
        "date": "2024-09-28",
        "content": "The race between Kamala Harris and Donald Trump has tightened in two of the Northern battlegrounds, New York Times/Siena College polls found."
    },
    {
        "title": "Three Things to Look For in Any Election Poll",
        "date": "2024-09-28",
        "content": "A new poll comes out. How should you interpret it? Here are some rules of thumb."
    },
    {
        "title": "How to Understand Election Polls",
        "date": "2024-09-28",
        "content": "A few rules of thumb can help you decipher all that political data."
    },
    {
        "title": "Trump Gave Them a Second Chance. They Could Not Stay Out of Trouble.",
        "date": "2024-09-28",
        "content": "A California woman facing trial on fraud charges is one of six people who received clemency during the Trump administration only to be accused of another crime."
    },
    {
        "title": "The True Costs of America’s Gun Obsession",
        "date": "2024-09-28",
        "content": "It’s not just murders and mass shootings. Guns play a role in many of the country’s biggest problems."
    },
    {
        "title": "Using Dance to Provoke, Delight and Tell South Africa’s Stories",
        "date": "2024-09-28",
        "content": "Growing up in a Black township, Vusi Mdoyi found a sprinkle of joy under apartheid in a street-dancing style known as pantsula. As a choreographer, he has elevated it into high art, injected with ideas."
    },
    {
        "title": "The Surprising Place Analysts Look to for Election Forecasting",
        "date": "2024-09-28",
        "content": "Washington State’s primaries have a record of predicting the national mood, making it a bellwether of sorts."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Nebraska’s Second Congressional District",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 680 registered voters of Nebraska’s Second Congressional District conducted from Sept. 24 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Wisconsin Likely Electorate",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 680 likely voters in Wisconsin conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Likely Electorate in Nebraska’s Second Congressional District",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 680 likely voters in Nebraska’s Second Congressional District conducted from Sept. 24 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Ohio Likely Electorate",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 687 likely voters in Ohio conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Wisconsin Registered Voters",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 680 registered voters in Wisconsin conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Michigan Likely Electorate",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 688 likely voters in Michigan conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Ohio Registered Voters",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 687 registered voters in Ohio conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Polls in Michigan, Ohio and Wisconsin",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College polls of 2,055 likely voters in Michigan, Ohio and Wisconsin conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Michigan Registered Voters",
        "date": "2024-09-28",
        "content": "Results of New York Times/Siena College poll of 688 registered voters in Michigan conducted from Sept. 21 to 26, 2024."
    },
    {
        "title": "When to Vote in Your State",
        "date": "2024-09-28",
        "content": "See the important deadlines for registering to vote, mailing ballots and voting early in person."
    },
    {
        "title": "Candidate for North Carolina Governor Treated for Burns, Campaign Says",
        "date": "2024-09-28",
        "content": "Lt. Gov. Mark Robinson, the embattled Republican nominee for governor of North Carolina, was treated after attending a campaign event in Mount Airy, N.C."
    },
    {
        "title": "Trump Criticizes Harris on the Border and the Economy in Michigan",
        "date": "2024-09-28",
        "content": "Donald Trump used a pair of events to try to blame Kamala Harris for inflation and the migrant crisis, tapping into themes that helped him win Michigan in 2016."
    },
    {
        "title": "Harris, at the Border, Shows Democrats’ Hard-Line Evolution on Immigration",
        "date": "2024-09-28",
        "content": "Vowing to carry on President Biden’s crackdown on asylum and to impose order on the southern border, the vice president demonstrated how much the politics of immigration have changed."
    },
    {
        "title": "How JD Vance Turns Taking Questions Into the Show",
        "date": "2024-09-28",
        "content": "He uses showdowns with reporters to cast himself as a pugnacious, unscripted defender of Donald J. Trump."
    },
    {
        "title": "JD Vance Faces Scrutiny Over Past Criticisms of Trump and Car Seats",
        "date": "2024-09-28",
        "content": "The Republican vice-presidential nominee reportedly said that Donald J. Trump “failed to deliver” on economic populism and tied car-seat regulations to fewer births."
    },
    {
        "title": "Calling ‘Survivor’ Contestants From Tim Walz’s Motorcade",
        "date": "2024-09-27",
        "content": "Covering an election year can be stressful. But instead of binge-watching “Survivor” to decompress, two reporters wrote about the politics — or, lack thereof — on the show instead."
    },
    {
        "title": "Trump Threatens to Prosecute Google for Showing ‘Bad Stories’ About Him",
        "date": "2024-09-27",
        "content": "The former president said on social media that he would “request their prosecution, at the maximum levels” if he was elected to a second term."
    },
    {
        "title": "Trump Suggests Putin Wants to End War, as Zelensky Looks On",
        "date": "2024-09-27",
        "content": "“I’m sure President Putin wants it to stop,” Donald Trump said of the Russia-Ukraine war on Friday. President Volodymyr Zelensky of Ukraine stressed that the war shouldn’t have been started."
    },
    {
        "title": "Transcript: Ezra Klein Interviews Emily Jashinsky",
        "date": "2024-09-27",
        "content": "The Sept. 27. 2024, episode of “The Ezra Klein Show.”"
    },
    {
        "title": "Biden Officials Stave Off Sticker Shock on Medicare Drug Premiums",
        "date": "2024-09-27",
        "content": "Federal regulators spent billions of dollars to avoid a spike in costs for older Americans that could have been politically damaging to the presidential campaign of Vice President Kamala Harris."
    },
    {
        "title": "G.O.P. Candidates, Looking to Soften Their Image, Turn to Their Wives",
        "date": "2024-09-27",
        "content": "Ads featuring candidates’ families have long been a campaign staple. But they have taken on new urgency, especially for vulnerable Republicans, in a year when reproductive rights are a pivotal issue."
    },
    {
        "title": "Robert F. Kennedy Jr. Won’t Be on New York Ballot, Supreme Court Rules",
        "date": "2024-09-27",
        "content": "The candidate had asked the justices to intervene after a state judge found that he had used an improper home address in election paperwork."
    },
    {
        "title": "Special Counsel Proposes Making Public More Evidence From Trump Election Case",
        "date": "2024-09-27",
        "content": "Jack Smith is seeking to disclose quotations from secret grand jury testimony and interviews, but is proposing to shield witness identities."
    },
    {
        "title": "Democrats See a Chance to Beat Trump on Judicial Confirmations",
        "date": "2024-09-27",
        "content": "They hope to use the time after the election to approve judges, but Senator Durbin says their aggressive efforts have already produced a remarkable demographic shift on the federal courts."
    },
    {
        "title": "As Mark Robinson’s Campaign Crumbles, North Carolina Republicans Seethe",
        "date": "2024-09-27",
        "content": "The scandal surrounding Mr. Robinson has incensed party officials and donors, some of whom described longstanding concerns about his campaign."
    },
    {
        "title": "‘Quiet Place’ in Pennsylvania Is Thrust Into Loud Immigration Debate",
        "date": "2024-09-27",
        "content": "Former President Donald J. Trump turned his sights on Charleroi, Pa., where many Haitians have settled in recent years, and he fueled a fire that was already smoldering."
    },
    {
        "title": "The Indictment of Mayor Eric Adams",
        "date": "2024-09-27",
        "content": "Readers react to the corruption charges against New York’s mayor. Also: A path for Iran; the state of speech on campus; a tally of Trump insults."
    },
    {
        "title": "An Indicted Mayor and an Indicted Former President, and the Parallels Between",
        "date": "2024-09-27",
        "content": "Eric Adams and Donald Trump, two political shape-shifters, have both insisted they’re victims of partisan prosecutions."
    },
    {
        "title": "On Trip to U.S., Zelensky Finds Ukraine’s Fortunes Tied to the Election",
        "date": "2024-09-27",
        "content": "A whirlwind week of top-level meetings failed to alleviate concerns in Kyiv that a Trump presidency could lead to a dramatic shift in American policy."
    },
    {
        "title": "U.S. Charges Iranians With Hacking Trump Campaign",
        "date": "2024-09-27",
        "content": "The indictment highlighted the heightened threat posed by hostile international actors — Iran, Russia and China chief among them — who hope to disrupt the U.S. election."
    },
    {
        "title": "Trump and Harris Step Up Efforts to Woo Mormon Voters",
        "date": "2024-09-27",
        "content": "The recent moves reflect how members of the Church of Jesus Christ of Latter-day Saints are no longer locked in for Republicans. Their votes could matter in key battlegrounds."
    },
    {
        "title": "Divisions Emerge Over Whether Adams Should Resign",
        "date": "2024-09-27",
        "content": "Amid the growing calls for Mayor Eric Adams’s resignation, some have taken the opposite tack."
    },
    {
        "title": "‘Titaníque’ Was Her Big Hit. Is ‘Big Gay Jamboree’ Really Her Swan Song?",
        "date": "2024-09-27",
        "content": "Two years after debuting the “Titanic” parody, Marla Mindelle says her new show, with Margot Robbie as a producer, may be her last as an actor."
    },
    {
        "title": "How to Win the Electoral College",
        "date": "2024-09-27",
        "content": "Explore possible outcomes in the battleground states to see how Harris or Trump could reach 270 electoral votes and the White House."
    },
    {
        "title": "The Most Galling Part of the Whole Eric Adams Affair",
        "date": "2024-09-27",
        "content": "With all its talent, how did the city end up with a mayor accused of being an incessant petty grifter?"
    },
    {
        "title": "Inside a Josh Stein Ad Blasting Mark Robinson as ‘Unfit’ for North Carolina Governor",
        "date": "2024-09-27",
        "content": "No “Black Nazi” quotations or porn-site references here. Just Robinson’s own bloodthirsty words."
    },
    {
        "title": "The Fed’s Preferred Inflation Gauge Cooled in August",
        "date": "2024-09-27",
        "content": "Inflation is slowing so much that some economists said it could pave the way for another big Fed rate cut, if other data suggest one is warranted."
    },
    {
        "title": "The Big Apple Business View on Eric Adams",
        "date": "2024-09-27",
        "content": "The criminal charges against the embattled mayor of New York have given corporate leaders pause about the city’s political future."
    },
    {
        "title": "Zelensky Meets Trump Amid Fears for Continued U.S. Support for Ukraine",
        "date": "2024-09-27",
        "content": "The session in New York was part of a nearly weeklong U.S. visit by the Ukrainian president in which he has made appeals to both Democrats and Republicans."
    },
    {
        "title": "The Problem With a Crowd of New Online Polls",
        "date": "2024-09-27",
        "content": "They’ve become cheap to produce but they underperform the competition, falling short of their original promise."
    },
    {
        "title": "The Best Way to Keep Congress From Getting Things Done",
        "date": "2024-09-27",
        "content": "Supporters of the filibuster argue that without unlimited debate, democracy succumbs to silence. Or something."
    },
    {
        "title": "Harris Heads to the Border, Trying to Project Toughness Against Trump",
        "date": "2024-09-27",
        "content": "Visiting the border on Friday in Arizona, the vice president will try to neutralize a key vulnerability, and will demonstrate her party’s harder line on immigration."
    },
    {
        "title": "What Threats Mean for Trump’s Campaign",
        "date": "2024-09-27",
        "content": "Former President Donald J. Trump’s advisers are considering whether to modify his travel after threats to his life from Iran and two assassination attempts, according to several people briefed on the matter. Maggie Haberman, a senior political cor..."
    },
    {
        "title": "MAGA Is Not as United as You Think",
        "date": "2024-09-27",
        "content": "The journalist Emily Jashinsky discusses the “huge gulf” between various factions of the New Right."
    },
    {
        "title": "Which Battleground State Voters Could Sway the Election?",
        "date": "2024-09-27",
        "content": "An analysis of voter data reveals the demographic trends at play in this year’s presidential race."
    },
    {
        "title": "Diddy and Our Culture’s ‘Himpathy’ for Powerful Men",
        "date": "2024-09-27",
        "content": "How the allegations against Sean Combs change the way we talk about #MeToo, rumors and powerful men."
    },
    {
        "title": "They Call Themselves the ‘Strange Sorority.’ Trump Was Their Initiation.",
        "date": "2024-09-27",
        "content": "The world has moved on. They haven’t."
    },
    {
        "title": "The Wily Spy Who Risked His Life to Meet North Korea’s Secretive Leader",
        "date": "2024-09-27",
        "content": "Park Chae-so was so successful in infiltrating the North that Kim Jong-il, the enigmatic ruler, once gifted him blueberry wine. So why was the celebrated undercover agent later jailed by South Korea?"
    },
    {
        "title": "A ‘Super Bowl’ Holiday",
        "date": "2024-09-27",
        "content": "In the state of Victoria, you need more than one day to take in all that the A.F.L. Grand Final has to offer."
    },
    {
        "title": "Myanmar’s Military Asks Rebels to Stop Fighting and Join in Elections",
        "date": "2024-09-27",
        "content": "Though the offer was quickly rejected by several commanders of the opposition forces, it was still seen as a significant development in the three-year civil war."
    },
    {
        "title": "Friday Briefing: Mayor’s Adams’s Arraignment",
        "date": "2024-09-27",
        "content": "Plus, control behind K-pop goes public."
    },
    {
        "title": "Biden, Eyeing His Legacy, Signs Executive Orders on Gun Safety",
        "date": "2024-09-27",
        "content": "The president used a poignant White House ceremony to pass the baton to Vice President Kamala Harris, who has made gun safety an issue in her campaign."
    },
    {
        "title": "McDonald’s, Pelosi, Debate Moderators: Trump Speech on Border Veers Off Course",
        "date": "2024-09-27",
        "content": "After reading from prepared remarks on immigration for 10 minutes, Donald J. Trump used the rest of a news conference to talk about everything else on his mind."
    },
    {
        "title": "Democrats Need Jon Tester to Defy the Odds Again",
        "date": "2024-09-26",
        "content": "Control of the Senate could turn on Montana."
    },
    {
        "title": "The Tech Bro Style in American Politics",
        "date": "2024-09-26",
        "content": "Why some billionaires are helping to promote political extremism."
    },
    {
        "title": "Mayor’s Public Defense Leans on Conspiracy Theories and Race",
        "date": "2024-09-26",
        "content": "Mayor Eric Adams has said he is being targeted by the federal government for being critical of the Biden administration during the city’s migrant crisis, although he offers no evidence."
    },
    {
        "title": "JD Vance to Address Major Republican Donors Just Before Debate",
        "date": "2024-09-26",
        "content": "As part of his trip to New York City for the vice-presidential debate next week, Mr. Vance will speak to the American Opportunity Alliance, a network of major G.O.P. contributors."
    },
    {
        "title": "Biden Signs Stopgap Spending Measure to Keep Government Open",
        "date": "2024-09-26",
        "content": "The bill averts a campaign-season shutdown but ensures another spending fight in Congress during its lame-duck session in December."
    },
    {
        "title": "Trump Campaign Is Said to Have Changed Rally After Secret Service Concerns",
        "date": "2024-09-26",
        "content": "Former President Donald J. Trump will hold an indoor rally in Wisconsin on Saturday. The Secret Service had raised concerns about securing the outdoor rally initially planned, according to a senior official with the agency."
    },
    {
        "title": "Eric Adams Charged With Bribery and Fraud",
        "date": "2024-09-26",
        "content": "Also, Hurricane Helene heads toward Florida. Here’s the latest at the end of Thursday."
    },
    {
        "title": "Friday Briefing: New York City’s Mayor is Indicted",
        "date": "2024-09-26",
        "content": "Plus, the control behind K-pop goes public."
    },
    {
        "title": "Harris Has a Lot of Strengths. Giving Interviews Isn’t One of Them.",
        "date": "2024-09-26",
        "content": "Vice President Kamala Harris is a sharp debater and a tireless campaigner, but televised interviews are a weakness. Her professional experience may explain why."
    },
    {
        "title": "Kamala Harris’s Campaign Thinks She Can Win on the Economy. Here’s How.",
        "date": "2024-09-26",
        "content": "Harris advisers point to a number of brightening public polls showing that Donald Trump’s lead is eroding on the critical question of whom voters trust most on the economy."
    },
    {
        "title": "Zelensky’s Star Power Fades on Capitol Hill",
        "date": "2024-09-26",
        "content": "As the war drags on, Ukraine’s president receives a quieter welcome in Washington and faces angry questions from some Republicans."
    },
    {
        "title": "Giuliani Disbarred in D.C. Over Efforts to Overturn 2020 Election",
        "date": "2024-09-26",
        "content": "Appellate judges based their decision on New York’s ruling earlier this year to bar him from practicing law in the state."
    },
    {
        "title": "Harris Meets With Zelensky, Anticipating a Handover of Global Crises",
        "date": "2024-09-26",
        "content": "The meeting signaled that the White House was preparing her to take over a thorny diplomatic relationship should she win the election in November."
    },
    {
        "title": "Democrats Seek Another Opening in a Challenging Senate Map",
        "date": "2024-09-26",
        "content": "New investments in Texas and Florida show how the party is reaching to keep its majority alive."
    },
    {
        "title": "Newsmax and Smartmatic Settle Defamation Case Over 2020 Election",
        "date": "2024-09-26",
        "content": "Jury selection in the case began on Thursday morning, and the trial had been expected to take up to four weeks."
    },
    {
        "title": "What Students Are Saying About Celebrity Endorsements, Trendy Water Bottles and Their Sleep Routines",
        "date": "2024-09-26",
        "content": "This week, teenage responses to three recent Picture Prompts."
    },
    {
        "title": "Crunchtime for Election Interference: October Is the Month of Mischief",
        "date": "2024-09-26",
        "content": "U.S. officials are stepping up their warnings about foreign interference in the election, focused on three main adversaries: Russia, China and Iran."
    },
    {
        "title": "The R.N.C. Asked a Conspiracy Theorist to Train Poll Watchers. Here’s What He Told Them.",
        "date": "2024-09-26",
        "content": "Jack Posobiec of “Pizzagate” notoriety recently spoke to a group of G.O.P. volunteers. “It doesn’t matter who votes,” he told them. “It matters who counts the votes.”"
    },
    {
        "title": "A Brief History of Ethical Concerns Involving Eric Adams",
        "date": "2024-09-26",
        "content": "The mayor has been investigated repeatedly during his two decades in politics."
    },
    {
        "title": "Pro-Trump Group Expands Ad Buy by $70 Million in the Race’s Final Weeks",
        "date": "2024-09-26",
        "content": "The MAGA Inc. super PAC plans to run ads to make the case that Kamala Harris is soft on crime and to tie her to the Biden administration’s record."
    },
    {
        "title": "The Two Ways Eric Adams Could Be Forced From Office",
        "date": "2024-09-26",
        "content": "The New York City Charter includes provisions that could be used to remove the mayor against his will if he chooses not to step down."
    },
    {
        "title": "Trump’s Plans Could Spur Inflation While Slowing Growth, Study Finds",
        "date": "2024-09-26",
        "content": "A nonpartisan economic analysis warned that deporting migrants and increasing tariffs would damage the U.S. economy."
    },
    {
        "title": "Harris Now Has an Economic Plan. Can It Best Trump’s Promises?",
        "date": "2024-09-26",
        "content": "A central question in the final stretch of the election is if Vice President Kamala Harris’s proposals will cohere into an economic argument that can top former President Donald J. Trump’s."
    },
    {
        "title": "The Crucial Context for Kamala Harris’s ‘Context’",
        "date": "2024-09-26",
        "content": "Her opponent’s malice and incoherence trump all else."
    },
    {
        "title": "Melania Trump Gives a Rare Interview: 3 Takeaways",
        "date": "2024-09-26",
        "content": "While promoting a memoir, the former first lady told Fox News that she blamed Democrats and members of the news media for the assassination attempts against her husband."
    },
    {
        "title": "Inside a Pro-Harris Ad Portraying Trump as Fighting for Billionaires Like Him",
        "date": "2024-09-26",
        "content": "A key super PAC backing Kamala Harris makes use of a teacher’s narration and of video of Donald Trump promising to cut the taxes of people he calls “rich as hell.”"
    },
    {
        "title": "Major Decision for Judge in Trump’s Election Case: How Much Evidence to Reveal",
        "date": "2024-09-26",
        "content": "Prosecutors filed a sealed brief showing what they learned in the investigation. The former president’s lawyers say it amounts to a premature special counsel report that could hurt him before Election Day."
    },
    {
        "title": "Here Are the Charges Eric Adams Faces, Annotated",
        "date": "2024-09-26",
        "content": "The Times annotated the indictment."
    },
    {
        "title": "These Are the Charges Against Eric Adams",
        "date": "2024-09-26",
        "content": "A federal indictment accuses Mr. Adams of crimes dating back a decade, including bribery conspiracy, fraud and soliciting illegal foreign campaign donations."
    },
    {
        "title": "Inside the Minds of Swing Voters",
        "date": "2024-09-26",
        "content": "We explain the results of a poll of undecided voters."
    },
    {
        "title": "Zelensky Pleads for More U.S. Weapons in Meetings With Biden and Harris",
        "date": "2024-09-26",
        "content": "The stakes are high for the Ukrainian leader, who is trying to fend off Russia’s invasion while also navigating tricky U.S. politics that could determine future of American aid."
    },
    {
        "title": "Republican Candidates Keep Straying Into Dangerous Territory: Abortion",
        "date": "2024-09-26",
        "content": "In a campaign they would like to center on the economy and the border, Republican candidates keep drifting back to abortion rights, an issue that favors Democrats."
    },
    {
        "title": "Sick of the Electoral College? Stop Whining.",
        "date": "2024-09-26",
        "content": "Blame the Committee of Unfinished Parts."
    },
    {
        "title": "An ‘Utterly Bonkers’ Miscarriage of Justice in Texas",
        "date": "2024-09-26",
        "content": "Are we ever going to take civil rights laws at face value?"
    },
    {
        "title": "Presidential Elections Aren’t Really That Close",
        "date": "2024-09-26",
        "content": "The folly of the Electoral College creates too many points where history could turn on narrow outcomes."
    },
    {
        "title": "Stanley McChrystal: Why Kamala Harris Has Won Me Over",
        "date": "2024-09-26",
        "content": "Some deeply consequential decisions are starkly simple."
    },
    {
        "title": "A Fix for Trump’s Stop the Steal Strategy",
        "date": "2024-09-26",
        "content": "The Electoral College is distorting our democracy."
    },
    {
        "title": "With Few Wins to Highlight, House Republicans Head Home to Chase Votes",
        "date": "2024-09-26",
        "content": "The G.O.P. has plenty of dysfunction to point to after nearly two years of controlling the chamber, but not many successes to show voters ahead of the Nov. 5 election."
    },
    {
        "title": "Mayor Eric Adams Is Indicted",
        "date": "2024-09-26",
        "content": "The mayor, who ran for office on a promise to rein in crime, has been federally charged after a corruption investigation."
    },
    {
        "title": "The Dangers of Donald Trump, From Those Who Know Him",
        "date": "2024-09-26",
        "content": "What 91 people who know the former president say about his character."
    },
    {
        "title": "Vance’s Mother Deals With Her Past and His Future",
        "date": "2024-09-26",
        "content": "In his 2016 memoir, Senator JD Vance of Ohio described a rough childhood owing to his mother’s devastating drug addiction. Today, he and his mother, Beverly Aikins, are a remarkable team."
    },
    {
        "title": "U.S. House Speaker Demands That Ukraine Fire Ambassador",
        "date": "2024-09-26",
        "content": "The public call from Speaker Mike Johnson deals a blow to Kyiv’s efforts to avoid the partisan acrimony of the U.S. presidential campaign."
    },
    {
        "title": "Conservatives Have Lost Their Grip on the World — and Themselves",
        "date": "2024-09-26",
        "content": "Conservatism, the force that has dominated Western politics since World War II, is in danger of being swallowed by the far right."
    },
    {
        "title": "‘Deepfake’ Caller Poses as Ukrainian Official in Exchange With Key Senator",
        "date": "2024-09-26",
        "content": "A figure impersonating Dmytro Kuleba, the former foreign minister of Ukraine, targeted Senator Benjamin L. Cardin, the chairman of the Foreign Relations Committee, over a Zoom call."
    },
    {
        "title": "With Eric Adams Indicted, What Happens Next?",
        "date": "2024-09-26",
        "content": "New York voters cannot recall the mayor and he is not required to resign, but Gov. Kathy Hochul has the power to remove him. She would be in uncharted territory."
    },
    {
        "title": "These Are Some of the Lawmakers Who Have Called for Adams to Resign",
        "date": "2024-09-26",
        "content": "The indictment of Mayor Eric Adams has led to a wave of fresh calls for him to step down."
    },
    {
        "title": "House Condemns Biden and Harris Over Afghanistan Withdrawal",
        "date": "2024-09-26",
        "content": "Ten Democrats joined the G.O.P.-led effort to rebuke 15 senior members of the Biden administration for the failures of the Afghanistan withdrawal in a symbolic vote."
    },
    {
        "title": "3 Takeaways From Kamala Harris’s Interview on MSNBC",
        "date": "2024-09-26",
        "content": "In her first one-on-one cable TV interview since becoming the nominee, the vice president repeatedly dodged direct questions and stuck firmly on message."
    },
    {
        "title": "Rep. Clay Higgins Posts, Then Deletes, Racist Comments About Haitians",
        "date": "2024-09-26",
        "content": "False claims about migrants in Springfield, Ohio, who are legal residents, became a campaign issue after Donald J. Trump brought them up at the presidential debate this month."
    },
    {
        "title": "The Four Swing States That Could Matter Most",
        "date": "2024-09-25",
        "content": "In a tight election, every battleground matters. But here are four states to watch extra closely."
    },
    {
        "title": "Trump to Rally Again at the Site of the First Assassination Attempt Against Him",
        "date": "2024-09-25",
        "content": "Donald J. Trump will return to Butler, Pa., on Oct. 5 — one month from Election Day."
    },
    {
        "title": "Trump Hints at Iran Link to His 2 Assassination Attempts, Despite the Available Evidence",
        "date": "2024-09-25",
        "content": "Officials have disclosed no ties to Iran in the cases in Pennsylvania and Florida, as Donald Trump questioned the F.B.I.’s investigations and mused about military action."
    },
    {
        "title": "Tell Us: How Is Political Advertising Affecting You?",
        "date": "2024-09-25",
        "content": "Share your thoughts with the On Politics newsletter."
    },
    {
        "title": "Harris’s Economic Pitch: Capitalism for the Middle Class",
        "date": "2024-09-25",
        "content": "In a major address in Pittsburgh, the vice president praised business and used technical language to court economy-minded voters skeptical of big government."
    },
    {
        "title": "Democrats and Republicans Press China on Abuse of Muslim Minority",
        "date": "2024-09-25",
        "content": "Both parties are focused on oppression of China’s Uyghur minority but use different tactics in pushing the Biden administration to do more."
    },
    {
        "title": "Threats to Trump May Prompt Changes in Travel Plans and Event Types",
        "date": "2024-09-25",
        "content": "Secret Service officials have advised altering routines and rethinking rally locations, after threats from Iran and two assassination attempts."
    },
    {
        "title": "Harris Cast Herself as a Pro-Business Pragmatist",
        "date": "2024-09-25",
        "content": "Also, the U.S. is trying to broker an Israel-Hezbollah cease-fire. Here’s the latest at the end of Wednesday."
    },
    {
        "title": "Harris Casts Herself as a Pro-Business Pragmatist in a Broad Economic Pitch",
        "date": "2024-09-25",
        "content": "Declaring “I am a capitalist” in a speech in Pittsburgh, Kamala Harris promised not to be “constrained by ideology” even as she said she would fiercely defend unions and the middle class."
    },
    {
        "title": "Thursday Briefing: The U.S. Pushes for a Cease-Fire in Lebanon",
        "date": "2024-09-25",
        "content": "Plus, 3,600-year-old cheese."
    },
    {
        "title": "Mark Robinson’s Top Staff in the Lieutenant Governor’s Office Plan to Resign",
        "date": "2024-09-25",
        "content": "North Carolina’s Republican nominee for governor has already lost most of his campaign staff after a news report linked him to disturbing comments on a porn site."
    },
    {
        "title": "A Wisconsin Mayor Took Issue With a Ballot Drop Box Decision, So He Took the Drop Box",
        "date": "2024-09-25",
        "content": "Mayor Doug Diny of Wausau, Wis., said the City Council should have been consulted before the installation. The Wisconsin Supreme Court had said authority rested with the city clerk."
    },
    {
        "title": "The Nation’s Politics Are Dramatic. Now Its Dramas Are Political.",
        "date": "2024-09-25",
        "content": "For the second year in a row, a play about the Constitution is the most-staged in America. And a farce about a terrible president is also pretty popular."
    },
    {
        "title": "Report Links Mark Robinson to Comment That Cops Should Have ‘Shot Al Sharpton’",
        "date": "2024-09-25",
        "content": "The newly unearthed remarks were made in the comments of a news article under a username that previous reporting has linked to Mr. Robinson, the Republican running for governor in North Carolina."
    },
    {
        "title": "Biden, on ‘The View,’ Calls Trump a ‘Loser’ Who Lacks ‘Redeeming Value’",
        "date": "2024-09-25",
        "content": "President Biden became the first sitting president to appear live on “The View.” He said he was “at peace” with his decision not to run again."
    },
    {
        "title": "Meet the G.O.P. Personal Injury Lawyer Buying His Own Trump Ads",
        "date": "2024-09-25",
        "content": "Dan Newlin has spent millions on billboards and TV spots promoting Donald J. Trump (and himself)."
    },
    {
        "title": "Kentucky Sheriff Accused of Fatally Shooting Judge Pleads Not Guilty",
        "date": "2024-09-25",
        "content": "Sheriff Shawn Stines made his first appearance in court as a defendant in the case that has shaken the small rural community of Letcher County, Ky."
    },
    {
        "title": "Donald Trump Cut Ties to Some Online Fund-Raisers",
        "date": "2024-09-25",
        "content": "The campaign also reduced the commission retained by the remaining vendors, as the former president falls behind Vice President Kamala Harris in the cash race."
    },
    {
        "title": "As School Threats Proliferate, More Than 700 Students Are Arrested",
        "date": "2024-09-25",
        "content": "The number of threats after a Georgia school shooting this month is much higher than usual, many officials said. In response, some have cracked down with arrests and detention for children as young as 10."
    },
    {
        "title": "Kamala Harris Is a Woman of Faith. She Shouldn’t Be Afraid to Show It.",
        "date": "2024-09-25",
        "content": "Democrats should fight for religious voters."
    },
    {
        "title": "Donald Trump Embraces ‘Love’",
        "date": "2024-09-25",
        "content": "Politicians often lean toward hyperbole, but the frequent use of the word “love” in the former president’s fund-raising notes is an increasingly common tactic for him."
    },
    {
        "title": "When Computers Go Dark",
        "date": "2024-09-25",
        "content": "A routine software update by a security company crashed millions of computers around the world. The chaos was telling."
    },
    {
        "title": "Read the Senate committee report",
        "date": "2024-09-25",
        "content": "A Senate committee report on the Secret Service’s inability to protect the former president at a July event"
    },
    {
        "title": "Trump’s Low-Tax, High-Tariff Strategy Could Clash With Economic Realities",
        "date": "2024-09-25",
        "content": "The former president’s efforts to compel companies to remain in the United States had limited success while he was in the White House."
    },
    {
        "title": "Congress Passes Short-Term Spending Bill to Avert a Shutdown",
        "date": "2024-09-25",
        "content": "In a pair of votes in quick succession, the House and Senate moved to keep federal funding flowing through Dec. 20. But they punted a bigger spending fight to the end of the year."
    },
    {
        "title": "Iran’s Dilemma: How to Preserve Its Proxies and Avoid Full-Scale War",
        "date": "2024-09-25",
        "content": "Iran says Israel wants to trap it into a direct conflict by bombing Hezbollah, even as a new Iranian president tries outreach to the West."
    },
    {
        "title": "Leadership, but No Clear Leader, Failed at Tragic Trump Rally",
        "date": "2024-09-25",
        "content": "A Senate committee report on the Secret Service’s inability to protect the former president at a July event depicts a lack of individual responsibility among those charged with planning."
    },
    {
        "title": "The Real Trump Mystery",
        "date": "2024-09-25",
        "content": "How is it possible that the former president has a reasonable chance of winning the election despite all that voters now know about him?"
    },
    {
        "title": "Where Trump and Harris Stand on Democracy",
        "date": "2024-09-25",
        "content": "Kamala Harris’s campaign has framed the election in part as a fight to preserve American democracy. Donald Trump is the only U.S. president who has refused to accept his loss, in the 2020 election. Maggie Astor, a politics reporter at The New York..."
    },
    {
        "title": "Why Do People Like Elon Musk Love Donald Trump? It’s Not Just About Money.",
        "date": "2024-09-25",
        "content": "Trump’s backers in tech see him as a fellow victim of the state and a shield they need to escape accountability."
    },
    {
        "title": "Kushner’s Fund Has Reaped Millions in Fees, but So Far Returned No Profits",
        "date": "2024-09-25",
        "content": "The son-in-law of former President Donald J. Trump has said he has intentionally moved slowly to invest investors’ money, which came primarily from foreign entities."
    },
    {
        "title": "To Win in North Carolina, Democrats Need to Get Out of Town",
        "date": "2024-09-25",
        "content": "Harris has a chance in the state, but only if she hits the ground hard in rural areas, as Obama did in 2008."
    },
    {
        "title": "Republicans’ Electoral College Edge, Once Seen as Ironclad, Looks to Be Fading",
        "date": "2024-09-25",
        "content": "A review of the evidence that Donald Trump’s advantage relative to the national popular vote has declined significantly."
    },
    {
        "title": "How Canadians Fell Out of Love With Justin Trudeau",
        "date": "2024-09-25",
        "content": "Canada’s Liberals are reeling from a string of setbacks, even as the party survived a no-confidence vote in Parliament on Wednesday."
    },
    {
        "title": "News Outlets Brace for Chaos on Election Night (and Perhaps Beyond)",
        "date": "2024-09-25",
        "content": "Here’s how they’re preparing to make calls in a very tight race — and ensure that viewers and readers believe them."
    },
    {
        "title": "Republicans Pick Up Unlikely Allies in Key House Races: Unions",
        "date": "2024-09-25",
        "content": "Democrats still dominate with organized labor. But in must-win swing races, Republicans are peeling off some union support, and feeling the benefits."
    },
    {
        "title": "Confronting Our New Reality",
        "date": "2024-09-25",
        "content": "Solutions to the problem of climate change have never been more clear. But the scale of the problem keeps getting bigger."
    },
    {
        "title": "Wednesday Briefing: The U.N. General Assembly Convenes",
        "date": "2024-09-25",
        "content": "Plus, news outlets experiment with WhatsApp."
    },
    {
        "title": "Trump Is Briefed on Iranian Assassination Threats",
        "date": "2024-09-25",
        "content": "U.S. intelligence agencies had previously tracked a potential Iranian assassination plot. The Trump campaign said in a statement that the threat is now heightened."
    },
    {
        "title": "Bernie Moreno Under Fire Over Comments About Suburban Women",
        "date": "2024-09-25",
        "content": "Mr. Moreno, a Republican running for Senate in Ohio, suggested that older women shouldn’t care about abortion because they were too old to have children, comments Nikki Haley pointedly criticized."
    },
    {
        "title": "Missouri Man Executed After Long Fight for Exoneration",
        "date": "2024-09-24",
        "content": "Marcellus Williams, who was convicted of a 1998 murder in suburban St. Louis, maintained he was innocent. But the courts and the governor were not persuaded."
    },
    {
        "title": "Why Debunked Falsehoods About Haitian Migrants Gained Traction",
        "date": "2024-09-24",
        "content": "The racist and inflammatory narrative spread on the backs of memes, greed, biases and news deserts."
    },
    {
        "title": "Read the document",
        "date": "2024-09-24",
        "content": "A new memo from two of the leading Democratic groups working in battleground states."
    },
    {
        "title": "Biden Warned the World Is at an ‘Inflection Point’",
        "date": "2024-09-24",
        "content": "Also, thousands are fleeing southern Lebanon. Here’s the latest at the end of Tuesday."
    },
    {
        "title": "Judge Rejects Trump’s Last-Minute Bid to Delay Assessment of Jan. 6 Case",
        "date": "2024-09-24",
        "content": "Federal prosecutors can come ahead with a lengthy filing containing evidence backing their argument that the indictment of the former president can survive the Supreme Court’s immunity ruling."
    },
    {
        "title": "Vance and Walz Will Debate Standing Up, in a Rarity for V.P. Clashes",
        "date": "2024-09-24",
        "content": "The vice-presidential debate will be the first without chairs since Joe Biden’s face-off against Sarah Palin in 2008. Both candidates are preparing this week, with Tim Walz heading to Northern Michigan."
    },
    {
        "title": "House Panel Recommends Holding Blinken in Contempt",
        "date": "2024-09-24",
        "content": "Democrats accused Republicans of trying to damage the Biden administration at the height of a campaign season."
    },
    {
        "title": "Wednesday Briefing: The U.N. General Assembly Convenes",
        "date": "2024-09-24",
        "content": "Plus, news outlets experiment with WhatsApp."
    },
    {
        "title": "How to Watch the Vance-Walz Vice-Presidential Debate",
        "date": "2024-09-24",
        "content": "CBS News will broadcast the 90-minute debate, starting at 9 p.m. Eastern on Tuesday. The Times will stream it alongside real-time commentary and analysis from reporters."
    },
    {
        "title": "Behind Kamala Harris’s Rise: Silicon Valley’s Wealthiest Woman",
        "date": "2024-09-24",
        "content": "The alliance between Kamala Harris and Laurene Powell Jobs is a genuine friendship that has thrust the press-shy billionaire philanthropist into the political spotlight."
    },
    {
        "title": "More Money Urgently Needed to Reach Younger and Minority Voters, Organizers Warn Harris Donors",
        "date": "2024-09-24",
        "content": "A new memo, released by two of the leading Democratic groups working in battleground states, lays out worrying signs for Vice President Kamala Harris among younger voters and voters of color."
    },
    {
        "title": "Hemmed In by the Hard Right, Johnson Again Turns to Democrats for Votes",
        "date": "2024-09-24",
        "content": "The House speaker is trying to get a short-term spending agreement passed despite opposition from some conservative members of his own party."
    },
    {
        "title": "Harris to More Fully Detail Economic Plans",
        "date": "2024-09-24",
        "content": "With a speech on Wednesday and a lengthy policy document, Vice President Kamala Harris’s campaign is set to lay out her economic vision as voters say they want to know more about her approach."
    },
    {
        "title": "Manchin Won’t Endorse Harris After Her Call to End Filibuster Over Abortion Rights",
        "date": "2024-09-24",
        "content": "“Shame on her,” Joe Manchin, the independent senator from West Virginia, said after Kamala Harris reiterated her support for ending the Senate practice. “She knows the filibuster is the Holy Grail of democracy.”"
    },
    {
        "title": "Ted Cruz Is Again Fighting for Political Survival in Texas",
        "date": "2024-09-24",
        "content": "The fiery senator, who was nearly unseated in 2018, has been trying to rebrand himself in a close race against a Democratic congressman and former N.F.L. player, Colin Allred."
    },
    {
        "title": "Baldwin, With Shapiro in Tow, Looks For ‘Trump-Tammy Voters’ in Wisconsin",
        "date": "2024-09-24",
        "content": "The Democratic senator, who is seeking a third term in a politically competitive state, rallied with the Pennsylvania governor, who has a track record of appealing to voters in rural, conservative-leaning areas."
    },
    {
        "title": "Election 2024 Polls: New Mexico",
        "date": "2024-09-24",
        "content": "See the latest election polls and polling averages for New Mexico."
    },
    {
        "title": "Election 2024 Polls: Ohio",
        "date": "2024-09-24",
        "content": "See the latest election polls and polling averages for Ohio."
    },
    {
        "title": "Election 2024 Polls: Texas",
        "date": "2024-09-24",
        "content": "See the latest election polls and polling averages for Texas."
    },
    {
        "title": "Election 2024 Polls: California",
        "date": "2024-09-24",
        "content": "See the latest election polls and polling averages for California."
    },
    {
        "title": "Election 2024 Polls: Maryland",
        "date": "2024-09-24",
        "content": "See the latest election polls and polling averages for Maryland."
    },
    {
        "title": "Trump Pitches ‘New American Industrialism’ and Luring Foreign Manufacturing",
        "date": "2024-09-24",
        "content": "The former president highlighted his plans to increase tariffs and reduce corporate taxes for businesses that make products in the United States."
    },
    {
        "title": "These Voters Are Anti-Trump, but Will They Be Pro-Harris?",
        "date": "2024-09-24",
        "content": "Democrats see an opportunity to win over right-leaning Americans who have recoiled from Donald Trump. The challenge is coaxing them off the sidelines."
    },
    {
        "title": "Is Paying Kids to Read a Wise Strategy?",
        "date": "2024-09-24",
        "content": "Readers discuss an essay by a parent who gave her daughter a $100 reward. Also: Donald Trump and the psychiatrists; a second debate; heartland immigrants."
    },
    {
        "title": "Mark Zuckerberg Is Done With Politics",
        "date": "2024-09-24",
        "content": "He was once a backer of liberal causes. Then everyone seemed to turn on him. Now he wants to stay away from politics — if that’s possible."
    },
    {
        "title": "How Meta Distanced Itself From Politics",
        "date": "2024-09-24",
        "content": "Ahead of November’s election, Meta has de-emphasized political content on Facebook, Instagram and Threads and doesn’t want to talk about candidates or campaigns."
    },
    {
        "title": "Sheriff Who Suggested Tracking Harris Supporters Is Stripped of Election Role",
        "date": "2024-09-24",
        "content": "The Ohio sheriff who urged his followers to record the addresses of people with yard signs supporting Vice President Kamala Harris will no longer head security at the county’s early voting location."
    },
    {
        "title": "Inside a Kamala Harris Ad Promoting Her Economic Plans",
        "date": "2024-09-24",
        "content": "Polls show voters want to know more about what she would do. This ad, running across the battlegrounds, gives answers."
    },
    {
        "title": "Is Visa a Monopoly?",
        "date": "2024-09-24",
        "content": "The Justice Department is expected to sue the global payments giant as soon as Tuesday, accusing the company of stifling competition."
    },
    {
        "title": "Forum 5 | What Gives You Hope for the Future?",
        "date": "2024-09-24",
        "content": "What do you think your generation might do better than those who came before it did?"
    },
    {
        "title": "The Senate May Come Down to a Blue State Surprise",
        "date": "2024-09-24",
        "content": "How party control of the Senate may come down to Maryland Democrats taking a big gamble."
    },
    {
        "title": "Kamala Harris Talks About ‘Joy.’ But Are Undecided Voters Feeling It?",
        "date": "2024-09-24",
        "content": "Approximately three million undecided voters in seven battleground states will most likely decide the outcome of the 2024 presidential election, and surveys show that these voters are pessimistic about the country’s future. Jonathan Swan, a report..."
    },
    {
        "title": "Kamala Harris’s Ideas About Patriotism",
        "date": "2024-09-24",
        "content": "Patriotic Americana has been the vice president’s theme since she became the  Democrats’ presidential candidate."
    },
    {
        "title": "The Black Box of the Undecided Voter Won’t Yield Its Secrets",
        "date": "2024-09-24",
        "content": "Undecided voters have tuned out the noise of American politics."
    },
    {
        "title": "Why the Election Is Coming Down to Defining Kamala Harris",
        "date": "2024-09-24",
        "content": "The vice president is leading in national polls, but that isn’t the whole story."
    },
    {
        "title": "Nicholas Kristof: Readers Respond to My Column on Trump Voters",
        "date": "2024-09-24",
        "content": "The best way to persuade people is to engage with them."
    },
    {
        "title": "What Pete Buttigieg Learned Playing JD Vance",
        "date": "2024-09-24",
        "content": "The politician discusses how Democrats can rebuild trust."
    },
    {
        "title": "Biden Warns the World Is at an ‘Inflection Point’ Amid Global Crises",
        "date": "2024-09-24",
        "content": "In his final U.N. speech, President Biden framed his decision to drop his bid for re-election as a lesson that “some things are more important than staying in power.”"
    },
    {
        "title": "‘Chaotic,’ ‘Misleading,’ ‘Informative’: What Teens Said About 2024 Election Coverage",
        "date": "2024-09-24",
        "content": "More than 400 teenagers have participated in the Headway Election Challenge."
    },
    {
        "title": "Teens, What Moments in the 2024 Election Do You Want to Remember?",
        "date": "2024-09-24",
        "content": "It’s Week 3 of the Headway Election Challenge. Help us create a time capsule of this election year."
    },
    {
        "title": "Trump Stokes Fears About Haitian Migrants in a Pennsylvania Community",
        "date": "2024-09-24",
        "content": "His focus on Charleroi, Pa., comes after his debunked claims about Haitian migrants in an Ohio community helped stir a firestorm over immigration there."
    },
    {
        "title": "Trump Tells Women That They Won’t ‘Be Thinking About Abortion’",
        "date": "2024-09-24",
        "content": "“You will be protected, and I will be your protector,” said former President Donald J. Trump. Polls have shown he is struggling to cultivate support among women, for whom abortion rights remain a top issue."
    },
    {
        "title": "Trump Gets a Lift From Arizona Ticket-Splitters Backing a Democrat for Senate",
        "date": "2024-09-24",
        "content": "Representative Ruben Gallego, the Democratic candidate for Senate, leads in this key contest, a New York Times/Siena College poll found, while Kamala Harris trails Donald Trump."
    },
    {
        "title": "Harris Is Set to Visit Border, Trying to Cut Into Trump’s Immigration Edge",
        "date": "2024-09-24",
        "content": "During a trip to Arizona, Vice President Kamala Harris is expected to make her first visit to the southern border since becoming the Democratic nominee."
    },
    {
        "title": "Elon Musk Hails Italy’s Leader at Awards Ceremony",
        "date": "2024-09-24",
        "content": "Mr. Musk described Prime Minister Giorgia Meloni as “authentic, honest and thoughtful.” She used her Atlantic Council spotlight to defend Western values."
    },
    {
        "title": "A Leading Law Scholar Fears We’re Lurching Toward Secession",
        "date": "2024-09-24",
        "content": "Can we fix the Constitution before it destroys us?"
    },
    {
        "title": "Vance, Declining to Denounce Robinson, Lashes Out at Media Instead",
        "date": "2024-09-24",
        "content": "JD Vance, campaigning in North Carolina, criticized journalists for asking about Mark Robinson, the embattled Republican running for governor there."
    },
    {
        "title": "A Church Where Mark Robinson Still Has Defenders",
        "date": "2024-09-23",
        "content": "At a Black evangelical church in North Carolina, the candidate for governor still has support."
    },
    {
        "title": "Janet Jackson Repeats False Claims About Kamala Harris’s Race",
        "date": "2024-09-23",
        "content": "After Ms. Jackson told The Guardian that Ms. Harris is “not Black,” her representatives said a man who apologized on her behalf was not authorized to speak for her."
    },
    {
        "title": "Israel Launched Intense Airstrikes on Hezbollah",
        "date": "2024-09-23",
        "content": "Also, new polls were Trump’s best in weeks. Here’s the latest at the end of Monday."
    },
    {
        "title": "At U.N. Conference, Global Crises Collide With Fraught American Politics",
        "date": "2024-09-23",
        "content": "President Biden will speak at a time of deep uncertainty about the future of America’s role in the world."
    },
    {
        "title": "Tuesday Briefing: Israeli Airstrikes in Lebanon Kill Hundreds",
        "date": "2024-09-23",
        "content": "Plus, vintage soccer jerseys and the memories they preserve."
    },
    {
        "title": "As Investigations Swirl, Another Adams Official Resigns",
        "date": "2024-09-23",
        "content": "Dr. Ashwin Vasan, who led New York City out of the pandemic as its health commissioner, is the third top official to quit in recent weeks."
    },
    {
        "title": "A Congressman Had an Affair. Then He Put His Lover on the Payroll.",
        "date": "2024-09-23",
        "content": "Representative Anthony D’Esposito, a New York Republican, gave part-time jobs to both his lover and his fiancée’s daughter, in possible violation of House ethics rules."
    },
    {
        "title": "Trump Learned Nothing From the Obamacare Debate. Neither Did Vance.",
        "date": "2024-09-23",
        "content": "Their “concepts” would abandon people with pre-existing conditions."
    },
    {
        "title": "Tanzania’s President Vowed Opening for Opposition, but Detained Its Leaders",
        "date": "2024-09-23",
        "content": "The East African country’s leading opposition party said that its presidential candidate in the last election and its chairman were among dozens detained before a protest called to draw attention to the killing and abduction of government critics."
    },
    {
        "title": "Murder in U.S. Continues Steep Decline, F.B.I. Reports",
        "date": "2024-09-23",
        "content": "Homicides fell 11.6 percent nationwide in 2023, and violent crime overall fell by 3 percent after a surge in crime during the pandemic."
    },
    {
        "title": "Key Nebraska Republican Rejects Trump’s Push to Shake Up Electoral Map",
        "date": "2024-09-23",
        "content": "Mike McDonnell, a state senator, said he would not support an effort to change the state’s electoral system to winner take all, an outcome that could have cost Kamala Harris an electoral vote."
    },
    {
        "title": "A Day After Most of His Staff Resigned, Mark Robinson Is Continuing to Campaign",
        "date": "2024-09-23",
        "content": "The Republican lieutenant governor said he would hire new staff soon, following a CNN report linking him to disturbing comments on a porn site."
    },
    {
        "title": "Using Haitian Immigrants as a Campaign Issue",
        "date": "2024-09-23",
        "content": "Responses to a guest essay by Gov. Mike DeWine of Ohio and a column by Jamelle Bouie. Also: Donald Trump and Jewish voters; pagers in war; airport trays."
    },
    {
        "title": "Trump Says He Wouldn’t Run for President in 2028 if He Loses This Year",
        "date": "2024-09-23",
        "content": "The former president, who is the Republican nominee for the third time, would be 82 on Election Day in 2028. That’s older than President Biden is now."
    },
    {
        "title": "JD Vance Has Turned to a Minnesota Republican to Help Him Prepare for the Debate",
        "date": "2024-09-23",
        "content": "Donald J. Trump’s running mate invited Representative Tom Emmer to stand in for his fellow Minnesotan, Gov. Tim Walz, ahead of the vice-presidential debate next month."
    },
    {
        "title": "Inside a Trump Ad Hammering Harris Over Americans’ Economic Woes",
        "date": "2024-09-23",
        "content": "No viewer could miss the ad’s repeated connection of the vice president to “Bidenomics.” And as it portrays voters struggling to make ends meet, she is seen laughing gleefully."
    },
    {
        "title": "U.S. to Seek Attempted Assassination Charge for Trump Golf Course Suspect",
        "date": "2024-09-23",
        "content": "Prosecutors disclosed new information in a memo written to persuade a federal judge to detain the suspect indefinitely while he awaits trial."
    },
    {
        "title": "Biden Administration Proposes Ban on Chinese Software in Vehicles",
        "date": "2024-09-23",
        "content": "Federal officials acknowledged that few Chinese vehicles were on U.S. roads now, but said that the administration wanted to take proactive measures to strengthen national security."
    },
    {
        "title": "Global Threats",
        "date": "2024-09-23",
        "content": "We explore a report that details the threats faced by the U.S."
    },
    {
        "title": "Israel and Hezbollah Trade Fire, and Polls Find Trump Ahead in Sun Belt States",
        "date": "2024-09-23",
        "content": "Plus, the White Sox go for a record (low)."
    },
    {
        "title": "Another Trump Acolyte Finds Himself in Big Trouble",
        "date": "2024-09-23",
        "content": "The Mark Robinson story is yet another case of self-declared morality being at variance with actual behavior."
    },
    {
        "title": "State of the Race: A Small Debate Bounce for Harris, but It’s Still Deadlocked",
        "date": "2024-09-23",
        "content": "She gained a point in the polls after widely being seen as the debate winner."
    },
    {
        "title": "A Majority in Arizona Supports Establishing Right to Abortion, Poll Finds",
        "date": "2024-09-23",
        "content": "A ballot measure codifying “the fundamental right to an abortion” is supported by 58 percent of the state’s likely voters, according to a New York Times/Siena College poll."
    },
    {
        "title": "A Venezuelan Gang Reaches New York",
        "date": "2024-09-23",
        "content": "Law enforcement officials are working to curb the growth of Tren de Aragua, a gang that began in a Venezuelan prison and has been linked to crimes in other countries and several states in the U.S."
    },
    {
        "title": "Looking for a Superhero? Check the Public Library.",
        "date": "2024-09-23",
        "content": "You know something is wrong in America when beloved schoolteachers and librarians become the target of hate groups."
    },
    {
        "title": "Trump Shows Signs of Strength in Sun Belt Battlegrounds, Polls Find",
        "date": "2024-09-23",
        "content": "New polls from The New York Times and Siena College showed Donald J. Trump ahead in Arizona and leading in tight races in Georgia and North Carolina."
    },
    {
        "title": "The World Is a Mess. That Makes the Climate Crisis Harder to Solve.",
        "date": "2024-09-23",
        "content": "A transformed China, conflicts in Ukraine and elsewhere, and intractable clashes over money have pushed the prospects of progress to a new low."
    },
    {
        "title": "The Long, Strange Saga of Kamala Harris and Kimberly Guilfoyle",
        "date": "2024-09-23",
        "content": "More than two decades ago, the future vice president and the future conservative firebrand were rising legal stars in San Francisco. Then Ms. Guilfoyle accused Ms. Harris of trying to deny her a job."
    },
    {
        "title": "Accurate Polls Hinge on a Tricky Question: Who’s Actually Going to Vote?",
        "date": "2024-09-23",
        "content": "As the election nears, most pollsters are reporting responses from “likely voters.” The challenge is in figuring out who they are."
    },
    {
        "title": "I’m a Doctor, and I’m Worried About What Comes Next for Our Health Care System",
        "date": "2024-09-23",
        "content": "The next fights over health care won’t be legislative brawls or executive actions — they will be a deluge of battles in the courts."
    },
    {
        "title": "What Did ‘The West Wing’ Do to Us?",
        "date": "2024-09-23",
        "content": "As Aaron Sorkin’s political fantasy turns 25, its romance has aged better than its politics."
    },
    {
        "title": "‘I Cannot Have That Man Be My Governor’: A Stark Race Roils a Crucial State",
        "date": "2024-09-23",
        "content": "Josh Stein is fighting to prevent a MAGA takeover of North Carolina."
    },
    {
        "title": "JD Vance Is Wrong — Kamala Harris Isn’t Changing Her Accent",
        "date": "2024-09-23",
        "content": "She’s actually doing something quite presidential."
    },
    {
        "title": "How Lying Became Disinformation",
        "date": "2024-09-23",
        "content": "Today “disinformation” and “misinformation” are often invoked by the left in the same way “fake news” is by the right."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Polls in Arizona, Georgia and North Carolina",
        "date": "2024-09-23",
        "content": "Results of New York Times/Siena College polls of 2,077 likely voters in North Carolina, Georgia and Arizona conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the North Carolina Likely Electorate",
        "date": "2024-09-23",
        "content": "Results of a New York Times/Siena College poll of 682 likely voters in North Carolina conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Georgia Likely Electorate",
        "date": "2024-09-23",
        "content": "Results of a New York Times/Siena College poll of 682 likely voters in Georgia conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of North Carolina Registered Voters",
        "date": "2024-09-23",
        "content": "Results of a New York Times/Siena College poll of 682 registered voters in North Carolina conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Georgia Registered Voters",
        "date": "2024-09-23",
        "content": "Results of a New York Times/Siena College poll of 682 likely voters in Georgia conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Arizona Likely Electorate",
        "date": "2024-09-23",
        "content": "Results of a New York Times/Siena College poll of 713 likely voters in Arizona conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Arizona Registered Voters",
        "date": "2024-09-23",
        "content": "Results of a New York Times/Siena College poll of 713 registered voters in Arizona conducted from Sept. 17 to 21, 2024."
    },
    {
        "title": "Harris Campaign Says It Took In $27 Million at Wall Street Fund-Raiser",
        "date": "2024-09-23",
        "content": "The campaign said it was the vice president’s highest-grossing fund-raiser since she ascended to the top of the Democratic ticket."
    },
    {
        "title": "Top Aides Resign From Embattled North Carolina Candidate’s Campaign",
        "date": "2024-09-22",
        "content": "Most of the senior staff members on Lt. Gov. Mark Robinson’s campaign for North Carolina governor resigned on Sunday after reports that he had made a series of disturbing online comments."
    },
    {
        "title": "Congress Unveils Short-Term Spending Deal",
        "date": "2024-09-22",
        "content": "Speaker Mike Johnson dropped his demands for proof-of-citizenship voting requirements to strike a deal that includes more money for the Secret Service and funds the government through Dec. 20."
    },
    {
        "title": "The German Chancellor’s Party Ekes Out a Win Over the Far Right",
        "date": "2024-09-22",
        "content": "The narrow win by Olaf Scholz’s party came in a state election, the third in a series that was seen as a reflection of the national mood and a snapshot of the government’s popularity."
    },
    {
        "title": "Monday Briefing: Israel and Hezbollah Trade Threats",
        "date": "2024-09-22",
        "content": "Plus, a Russian military officer’s story of desertion and escape."
    },
    {
        "title": "Some Palm Beach Ballots Misspelled Tim Walz’s Name as ‘Tom’",
        "date": "2024-09-22",
        "content": "Officials in Palm Beach County, Fla., said that they had emailed 257 ballots to overseas voters before catching the error and correcting it."
    },
    {
        "title": "Criticizing Oprah, Trump Falsely Claims He Appeared on Her Show’s Final Week",
        "date": "2024-09-22",
        "content": "As he took aim at Oprah Winfrey’s interview of Vice President Kamala Harris, former President Donald J. Trump repeated a debunked claim that he was one of the show’s last guests."
    },
    {
        "title": "Controversies Erupt as Trump and G.O.P. Make Critical Push to Voters",
        "date": "2024-09-22",
        "content": "A Republican who reportedly called himself a “Black Nazi,” a false story about migrants eating cats and dogs, and a feud with Taylor Swift bring back a sense of chaos."
    },
    {
        "title": "More Than 700 Current and Former National Security Officials Back Harris",
        "date": "2024-09-22",
        "content": "A letter signed by former secretaries of state and defense endorsed Vice President Kamala Harris and said former President Donald J. Trump poses a threat to the nation’s defense and its democratic system."
    },
    {
        "title": "On the Trail, Trump and Vance Sharpen a Nativist, Anti-Immigrant Tone",
        "date": "2024-09-22",
        "content": "From calling for mass deportations to spreading false claims about migrants’ eating pets, former President Donald J. Trump and his running mate, Senator JD Vance of Ohio, are taking a hard line."
    },
    {
        "title": "The MAGA Movement Has Become a Problem for Trump",
        "date": "2024-09-22",
        "content": "He can no longer run as if he were a man alone."
    },
    {
        "title": "MAGA Wants Transgression, and This Is What Comes With It",
        "date": "2024-09-22",
        "content": "Want more Mark Robinsons? Vote for Trump."
    },
    {
        "title": "The Politics of Motherhood Become a Campaign-Trail Cudgel",
        "date": "2024-09-22",
        "content": "The presidential race has exposed a fault line in American political culture over the deeply personal decision to have children."
    },
    {
        "title": "A Republican and a Democrat Sit Across From Each Other. There’s No Punchline.",
        "date": "2024-09-22",
        "content": "One Small Step, an initiative that facilitates conversations between people with opposing views, is trying to tackle political polarization."
    },
    {
        "title": "The Surprising Reality of Political Violence in America",
        "date": "2024-09-22",
        "content": "After two apparent assassination attempts against Donald J. Trump, it’s easy to think our politics are becoming more violent. The research is not so clear."
    },
    {
        "title": "A Changed Montana May Decide Control of the U.S. Senate",
        "date": "2024-09-22",
        "content": "Republicans are trying to seize control of the U.S. Senate by ousting Jon Tester, the last Democrat holding statewide office in a state that not long ago had many of them."
    },
    {
        "title": "In Michigan, Democrats Hope to Benefit From a Post-Biden Surge of Youth Energy",
        "date": "2024-09-22",
        "content": "Democrats in the battleground state are counting on a sea change in the mood of young voters that could bolster their candidates in critical races that will determine who controls Congress."
    },
    {
        "title": "Harris Cracked Down on Violent Offenders; Showed Leniency on Less Serious Crime",
        "date": "2024-09-22",
        "content": "Her record as a prosecutor navigating both paths has left her open to criticism that she either betrayed liberal ideals or prioritized them over law and order."
    },
    {
        "title": "Only Connect: Meredith Monk’s Antidote to What Divides Us",
        "date": "2024-09-22",
        "content": "“Indra’s Net,” coming to the Park Avenue Armory, shows off the polymathic Monk’s artistry as she enters her 60th season as a performer and creator."
    },
    {
        "title": "How Trump Could Upend Taxation in America",
        "date": "2024-09-22",
        "content": "With slogans and in social-media posts, the former president has dribbled out ideas that, together, would fundamentally change how taxes are collected in the U.S."
    },
    {
        "title": "A French Fair as Workers’ Paradise, Feting Cuisine, Music and Communism",
        "date": "2024-09-22",
        "content": "The Fête de l’Humanité, a blend of Burning Man, Woodstock and a political convention, attracts the masses with bands, lectures and food, but here K.F.C. is C.F.K.: Communist Fried Kitchen."
    },
    {
        "title": "New Dynamics of Race Test Georgia’s Status as a Swing State",
        "date": "2024-09-22",
        "content": "Many voters in the Atlanta suburbs were newly hopeful when Vice President Kamala Harris entered the race. But conservative values are still deeply rooted in the state."
    },
    {
        "title": "Trump’s Base in North Carolina Still Supports Mark Robinson, but Some Doubt He Can Win",
        "date": "2024-09-21",
        "content": "At a Trump rally in Wilmington, N.C., many said they would still vote for the embattled Republican nominee for governor."
    },
    {
        "title": "Daniel J. Evans, 98, Washington State Governor Who Went to Senate, Dies",
        "date": "2024-09-21",
        "content": "A moderate Republican, he championed education, civil rights and environmental causes as a three-term governor and on Capitol Hill. He was eyed as a potential vice president."
    },
    {
        "title": "At a Rally in North Carolina, Trump Avoids Topic A: Mark Robinson",
        "date": "2024-09-21",
        "content": "The former president did not mention Mr. Robinson, the state’s embattled Republican nominee for governor, whom he once called “Martin Luther King on steroids.”"
    },
    {
        "title": "JD Vance to Appear With Tucker Carlson, Who Amplified False Holocaust Claims",
        "date": "2024-09-21",
        "content": "The Republican vice-presidential nominee will share a stage with Mr. Carlson, who was criticized for interviewing a writer who falsely claimed the Holocaust was not an intentional act of genocide."
    },
    {
        "title": "Harris Agrees to a Second Debate, but Trump Declines",
        "date": "2024-09-21",
        "content": "Vice President Kamala Harris, who was widely seen as the winner of the Sept. 10 debate against former President Donald J. Trump, has accepted a debate invitation from CNN."
    },
    {
        "title": "Arizona Court Allows 98,000 to Vote in State and Local Races Despite Database Glitch",
        "date": "2024-09-21",
        "content": "Officials recently discovered that some people with driver’s licenses issued before 1996 might not have proof of citizenship on file, a state requirement since 2004."
    },
    {
        "title": "Another Way of Looking at Jim Crow",
        "date": "2024-09-21",
        "content": "The purpose of segregation was as much to weaken labor as it was to institutionalize race hierarchy."
    },
    {
        "title": "Liz Cheney Suggests a New Political Party May Be Needed",
        "date": "2024-09-21",
        "content": "Ms. Cheney, a longtime Republican, said that the G.O.P. “has rejected the Constitution in the name of supporting Trump” and that Mike Johnson should not be speaker."
    },
    {
        "title": "He Makes Less Than $15,000 and Is Trying to Hold Springfield, Ohio, Together",
        "date": "2024-09-21",
        "content": "Mayor Rob Rue, whose job is supposed to be part time, finds himself dealing with bomb threats, false rumors and added pressures on city resources."
    },
    {
        "title": "Harris Enters Homestretch With a Far Bigger, Costlier Campaign Than Trump",
        "date": "2024-09-21",
        "content": "Kamala Harris is collecting more money, spending more money and sitting on more money than Donald J. Trump."
    },
    {
        "title": "Who Are the Black Swing Voters?",
        "date": "2024-09-21",
        "content": "Black voters are not monolithic. Astead W. Herndon, a national reporter for The New York Times and the host of the politics podcast “The Run-Up,” asks a political strategist, Prentiss Haney, and Maryland’s governor, Wes Moore, about how Democrats ..."
    },
    {
        "title": "Trump Heads to North Carolina as Mark Robinson’s Campaign Reels",
        "date": "2024-09-21",
        "content": "The former president is holding a rally in the battleground state as Mr. Robinson, whom he endorsed for governor, deals with the fallout from a report that he made disturbing online posts."
    },
    {
        "title": "The 2024 Election Is a Retreat From Ideology",
        "date": "2024-09-21",
        "content": "Whatever the Trump-Harris election season is delivering, it isn’t a grand ideological debate."
    },
    {
        "title": "How the Powerful Outmaneuvered the American Protest Movement",
        "date": "2024-09-21",
        "content": "It’s time for organizers to invent a new model."
    },
    {
        "title": "Padma Lakshmi: As a Cook, Here’s What I See in Kamala Harris",
        "date": "2024-09-21",
        "content": "The candidate is a proud cook, and cooking is a way to connect."
    },
    {
        "title": "Shoulder Season",
        "date": "2024-09-21",
        "content": "It’s still summer today, but fall arrives tomorrow. Take a minute to pause on the threshold."
    },
    {
        "title": "Trump’s Opponents See New Ways to Cast the G.O.P. as ‘Team Misogyny’",
        "date": "2024-09-21",
        "content": "The issue of gender dominated the campaign over a week that included a scandal in North Carolina and reporting on the fatal fallout of abortion bans."
    },
    {
        "title": "Every Falsehood, Exaggeration and Untruth in Trump’s and Harris’s Stump Speeches",
        "date": "2024-09-21",
        "content": "We fact-checked every sentence of two recent rally speeches and found that Mr. Trump spoke for almost three times as long as Ms. Harris, but told more than 10 times as many falsehoods or inaccurate statements."
    },
    {
        "title": "As President, Trump Demanded Investigations of Foes. He Often Got Them.",
        "date": "2024-09-21",
        "content": "Michael S. Schmidt, a New York Times investigative reporter, explains how Donald Trump used his power as president to intimidate and punish his rivals. Now, in the final weeks of his presidential campaign, Trump has ramped up promises to exact ret..."
    },
    {
        "title": "Where Joy Meets Anger: Harris and Trump Battle for Undecided Voters",
        "date": "2024-09-21",
        "content": "The allegiances of this group of voters — roughly three million people in seven battleground states — are up for grabs, and polling shows they’re pessimistic about the country’s future."
    },
    {
        "title": "As President, Trump Demanded Investigations of Foes. He Often Got Them.",
        "date": "2024-09-21",
        "content": "He has threatened to target his perceived enemies if elected again. A look at his time in the White House shows how readily he could do so."
    },
    {
        "title": "Rallying in Two Key States, Harris Presses Her Case on Abortion Rights",
        "date": "2024-09-21",
        "content": "Visiting Wisconsin after giving a speech in Georgia, the vice president signaled she would focus on the life-or-death risks of abortion bans in the final weeks of the race."
    },
    {
        "title": "How One Man’s Vote in Nebraska Could Change the Presidential Election",
        "date": "2024-09-21",
        "content": "A single Republican state senator appears to be holding back a push by Donald J. Trump to net a potentially pivotal electoral vote even before ballots are cast."
    },
    {
        "title": "With Robinson Candidacy, North Carolina Republicans Fear Damage to Years of Gains",
        "date": "2024-09-20",
        "content": "Explosive posts by the Republican candidate for governor, Mark Robinson, are sending waves of anxiety through a state party that has long been tactical and disciplined."
    },
    {
        "title": "Early Voting Begins in Minnesota, South Dakota and Virginia",
        "date": "2024-09-20",
        "content": "All three states began sending out mail ballots on Friday and now give people the option of voting in person."
    },
    {
        "title": "Timeline: What Donald Trump Has Said About Mark Robinson",
        "date": "2024-09-20",
        "content": "The former president was an early backer of Mr. Robinson’s bid to become governor of North Carolina, a race that was jolted when CNN reported that Mr. Robinson had made disturbing posts online."
    },
    {
        "title": "Kamala Harris Tells Oprah if Somebody Breaks Into Her Home, ‘They’re Getting Shot’",
        "date": "2024-09-20",
        "content": "The remarkable utterance underscored Democrats’ increasing comfort with the country’s gun culture, and how Harris is trying to use it to puncture notions about female candidates."
    },
    {
        "title": "Harris Slams G.O.P. Abortion Bans as a Painful ‘Health Care Crisis’",
        "date": "2024-09-20",
        "content": "“Donald Trump is the architect of this crisis,” Kamala Harris said in Georgia, where reporting this week found that the deaths of two women were a result of delayed treatment for medication abortions."
    },
    {
        "title": "Kentucky Town Is Shaken After Local Sheriff Is Charged With Killing Judge",
        "date": "2024-09-20",
        "content": "The two men were seen getting ready to go to lunch on the day of the shooting. Hours later, Judge Kevin Mullins was dead from multiple gunshot wounds."
    },
    {
        "title": "Inside a Harris Ad That Tries to Saddle Trump With Mark Robinson’s Baggage",
        "date": "2024-09-20",
        "content": "A new ad placed on Friday by Kamala Harris’s campaign, without mentioning the scandal threatening the North Carolina Republican’s run for governor, seeks to taint Donald Trump by association."
    },
    {
        "title": "These Voters Don’t Want to Commit to Trump or Harris. Here’s Why.",
        "date": "2024-09-20",
        "content": "Those still weighing their options are more likely  to be young, Black or Latino — and struggling. Many see their choice as the “lesser of two evils.”"
    },
    {
        "title": "Report Details Secret Service Failures Before Trump Assassination Attempt",
        "date": "2024-09-20",
        "content": "A Secret Service internal review concluded that it did not adequately prepare its local partners before a July 13 rally at which a gunman tried to assassinate former President Donald J. Trump."
    },
    {
        "title": "Trump’s Suggestion That Jews Could Cost Him Race Creates Fear of Antisemitic Reprisal",
        "date": "2024-09-20",
        "content": "Twice on Thursday, the former president said he believed “the Jewish people would have a lot to do with” a loss if Kamala Harris defeated him."
    },
    {
        "title": "The ‘Crank Realignment’ and the Paranoid Center",
        "date": "2024-09-20",
        "content": ""
    },
    {
        "title": "Democrats Seize on Robinson Scandal, Hoping to Sink Trump in a Key State",
        "date": "2024-09-20",
        "content": "Kamala Harris’s campaign quickly released a new ad to run in North Carolina featuring Donald Trump’s effusive praise for Mark Robinson, the Republican candidate for governor."
    },
    {
        "title": "A G.O.P.-Linked Group’s Contradictory Ads Cast Harris as Friend and Foe of Israel",
        "date": "2024-09-20",
        "content": "The Future Coalition PAC is targeting voters in Pennsylvania and Michigan, both swing states, with contradictory messages about the vice president’s level of support for Israel."
    },
    {
        "title": "Read the Summary of the Secret Service’s Internal Review",
        "date": "2024-09-20",
        "content": "The agency released a brief summary of its monthslong inquiry into the failures leading to the attempted assassination of former President Donald J. Trump in July. The complete report is not yet finished."
    },
    {
        "title": "Communication Failures Plagued Deadly Trump Rally, Secret Service Finds",
        "date": "2024-09-20",
        "content": "The agency found that it did not adequately prepare its local partners for the Butler, Pa., event, and its leader also cited lapses including complacency by some agents and technological breakdowns."
    },
    {
        "title": "Harris Praises Taylor Swift’s ‘Courage’ After Endorsement",
        "date": "2024-09-20",
        "content": "Kamala Harris noted, however, that she still won’t be rooting for the Kansas City Chiefs: “I am a 49ers fan, but who’s mad at anyone for being loyal to their team, right?”"
    },
    {
        "title": "Harris Has a Polling Edge in Wisconsin, but Democrats Don’t Trust It",
        "date": "2024-09-20",
        "content": "The vice president, who is visiting the state on Friday, has led Donald Trump there more often than not. Yet nearly everyone in Wisconsin politics believes the race will be incredibly close."
    },
    {
        "title": "Election 2024 Polls: Florida",
        "date": "2024-09-20",
        "content": "See the latest election polls and polling averages for Florida."
    },
    {
        "title": "Trump’s Victories at the Supreme Court",
        "date": "2024-09-20",
        "content": "Readers discuss a story about the chief justice’s role. Also: Loving children who are not your own; college football madness."
    },
    {
        "title": "Supreme Court Won’t Restore Jill Stein to the Nevada Ballot",
        "date": "2024-09-20",
        "content": "Democrats had argued that Ms. Stein, the Green Party’s presidential candidate, was ineligible because the party had failed to submit a required statement."
    },
    {
        "title": "Trump’s Impulse After Robinson Bombshell Report: Ignore, and Power Through",
        "date": "2024-09-20",
        "content": "CNN’s article scrambled G.O.P. plans for winning North Carolina. People close to Donald Trump are holding out hope Lt. Gov. Mark Robinson will decide to quit the governor’s race."
    },
    {
        "title": "Britain’s Hard-Right Firebrand Has Big Plans for His Anti-Immigration Party",
        "date": "2024-09-20",
        "content": "Nigel Farage, a Trump ally and Brexit champion, thinks Reform U.K. can become a major political force. At a conference on Friday, he sought to explain how."
    },
    {
        "title": "In Jan. 6 Case Filing, Trump Lawyers Again Demand Dismissal",
        "date": "2024-09-20",
        "content": "Testing procedure, and perhaps the judge’s patience, the former president’s team sought to short-circuit a process to consider how much of the indictment can survive the Supreme Court’s immunity ruling."
    },
    {
        "title": "Georgia Election Board Orders Hand-Counting of Ballots",
        "date": "2024-09-20",
        "content": "Critics say the move could significantly delay the reporting of results in the battleground state and inject chaos into the post-election period."
    },
    {
        "title": "Trump and Harris Enter the Final Sprint",
        "date": "2024-09-20",
        "content": "With Election Day just six weeks away, Maggie Haberman, a senior political correspondent for The New York Times, surveys the state of the presidential campaign."
    },
    {
        "title": "I’m the Republican Governor of Ohio. Here Is the Truth About Springfield.",
        "date": "2024-09-20",
        "content": "I have lived my entire life near this city. Our people and our history deserve better than to be falsely portrayed."
    },
    {
        "title": "Harris, With an Online Avalanche, Outspends Trump by Tens of Millions",
        "date": "2024-09-20",
        "content": "The week of their debate, Kamala Harris outspent Donald Trump by 20 to 1 on Facebook and Instagram. It was just one sign of how uneven their online advertising battle has become."
    },
    {
        "title": "The Trump Guide to Civil Discourse",
        "date": "2024-09-20",
        "content": "“Their rhetoric is causing me to be shot at.”"
    },
    {
        "title": "Now That Rates Are Falling, Let’s Turn to Other Matters",
        "date": "2024-09-20",
        "content": "The Federal Reserve has at last cut interest rates but our columnist points out a host of concerns that could weigh on financial markets."
    },
    {
        "title": "Fine, Let’s Do What JD Vance Wants: Talk About Immigration",
        "date": "2024-09-20",
        "content": "Yes, we need a debate over broken immigration policies. But is this really it?"
    },
    {
        "title": "Take It From a Scientist. Facts Matter, and They Don’t Care How You Feel.",
        "date": "2024-09-20",
        "content": "I am deeply troubled by the growing distrust of science in our society, just when its insights are most needed."
    },
    {
        "title": "How the Fastest-Growing County in Wisconsin Is Scrambling the Presidential Race",
        "date": "2024-09-20",
        "content": "Madison, Wis., and its blossoming suburbs are drawing newcomers for tech and health care jobs. With a swing state in the balance, Democrats see promise."
    },
    {
        "title": "A Concert Celebrates Jimmy Carter’s 100th Birthday, With Music and Thanks",
        "date": "2024-09-20",
        "content": "The B-52’s, BeBe Winans, Angélique Kidjo, Chuck Leavell and many others performed in Atlanta at a concert honoring the former president, who has been in hospice care."
    },
    {
        "title": "Late Night Thinks It’s Unlikely That Neighbors Ate Your Cat",
        "date": "2024-09-20",
        "content": "Before starting rumors about Haitians, please make sure your cat is actually missing, Ronnie Chieng implored on “The Daily Show.”"
    },
    {
        "title": "Harris Joins Oprah at Michigan Campaign Event",
        "date": "2024-09-20",
        "content": "The vice president answered questions from the audience, detailing her position on issues like immigration and gun control."
    },
    {
        "title": "Friday Briefing: Israel Bombarded Hezbollah",
        "date": "2024-09-20",
        "content": "Plus, a bright new kid-lit author"
    },
    {
        "title": "What Peru’s Dictator Left Behind",
        "date": "2024-09-20",
        "content": "Fujimori’s authoritarian streak lives on in Peru, even in those who claim to be against the former leader’s political movement."
    },
    {
        "title": "Harris Hits Core Campaign Themes in Emotional Forum With Oprah Winfrey",
        "date": "2024-09-20",
        "content": "Vice President Kamala Harris spoke off the cuff, as guests included a teenager shot at her school and the family of a woman in Georgia who died as a result of the state’s abortion ban."
    },
    {
        "title": "Trump Presses for More Support From Jewish Voters",
        "date": "2024-09-20",
        "content": "At a campaign event aimed to denounce antisemitism in America, Trump said he believed that “Israel will be wiped off the face of the Earth” if he doesn’t win."
    },
    {
        "title": "Trump Says That if He Loses, ‘the Jewish People Would Have a Lot to Do’ With It",
        "date": "2024-09-20",
        "content": "Speaking at a campaign event denouncing antisemitism in America, Donald Trump again attacked Jews who vote for Democrats, saying that the party had a “hold, or curse, on you.”"
    },
    {
        "title": "Kentucky Sheriff Arrested in Shooting Death of Judge",
        "date": "2024-09-20",
        "content": "The police say a sheriff shot District Judge Kevin Mullins inside the courthouse on Thursday afternoon before turning himself in."
    },
    {
        "title": "Republicans Try to Block Pennsylvania Voters From Fixing Problems With Ballots",
        "date": "2024-09-19",
        "content": "The Republican National Committee argued that counties do not have the authority to allow voters in the swing state to correct ballots that do not comply with the rules."
    },
    {
        "title": "Trump’s Allies Try to Revive Push to Make Nebraska Winner-Take-All Electorally",
        "date": "2024-09-19",
        "content": "Nebraska could deliver a critical electoral vote to Vice President Kamala Harris under its hybrid system of splitting votes in an otherwise red state."
    },
    {
        "title": "It’s Groundhog Day. It’s Anti-Woke Week. It’s Messaging Bill Fall.",
        "date": "2024-09-19",
        "content": "Lawmakers are forcing each other to take unpopular votes on bills destined to go nowhere."
    },
    {
        "title": "Top Georgia Republican’s Texts Highlight the Party’s Deep Divide on Trump",
        "date": "2024-09-19",
        "content": "Messages sent by Lt. Gov. Burt Jones of Georgia, a Trump ally, show the state party’s leadership fracturing in real time after the 2020 election."
    },
    {
        "title": "Springfield, Ohio, Braces for a Possible Trump Visit, Though Details Are Scarce",
        "date": "2024-09-19",
        "content": "Donald Trump promised to visit the city “in the next two weeks.” Some residents welcomed a visit, but others were opposed, as officials said preparations were underway."
    },
    {
        "title": "How the Robinson Report Could Affect the Presidential Race in North Carolina",
        "date": "2024-09-19",
        "content": "A Democratic presidential candidate has not won North Carolina since 2008. But the drama around Lt. Gov. Mark Robinson, the Republican nominee for governor, is sure to bolster their hopes."
    },
    {
        "title": "Israel Bombards Lebanon After Hezbollah Vowed Retaliation",
        "date": "2024-09-19",
        "content": "Plus, a record day for stocks."
    },
    {
        "title": "Friday Briefing: Israel Bombards Hezbollah",
        "date": "2024-09-19",
        "content": "Plus, French drag is here to stay."
    },
    {
        "title": "How North Carolina Republicans Could Replace Their Governor Nominee",
        "date": "2024-09-19",
        "content": "The deadline for a candidate to withdraw is midnight tonight, but Lt. Gov. Mark Robinson has vowed to stay in the race."
    },
    {
        "title": "Alaska Man Charged With Threatening 6 Supreme Court Justices",
        "date": "2024-09-19",
        "content": "It remained unclear whether the man, Panos Anastasiou, came close to carrying out his threats, and public records indicate that he is not affiliated with any political party."
    },
    {
        "title": "North Carolina Governor Race Jolted by Report That G.O.P. Nominee Called Himself a ‘Black Nazi’",
        "date": "2024-09-19",
        "content": "Mr. Robinson, the Republican nominee for governor of North Carolina, vowed to stay in the race and sought to deny the report, which also said he had defended slavery in online posts years ago."
    },
    {
        "title": "Inside the Secretive Facility Housing Migrants at Guantánamo Bay",
        "date": "2024-09-19",
        "content": "Reports and interviews shed new light on the holding center, where migrants’ calls with lawyers are monitored and some say they’ve been forced to wear blackout goggles."
    },
    {
        "title": "Why JD Vance Dropped Into My Inbox",
        "date": "2024-09-19",
        "content": "I used to think I knew him. History has proved me wrong."
    },
    {
        "title": "The Deadly Pager Attacks in Lebanon",
        "date": "2024-09-19",
        "content": "Readers discuss the wave of attacks in Lebanon. Also: Donald Trump’s golf outing; the state of bridges in America; the importance of voting."
    },
    {
        "title": "Stocks Hit Record High a Day After Fed’s Big Interest Rate Cut",
        "date": "2024-09-19",
        "content": "The S&P 500 rose 1.7 percent on Thursday, rallying a day after the Federal Reserve cut interest rates by half a percentage point."
    },
    {
        "title": "Kamala Harris and Oprah Winfrey to Stream Event From Michigan",
        "date": "2024-09-19",
        "content": "The two are meeting in a suburb of Detroit at a virtual event called “Unite for America,” which will featured members of some of the online groups that have coalesced around Ms. Harris."
    },
    {
        "title": "Why Can’t Kamala Harris Just Say This?",
        "date": "2024-09-19",
        "content": "Here’s a script with which she could explain her evolution."
    },
    {
        "title": "Threats Against Haitians Land at the Doorstep of The Haitian Times",
        "date": "2024-09-19",
        "content": "Racist emails. Swatting. Intimidated sources. The Haitian Times has been receiving some of the same threats that it has been covering in Springfield, Ohio."
    },
    {
        "title": "After Trump Assassination Attempts, Congress Debates Secret Service Funding",
        "date": "2024-09-19",
        "content": "Virtually everyone on Capitol Hill agrees that the Secret Service needs to do a better job. But Democrats and Republicans are at odds over whether to increase the agency’s budget."
    },
    {
        "title": "Vance Says He Will Keep Calling Haitians Legally in Springfield ‘Illegal’",
        "date": "2024-09-19",
        "content": "The immigrants are mainly in the United States under temporary protected status, which the executive branch can grant to people whose home countries are in crisis."
    },
    {
        "title": "Pete Buttigieg Plays Vance in Walz’s Debate Prep",
        "date": "2024-09-19",
        "content": "The transportation secretary, who acted as Mike Pence during Kamala Harris’s preparations for the 2020 vice-presidential debate, is again helping out as Tim Walz gets ready for his Oct. 1 clash."
    },
    {
        "title": "Legal Watchdog Group Warns Pro-Trump Lawyers Against Subverting Democracy in November",
        "date": "2024-09-19",
        "content": "New ads running in legal journals are warning lawyers: “Don’t lose your law license because of Trump.”"
    },
    {
        "title": "‘Uncommitted’ Group Says It Won’t Endorse Harris Over Gaza Concerns",
        "date": "2024-09-19",
        "content": "The group, which made its announcement as the vice president was set to travel on Thursday to Michigan, also urged supporters not to vote for Donald Trump or a third-party candidate."
    },
    {
        "title": "The Stakes on Immigration",
        "date": "2024-09-19",
        "content": "We cover the presidential candidates’ immigration policies."
    },
    {
        "title": "Polls Find Harris-Trump Deadlock, and Device Attacks Spread Fear in Lebanon",
        "date": "2024-09-19",
        "content": "Plus, legal problems for MrBeast’s reality show."
    },
    {
        "title": "Pope Francis Is Turning Certainty on Its Head",
        "date": "2024-09-19",
        "content": "How can different religions be “like different languages in order to arrive at God”?"
    },
    {
        "title": "Harris Ahead in Pennsylvania and Tied Nationally? Unpacking an Unexpected Result.",
        "date": "2024-09-19",
        "content": "Although it could simply reflect the normal variation of polling results, it may also point to a declining Trump edge in the Electoral College."
    },
    {
        "title": "After Fed Cuts Rates, Biden Claims Credit for Economy’s Strength",
        "date": "2024-09-19",
        "content": "The president said he was not declaring victory over inflation, but marking a pivot point for the recovery from pandemic recession."
    },
    {
        "title": "Who Do Voters Really Like? Taylor Swift.",
        "date": "2024-09-19",
        "content": "The pop star Taylor Swift has endorsed Vice President Kamala Harris — and is far more popular among Democrats and independents than Republicans."
    },
    {
        "title": "What Liberals Miss About the MAGA Movement",
        "date": "2024-09-19",
        "content": "David French explores what keeps Trump’s followers hooked."
    },
    {
        "title": "Considering a Third-Party Candidate? Get a Life.",
        "date": "2024-09-19",
        "content": "The danger isn’t nearly as great as it was a few months ago, but things could still get screwed up."
    },
    {
        "title": "The Political Cost to Kamala Harris of Not Answering Direct Questions",
        "date": "2024-09-19",
        "content": "Questions can be crystallizing for candidates and voters, and some politicians have had their finest moments answering tough questions on their feet."
    },
    {
        "title": "Harris Had Stronger Debate, Polls Find, but the Race Remains Deadlocked",
        "date": "2024-09-19",
        "content": "Kamala Harris holds an edge over Donald J. Trump in the battleground state of Pennsylvania. But new surveys found that the race remains a tossup nationally."
    },
    {
        "title": "The Democrats’ Plan to Get Skeptics on Their Side",
        "date": "2024-09-19",
        "content": "From Kamala Harris to Gov. Wes Moore,  a patriotic pitch to combat cynicism."
    },
    {
        "title": "How JD Vance’s Combative Conservatism Is Shaping Trumpism 2.0",
        "date": "2024-09-19",
        "content": "Donald Trump’s running mate has been leaning in on the lessons of ultra-online political rabble rousing."
    },
    {
        "title": "Forum 4 | What Is Your Relationship With News?",
        "date": "2024-09-19",
        "content": "Where and how do you get your news? How do you know whether to trust it? How do your sources of information affect your understanding of our world?"
    },
    {
        "title": "Cross-Tabs: September 2024 Inquirer/Times/Siena Poll of the Pennsylvania Likely Electorate",
        "date": "2024-09-19",
        "content": "Results of a Philadelphia Inquirer/New York Times/Siena College poll of 1,082 likely voters in Pennsylvania, including a poll of 408 voters in Philadelphia, conducted from Sept. 11 to 16, 2024."
    },
    {
        "title": "Cross-Tabs: September 2024 Times/Siena Poll of the Likely Electorate",
        "date": "2024-09-19",
        "content": "Results of a nationwide New York Times/Siena College poll of 2,437 likely voters, including a poll of 1,082 voters in Pennsylvania and Philadelphia, conducted from Sept. 11 to 16, 2024."
    },
    {
        "title": "Toplines: September 2024 Inquirer/Times/Siena Poll of Pennsylvania Registered Voters",
        "date": "2024-09-19",
        "content": "Results of a Philadelphia Inquirer/New York Times/Siena College poll of 1,082 registered voters in Pennsylvania, including a poll of 408 voters in Philadelphia, conducted from Sept. 11 to 16, 2024."
    },
    {
        "title": "Toplines: September 2024 Times/Siena Poll of Registered Voters Nationwide",
        "date": "2024-09-19",
        "content": "Results of a nationwide New York Times/Siena College poll of 2,437 registered voters, including a poll of 1,082 voters in Pennsylvania and Philadelphia, conducted from Sept. 11 to 16, 2024."
    },
    {
        "title": "Jimmy Fallon: With Trump in Town, New York Is ‘a Lot More Florida’",
        "date": "2024-09-19",
        "content": "The “Tonight Show” host quipped about the former president’s rally in Long Island on Wednesday."
    },
    {
        "title": "Thursday Briefing: More Device Explosions in Lebanon",
        "date": "2024-09-19",
        "content": "Plus the thrill of the Sichuan pepper."
    },
    {
        "title": "From a Long Island Rally, Trump Lobs Exaggerated Attacks at New York City",
        "date": "2024-09-19",
        "content": "Donald Trump told a raucous crowd that he would soon visit Springfield, Ohio, and Aurora, Colo., two cities that are focal points of his exaggerated claims about migrants in America."
    },
    {
        "title": "Iranian Hackers Sought to Pass Off Pilfered Information to Biden Team",
        "date": "2024-09-19",
        "content": "The emails were part of a sweeping effort by Iran to steal and disseminate sensitive internal communications between aides working for former President Donald J. Trump."
    },
    {
        "title": "New Jersey 10th Congressional District Special Election Results",
        "date": "2024-09-18",
        "content": "Get live results and maps from the 2024 New Jersey special election."
    },
    {
        "title": "It’s the Economic Vibe, Stupid",
        "date": "2024-09-18",
        "content": "Polling shows voters feel persistently sour about the economy, a confounding dynamic for Democrats."
    },
    {
        "title": "Trump’s Bogus Claims About Haitians Are Part of a Bigger Agenda",
        "date": "2024-09-18",
        "content": "The Springfield fable is part of a crusade to throw immigrants out of the country."
    },
    {
        "title": "House Defeats Johnson’s Spending Plan With Shutdown Looming",
        "date": "2024-09-18",
        "content": "Both Republicans and Democrats opposed the stopgap funding bill, which was tied to new rules requiring proof of U.S. citizenship to register to vote."
    },
    {
        "title": "In the Front Row at a MAGA Fashion Show",
        "date": "2024-09-18",
        "content": "On the runway were ball gowns, sequined jackets and, yes, hats."
    },
    {
        "title": "George Clooney Amps Up His Feud With Donald Trump",
        "date": "2024-09-18",
        "content": "The former reality TV host this year sniped at the movie star. Mr. Clooney just swiped back."
    },
    {
        "title": "Harris Warns of Mass Deportations and Detention Camps if Trump Is Elected",
        "date": "2024-09-18",
        "content": "Vice President Kamala Harris is trying to build support among Latino voters as polls show Americans trust former President Donald J. Trump over Democrats on the border."
    },
    {
        "title": "Thursday Briefing: A Second Day of Explosions in Lebanon",
        "date": "2024-09-18",
        "content": "Plus, Kamala Harris courts Latino voters."
    },
    {
        "title": "On ‘Survivor,’ Talking Politics Could Get You Voted Off the Island",
        "date": "2024-09-18",
        "content": "The show’s 47th season, which features Jon Lovett, a former Obama speechwriter, premieres Wednesday. But even in heated election years, presidential politics rarely intrudes."
    },
    {
        "title": "To Win Votes, Trump Floats an Array of Expensive Tax Cuts",
        "date": "2024-09-18",
        "content": "Whether he is speaking to retirees, corporate executives or tipped workers, former President Donald J. Trump has made a habit of promising tax cuts that could cost trillions."
    },
    {
        "title": "Melania Trump Defends Nude Modeling Work as She Promotes Book",
        "date": "2024-09-18",
        "content": "The former first lady called her past work a “celebration of the human form” in a video, the latest in a series promoting her memoir and appearing to reflect her deeply held beliefs."
    },
    {
        "title": "Teamsters Won’t Endorse a Candidate for President in 2024",
        "date": "2024-09-18",
        "content": "The Teamsters president, Sean O’Brien, has shown an openness to former President Donald J. Trump, dividing the powerful union. Neither candidate will be the beneficiary of its considerable organizing muscle."
    },
    {
        "title": "When We Try to Explain the Rise of Trump, We Don’t Look Back Far Enough",
        "date": "2024-09-18",
        "content": "The global war on terrorism changed the course of American history. So why have we forgotten about it?"
    },
    {
        "title": "Trump’s Talk of Prosecution Rattles Election Officials",
        "date": "2024-09-18",
        "content": "The former president has long claimed, despite evidence to the contrary, that elections are corrupt. What if he carries through with threats to prosecute the officials who run them?"
    },
    {
        "title": "Vance Complains About Democrats Using ‘Fascist.’ Trump Uses It Often.",
        "date": "2024-09-18",
        "content": "The Republican vice-presidential candidate blamed Democrats for political vitriol after Sunday’s apparent assassination attempt against Donald J. Trump."
    },
    {
        "title": "Harris Will Give Abortion Speech in Georgia After Deaths of Two Women",
        "date": "2024-09-18",
        "content": "The vice president has said the stories of pregnant women who have been denied or have been unable to gain access to medical care show the consequences of former President Donald J. Trump’s actions."
    },
    {
        "title": "How the Secret Service Missed Chances to Halt a Tragedy at a Trump Rally",
        "date": "2024-09-18",
        "content": "Communications gaps, unguarded warehouses and a lack of written instructions opened an opportunity for a gunman at a rally in Butler, Pa., in July."
    },
    {
        "title": "In Georgia, a New Showdown Is Brewing Over Election Rules",
        "date": "2024-09-18",
        "content": "The state election board was recently taken over by a conservative majority. Its latest proposals are dangerously late in the process and most likely illegal, according to the secretary of state."
    },
    {
        "title": "What Trump Has Said About Rates, and Why It Matters",
        "date": "2024-09-18",
        "content": "He has suggested that presidents should “have a say” on interest rates, though he later walked the comment back."
    },
    {
        "title": "‘Get Off the Fence,’ Bret Stephens",
        "date": "2024-09-18",
        "content": "Readers are upset by the columnist’s uncertainty about voting for Kamala Harris. Also: Donald Trump’s “audacity”; Afghanistan; teaching the Bible; pressure on teenagers."
    },
    {
        "title": "Sarah Huckabee Sanders Jabs at Harris for Not Having Biological Children",
        "date": "2024-09-18",
        "content": "“My kids keep me humble,” Ms. Sanders said at an event with former President Donald J. Trump. “Unfortunately, Kamala Harris doesn’t have anything keeping her humble.” The remark quickly drew backlash."
    },
    {
        "title": "When a Republican Governor Couldn’t Win on Abortion, He Tried to Cheat",
        "date": "2024-09-18",
        "content": "When ‘states’ rights’ means subverting the will of the people."
    },
    {
        "title": "111 Former G.O.P. Officials Back Harris, Calling Trump ‘Unfit to Serve’",
        "date": "2024-09-18",
        "content": "The signatories of a letter endorsing the Democratic vice president included former members of Congress, defense secretaries, C.I.A. directors and other national security officials."
    },
    {
        "title": "The Man Behind the End of Roe v. Wade Has Big Plans for America",
        "date": "2024-09-18",
        "content": "In the world of political fund-raising, there is hard money, soft money, dark money and Leonard Leo money."
    },
    {
        "title": "Trump Knows What He’s Doing in Springfield. So Does Vance.",
        "date": "2024-09-18",
        "content": "When you start talking about people “poisoning the blood of our country,” this is where you end up. And it’s not over."
    },
    {
        "title": "Is the Comedy-Club Booking Process Broken?",
        "date": "2024-09-18",
        "content": "The owners of a new spot say hiring comics based on referrals from other stand-ups is no guarantee the acts will be funny. Others say it’s all more nuanced."
    },
    {
        "title": "Paul Krugman on the Interest Rate Cut and What’s Next",
        "date": "2024-09-18",
        "content": "The Nobel-winning economist has some advice for Jerome Powell."
    },
    {
        "title": "Arizona’s Mormon Voters Are Divided on Trump",
        "date": "2024-09-18",
        "content": "American Mormon voters have traditionally voted Republican. But members of the Church of Jesus Christ of Latter-day Saints in Arizona have become increasingly disillusioned by former President Donald Trump. Kellen Browning, a New York Times report..."
    },
    {
        "title": "Trump Tries to Close Off a Chief Line of Attack: That He’s a Danger to Democracy",
        "date": "2024-09-18",
        "content": "Donald Trump has tried to link Democrats’ charge that he poses a “threat to democracy” to threats on his life. Meanwhile, he has heightened his own attacks on his rivals."
    },
    {
        "title": "A Fed Rate Cut Would Cap a Winning Streak for Biden and Harris on Prices",
        "date": "2024-09-18",
        "content": "Improved data on borrowing costs and price growth has buoyed consumers, but it might be coming too late to significantly affect the presidential race."
    },
    {
        "title": "The Real Reason the Harris Twang Is Driving Republicans Crazy",
        "date": "2024-09-18",
        "content": "Here’s a hint: It’s not about linguistic purity."
    },
    {
        "title": "How Concerned Are You About the Rise in Political Violence in America?",
        "date": "2024-09-18",
        "content": "Bomb threats and attempted assassinations are a growing part of the political landscape. Should that worry us?"
    },
    {
        "title": "The Fed Makes a Large Rate Cut and Forecasts More to Come",
        "date": "2024-09-18",
        "content": "Fed officials kicked off rate cuts with a half-point reduction, confident that inflation is cooling and eager to keep the job market strong."
    },
    {
        "title": "What R.F.K. Jr.’s Alliance With Trump Could Mean for Public Health",
        "date": "2024-09-18",
        "content": "Robert F. Kennedy Jr., who has long voiced doubts about vaccine safety, has hopes of influencing federal health policy. Could he finally get the chance?"
    },
    {
        "title": "Can Americans Have Democracy, Freedom and Other Nice Things?",
        "date": "2024-09-18",
        "content": "In “On Freedom,” Timothy Snyder looks at what kinds of societies help people thrive."
    },
    {
        "title": "How Donald Trump Learned to Pass the Buck",
        "date": "2024-09-18",
        "content": "In “Lucky Loser,” two investigative reporters illuminate the financial chicanery and media excesses that gave us the 45th president of the United States."
    },
    {
        "title": "Trump, Hardly New York’s Favorite Son, Brings His Message to Long Island",
        "date": "2024-09-18",
        "content": "Donald J. Trump’s rally in Nassau County on Wednesday is another sign of the area’s shift to the right, but some question his choice to spend time in a non-battleground state."
    },
    {
        "title": "Trump Makes Big Promises, With Little Detail, for Michigan’s Auto Industry",
        "date": "2024-09-18",
        "content": "At his first campaign event since the apparent assassination attempt on Sunday, Donald J. Trump used dire language to insist that if he loses in November it would crush auto jobs."
    },
    {
        "title": "Musk Super PAC Switches Field Plan Again in Arizona and Nevada",
        "date": "2024-09-17",
        "content": "The pro-Trump group America PAC, which was founded by the billionaire Elon Musk, has cut ties with a canvassing firm in two battleground states, just seven weeks before Election Day."
    },
    {
        "title": "Secret Service Scrambled After Trump’s Short Notice on Golf Outing",
        "date": "2024-09-17",
        "content": "The agency did not sweep the area where a gunman lay in wait for the former president at his club in Florida."
    },
    {
        "title": "Why Eric Adams Is Resisting Pressure to Oust Members of His Inner Circle",
        "date": "2024-09-17",
        "content": "Mayor Adams has been loyal to longtime aides despite growing calls for them to resign. It is a trait he has shown through his career."
    },
    {
        "title": "What Harris Must Do to Win Over Skeptics (Like Me)",
        "date": "2024-09-17",
        "content": "It’s not enough to be “Not Trump.”"
    },
    {
        "title": "Why the Story of the Golf Course Shooting Will Be Told Twice",
        "date": "2024-09-17",
        "content": "Florida’s governor says a state investigation is needed because federal agencies can’t be trusted."
    },
    {
        "title": "For Presidents, Golf Is a Refuge. For the Secret Service, It Can Be a Headache.",
        "date": "2024-09-17",
        "content": "Sitting and former presidents must be mindful of when and where they play. Ronald Reagan largely gave up the game after a man took hostages while he was at Augusta."
    },
    {
        "title": "Senate Republicans Block I.V.F. Protection Bill a Second Time, Breaking With Trump",
        "date": "2024-09-17",
        "content": "Democrats brought up the measure again to highlight Republican opposition to abortion rights and make the case to voters that the G.O.P. stance threatens access to reproductive health care."
    },
    {
        "title": "Trump Suggests Restoring the State and Local Tax Break He Once Limited",
        "date": "2024-09-17",
        "content": "Former President Donald J. Trump’s 2017 tax law capped the state and local tax deduction at $10,000. He said on Tuesday that he would lift that limit."
    },
    {
        "title": "Biden Administration Extends Review Period for Nippon Takeover of U.S. Steel",
        "date": "2024-09-17",
        "content": "U.S. Steel’s chief, David Burritt, expressed confidence on Tuesday that the sale of the American manufacturer to a Japanese owner would close “on its merits” despite bipartisan backlash."
    },
    {
        "title": "Second Apparent Assassination Attempt on Trump Prompts Alarm Abroad",
        "date": "2024-09-17",
        "content": "There is widespread concern that the November election will not end well and that American democracy has frayed to the breaking point."
    },
    {
        "title": "Harris Condemns Trump’s ‘Hateful’ Claims About Springfield, Ohio",
        "date": "2024-09-17",
        "content": "“This is exhausting, and it’s harmful,” Kamala Harris said during an interview. “And it’s hateful, and grounded in some age-old stuff that we should not have the tolerance for.”"
    },
    {
        "title": "America’s Role in the World Is Hard. It Just Got Much Harder.",
        "date": "2024-09-17",
        "content": "The explosion of wireless devices across Lebanon casts in sharp relief the challenges of U.S. foreign policy facing Kamala Harris or Donald Trump."
    },
    {
        "title": "Secret Service Told Trump It Needs to Bolster Security if He Keeps Golfing",
        "date": "2024-09-17",
        "content": "The agency’s acting director, Ronald L. Rowe Jr., met with Donald J. Trump on Monday in the aftermath of the apparent assassination attempt on Sunday."
    },
    {
        "title": "For Duckworth, Preserving I.V.F. Access Is Personal",
        "date": "2024-09-17",
        "content": "The Democratic senator has long pressed to safeguard the fertility treatment she used to conceive her children, which has now been thrust into the political conversation."
    },
    {
        "title": "The Republicans’ Dehumanizing Lies About Haitians",
        "date": "2024-09-17",
        "content": "Readers discuss the harm from the lies about immigrants eating dogs and cats. Also: The guns; Americans in exile; the pope and the election; the debates."
    },
    {
        "title": "Presidential Campaigns and Allies Plan $500 Million in TV and Radio Ads",
        "date": "2024-09-17",
        "content": "Groups backing Vice President Kamala Harris have reserved $332 million worth of airtime. Just about $194 million in ads will come from groups backing former President Donald J. Trump."
    },
    {
        "title": "$50 Billion in Aid to Ukraine Stalls Over Legal Questions",
        "date": "2024-09-17",
        "content": "U.S. and European officials are struggling to honor their pledge to use Russian assets to aid Ukraine."
    },
    {
        "title": "Harris Campaign Says She Will Meet the Press (on Her Terms)",
        "date": "2024-09-17",
        "content": "The vice president, who has granted few interviews as the Democratic nominee, is now ramping things up. But she is likely to focus on local outlets and nontraditional venues where voters get their news."
    },
    {
        "title": "The Presidential Horse Race",
        "date": "2024-09-17",
        "content": "Taking polls seriously can bring enormous benefits. The past few years have been a case study."
    },
    {
        "title": "Our Reporter on Trump and a New Era of Political Violence",
        "date": "2024-09-17",
        "content": "The latest apparent assassination attempt against Donald J. Trump indicates how much the American political landscape has been shaped by anger stirred by Mr. Trump and against him. Peter Baker, chief White House correspondent for The New York Time..."
    },
    {
        "title": "Zadie Smith on Populists, Frauds and Flip Phones",
        "date": "2024-09-17",
        "content": "The novelist on everything from the “amorphous” self to aging and mystery."
    },
    {
        "title": "Corey Lewandowski Was Fired in 2016. Why Is He Back at Trump’s Side?",
        "date": "2024-09-17",
        "content": "Donald Trump often finds comfort in Mr. Lewandowski’s feisty instincts and off-color humor. But some Trump aides worry about his penchant for making his own headlines."
    },
    {
        "title": "I’ve Studied the Polls. Here’s Why Harris Isn’t Running Away With It.",
        "date": "2024-09-17",
        "content": "Why it’s too early to join the “it’s over” chorus."
    },
    {
        "title": "‘A Face in the Crowd’ Isn’t About Trump. It Just Seems Like It.",
        "date": "2024-09-17",
        "content": "Elvis Costello and Sarah Ruhl’s musical adaptation of the 1957 film, a satire about a hustler turned power-hungry TV personality, hits the London stage."
    },
    {
        "title": "Why Taxpayers Are Funding Cuomo’s Legal Bills",
        "date": "2024-09-17",
        "content": "The former governor resigned because of sexual harassment charges, but under the law the public foots the bill for his defense."
    },
    {
        "title": "Will Lower Rates Unleash a Business Boom? It’s Complicated.",
        "date": "2024-09-17",
        "content": "For corporate America, this week’s expected interest rate cut carries risks along with rewards."
    },
    {
        "title": "Pelosi Blamed New York for House Losses. Hochul Wants Another Chance.",
        "date": "2024-09-17",
        "content": "The New York governor has rebuilt the state Democratic Party to help flip key swing seats in November. But can she stanch her own political bleeding?"
    },
    {
        "title": "Meta and YouTube Crack Down on Russian Media Outlets",
        "date": "2024-09-17",
        "content": "The owner of Facebook and Instagram said it would bar Russian media outlets including RT, while YouTube is removing channels it had already blocked."
    },
    {
        "title": "These 14 Undecided Young Voters Are Starting to Change Their Minds",
        "date": "2024-09-17",
        "content": "The focus group’s participants weigh Trump and Harris in the wake of the Sept. 10 debate."
    },
    {
        "title": "Ohio Governor Sends State Police to Springfield After Rash of Bomb Scares",
        "date": "2024-09-17",
        "content": "After Donald J. Trump spread a debunked rumor about the city’s Haitian immigrants, schools have endured dozens of bomb threats."
    },
    {
        "title": "Vance Blames the Left for Attempts on Trump’s Life",
        "date": "2024-09-17",
        "content": "The former president’s running mate also said that “censorship” lead to political violence."
    },
    {
        "title": "Suspect Never Took a Shot at Trump but Hid Undetected for 12 Hours",
        "date": "2024-09-16",
        "content": "Ryan W. Routh was charged with two federal gun crimes a day after Secret Service agents fired on him as he pointed a rifle toward the golf course where former President Donald Trump was playing."
    },
    {
        "title": "Secret Service Admits Not Searching Golf Course Perimeter, Drawing New Scrutiny",
        "date": "2024-09-16",
        "content": "The agency’s acting director, Ronald L. Rowe Jr., praised his agents’ actions but conceded that there was no sweep of the course at Donald Trump’s club that a gunman had staked out."
    },
    {
        "title": "What We Know About the Accused Gunman",
        "date": "2024-09-16",
        "content": "The man arrested after Secret Service agents opened fire while protecting Donald Trump was charged with two federal gun crimes on Monday."
    },
    {
        "title": "North Carolina Absentee Ballots Delayed After Fight Over RFK Jr.",
        "date": "2024-09-16",
        "content": "After dropping out of the race and endorsing Donald Trump, Robert F. Kennedy Jr. has been fighting in court to remove his name from ballots in several states."
    },
    {
        "title": "Tense Teamsters Meeting With Harris Ends With an Endorsement Still Dangling",
        "date": "2024-09-16",
        "content": "The Teamsters president, Sean O’Brien, indicated he could announce as soon as Wednesday which presidential candidate — if any — the union would back."
    },
    {
        "title": "Black Voters Matter Says It Will Spend $15 Million in Battleground States",
        "date": "2024-09-16",
        "content": "The nonpartisan group will mount a voter mobilization effort that includes radio ads, billboards and on-the-ground canvassing operations, with a focus on early voting."
    },
    {
        "title": "Tuesday Briefing: Suspect is Charged in Apparent Trump Shooting Attempt",
        "date": "2024-09-16",
        "content": "Plus, why you should binge “Shogun.”"
    },
    {
        "title": "Biden Celebrates Investments in Black Colleges While Promoting Harris",
        "date": "2024-09-16",
        "content": "At a conference for historically Black colleges and universities in Philadelphia, the president tallied up his administration’s contributions to “H.B.C.U. excellence.”"
    },
    {
        "title": "How Secret Service Details Are Assigned",
        "date": "2024-09-16",
        "content": "Levels of protection depend on a protectee’s position and the assessment of risk."
    },
    {
        "title": "How Trump Is Undermining the Economy in Some Struggling Cities",
        "date": "2024-09-16",
        "content": "Immigration to small cities creates jobs for everyone."
    },
    {
        "title": "Trump, Using Harsh Language, Urges Democrats to Tone Down Theirs",
        "date": "2024-09-16",
        "content": "The authorities have not provided information about the gunman’s motive in the apparent assassination attempt on Sunday, yet former President Donald J. Trump, who has his own history of using violent language, sought to blame Democrats."
    },
    {
        "title": "A Top E.U. Commissioner Resigns, Citing ‘Questionable Governance’",
        "date": "2024-09-16",
        "content": "The surprise resignation of Thierry Breton came after he accused Ursula von der Leyen, president of the European Commission, of pressuring France to nominate another candidate instead of him for commissioner."
    },
    {
        "title": "Trump Plans to Keep Campaigning as Scheduled",
        "date": "2024-09-16",
        "content": "Donald J. Trump’s travel schedule will not change in the aftermath of an apparent shooting attempt on Sunday, with trips this week planned to Michigan, New York and elsewhere."
    },
    {
        "title": "Trump, Outrage and the Modern Era of Political Violence",
        "date": "2024-09-16",
        "content": "The latest apparent assassination attempt against the former president indicates how much the American political landscape has been shaped by anger stirred by him and against him."
    },
    {
        "title": "Tim Walz, a ‘Snowman Melting,’ Tests His Appeal in the Sun Belt",
        "date": "2024-09-16",
        "content": "The Minnesota governor was picked for his appeal to the white working-class. The Harris campaign hopes he can reach other demographics, too."
    },
    {
        "title": "Read the Charges Against Ryan Routh, Suspect in Trump Shooting Attempt",
        "date": "2024-09-16",
        "content": "The man suspected of trying to kill former President Trump has been charged with two firearm counts."
    },
    {
        "title": "State of the Race: Early Signs of a Post-Debate Bounce for Harris",
        "date": "2024-09-16",
        "content": "It could be another week until the full scope of possible gains is evident."
    },
    {
        "title": "Elon Musk Writes, Then Deletes, a Post Musing About Threats to Biden and Harris",
        "date": "2024-09-16",
        "content": "His remark, just hours after what the authorities said was a second assassination attempt on Donald J. Trump, immediately drew outrage."
    },
    {
        "title": "A Second Attempted Assassination of Donald Trump",
        "date": "2024-09-16",
        "content": "What we know about the episode and the suspect."
    },
    {
        "title": "Israeli Defense Minister Tells U.S. Military Action Against Hezbollah Is Needed",
        "date": "2024-09-16",
        "content": "Meeting with a senior Biden administration adviser, Defense Minister Yoav Gallant said “the only way” for Israel to return its displaced citizens to the northern border is through military action against Hezbollah."
    },
    {
        "title": "In Senate, Democrats Hope 2024 Will Be a Record Year for Black Women",
        "date": "2024-09-16",
        "content": "With Vice President Kamala Harris at the top of the ticket and Senate seats open, Democrats could for the first time send two Black women to the chamber."
    },
    {
        "title": "We Cannot Go On Like This",
        "date": "2024-09-16",
        "content": "Is there a way for us to make the “American berserk” a little less … berserk?"
    },
    {
        "title": "Big Energy Issue in Pennsylvania Is Low Natural Gas Prices. Not Fracking.",
        "date": "2024-09-16",
        "content": "Energy businesses and farmers in western Pennsylvania are struggling because of prices, an issue that has not figured prominently in the campaigns of Donald J. Trump and Kamala Harris."
    },
    {
        "title": "Why Some Christians Don’t Want to Bring the Bible Into Public Schools",
        "date": "2024-09-16",
        "content": "As the idea of incorporating the Bible into classrooms gains traction, concerns about the mission of public schools — and differences across the faith — have led even some conservative Christians to push back."
    },
    {
        "title": "What Teens Told Us About Their Investment in the Election",
        "date": "2024-09-16",
        "content": "In Week 1 of the Headway Election Challenge, we heard from more than 200 teens."
    },
    {
        "title": "Teens, How Are You Informing Yourself and Others About the Election?",
        "date": "2024-09-16",
        "content": "It’s Week 2 of the Headway Election Challenge. Tell us how you sift through all the information out there."
    },
    {
        "title": "First He Went After Anita Hill. Now He’s Coming for Clarence Thomas.",
        "date": "2024-09-16",
        "content": "As a young conservative, David Brock smeared Hill, who accused the Supreme Court justice of sexual harassment. Now, in a new book, Brock is denouncing Thomas and the court’s rightward tilt — and contending with his own complicated past."
    },
    {
        "title": "One Issue on Which Israeli Extremists Are Mainstream",
        "date": "2024-09-16",
        "content": "Israel’s annexation of the occupied West Bank is not a prospect; it is a fact of life. Israelis and Palestinians live in a one-state reality."
    },
    {
        "title": "In New York Case, Signs of a Familiar China Playbook",
        "date": "2024-09-16",
        "content": "Linda Sun is just the latest member of the Chinese diaspora whom Beijing is accused of recruiting to influence Western democracies."
    },
    {
        "title": "Candice Bergen Lands a Political Jab With a ‘Murphy Brown’ Quip",
        "date": "2024-09-16",
        "content": "Bergen remarked that a Republican vice-presidential candidate “would never attack a woman for having kids.”"
    },
    {
        "title": "Trump Shaken but Upbeat After Secret Service Stops Gunman",
        "date": "2024-09-16",
        "content": "Former President Donald J. Trump was said to be shocked by what officials described as the second attempt on his life, but sought to reassure friends with humor."
    },
    {
        "title": "Second Assassination Attempt Raises New Questions About Secret Service",
        "date": "2024-09-15",
        "content": "That a gunman got close to former President Trump for the second time in about two months intensified questions about the agency’s broader protective capabilities."
    },
    {
        "title": "Morning Briefing: The Fallout of Trump’s False Claims",
        "date": "2024-09-15",
        "content": "Plus, Ye performs in China."
    },
    {
        "title": "Trump Safe After What F.B.I. Describes as an Assassination Attempt",
        "date": "2024-09-15",
        "content": "The Federal Bureau of Investigation said it was investigating what appeared to be a second assassination attempt on former President Donald J. Trump."
    },
    {
        "title": "Robert F. Kennedy Jr. Says He Is Being Investigated for Whale Carcass",
        "date": "2024-09-15",
        "content": "He made the claim at a campaign event for former President Donald J. Trump, whom he endorsed after ending his troubled independent bid for the presidency."
    },
    {
        "title": "Vance Sticks By Pet-Eating Claims and Says He’s Willing to ‘Create Stories’",
        "date": "2024-09-15",
        "content": "Mr. Vance, who amplified false claims that Haitian migrants in Springfield, Ohio, were eating pets, said he was willing “to create stories so that the American media actually pays attention.”"
    },
    {
        "title": "The N.F.L. Now Allows Helmet Caps",
        "date": "2024-09-15",
        "content": "Do they work?"
    },
    {
        "title": "Houthis Launch Missile at Central Israel",
        "date": "2024-09-15",
        "content": "The rare attack was an illustration of the evolving conflict in the Middle East between Israel and Iranian proxies."
    },
    {
        "title": "Harris Is Good on Abortion Rights. Now She Needs to Take It to 11.",
        "date": "2024-09-15",
        "content": "The vice president should triple down on the issue to clinch this race."
    },
    {
        "title": "Why Trump Won’t Say He Wants Ukraine to Win",
        "date": "2024-09-15",
        "content": "The country lies at the heart of overlapping conspiracy theories important to the former president."
    },
    {
        "title": "If You Like Tim Walz’s Earthy Politics, You Should Know About Paul Wellstone",
        "date": "2024-09-15",
        "content": "The Wellstone tradition of left-populism, once central to the Democratic Party’s brand, must be recovered."
    },
    {
        "title": "How the Last Eight Years Made Young Women More Liberal",
        "date": "2024-09-15",
        "content": "For a generation of girls raised to believe they could be anything, the Trump era moved their politics to the left, a new analysis shows."
    },
    {
        "title": "How the False Story of a Gang ‘Takeover’ in Colorado Reached Trump",
        "date": "2024-09-15",
        "content": "The claim that Aurora, Colo., has been overrun by gun-toting migrants stemmed from the city’s fight with a landlord. Now it is central to one of former President Donald J. Trump’s anti-immigrant campaign promises."
    },
    {
        "title": "This Airbnb Offers Unbeatable Views of Kamala Harris’s Past",
        "date": "2024-09-15",
        "content": "A Silicon Valley software engineer bought a modest one-bedroom condo in San Francisco once owned by the vice president. He rents it out."
    },
    {
        "title": "3 Georgia Women, Caught Up in a Flood of Suspicion About Voting",
        "date": "2024-09-15",
        "content": "An election skeptic challenged hundreds of voter registrations, including one for a voting rights activist. A county official is dealing with the mess."
    },
    {
        "title": "Abortion vs. Border Security: New Mexico House Race Tests Dueling Messages",
        "date": "2024-09-15",
        "content": "Representative Gabe Vasquez, a Democrat in a border district, is under attack by his Republican opponent on immigration policy. Can a pro-abortion access message help him prevail?"
    },
    {
        "title": "How Roberts Shaped Trump’s Supreme Court Winning Streak",
        "date": "2024-09-15",
        "content": "Behind the scenes, the chief justice molded three momentous Jan. 6 and election cases that helped determine the former president’s fate."
    },
    {
        "title": "Once Considered Foes, Iranian-Backed Groups Get a Warm Welcome From Iraq",
        "date": "2024-09-15",
        "content": "Hamas and the Houthis have opened offices in Baghdad, reflecting the two groups’ evolving relationship with Iraq as Tehran works to build a regional power bloc."
    },
    {
        "title": "In Springfield, Ohio, Threats Leave Haitian Residents Shaken",
        "date": "2024-09-15",
        "content": "Tension hangs over the city after a week of closings and lockdowns, and the strain of recent months has led some Haitian immigrants to consider moving to bigger cities."
    }
]